{"data": {"id": "1400031", "type": "fullArticle", "attributes": {"publishOn": "2013-05-03T14:21:59-04:00", "isLockedPro": false, "commentCount": 14, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"investing-501": {"id": 91841, "slug": "investing-501", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "ati": {"id": 2607, "slug": "ati", "kind": "common", "non_theme": true}, "industrial-goods": {"id": 17913, "slug": "industrial-goods", "kind": "common", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "non_theme": true}, "sa-submit": {"id": 9082, "slug": "sa-submit", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "metal-fabrication": {"id": 17927, "slug": "metal-fabrication", "kind": "common", "non_theme": true}, "materials": {"id": 15, "slug": "materials", "kind": "sector", "path": "/stock-ideas/basic-materials", "title": "Basic Materials", "sasource": "theme_breadcrumb"}}, "title": "Don't Wait For The Clouds To Clear - Buy ATI Now", "summary": [], "structuredInsights": null, "isPaywalled": false, "lastModified": "2013-05-03T14:34:33-04:00", "isModerated": false, "closestTradingDate": "2013-05-03", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": false, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Allegheny Technologies (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ATI\" title=\"ATI Inc.\">ATI</a></span>) deserves enormous credit for wisely reinvesting in its basic business despite fluctuating earnings, and we recommend purchasing shares. Too many U.S. industrial companies have increased dividends, made mistimed stock buybacks, or completed silly acquisitions. ATI is nearing the end of a long capital investment cycle that will leave it well-positioned for future growth and sustained profitability. Highly cyclical companies like ATI are notoriously difficult to understand, value, and predict. However, it has been our experience that investors with patience and courage can profit from owning the shares of volatile companies that are competently executing a solid long-term strategic plan.</p> <p>We will give an overview of ATI's business, make an attempt at valuation, and finally discuss some of the \"timing\" issues involved in our recommendation</p> <p><strong>Description</strong></p> <p>ATI is a difficult company to understand. It is in part a producer of many highly specialized steel alloys that have very interesting growth prospects, and above average profitability profiles. These products include titanium alloys that have increasing importance in the manufacturing of commercial jet airframes and jet engines. However, ATI is also a large producer of stainless steel products that are closer to what one could call \"commodity\" grade and cannot really be considered a specialty product. Stainless steel adds certain alloys (mainly nickel, but many other are used) to prevent corrosion and rust. Growth in these products in highly dependent on economic growth while competition is higher, and profitability is lower and much more volatile.</p> <p>The slide below is taken from ATI's 2012 annual report:</p> <p><b><img src=\"https://lh4.googleusercontent.com/q55yUCFVEWR7SyfzUxFv94cx_uX8PdoI3sQwyzBOuNlP5Scvs7tjhsZVWN67b6D6cibWfXd75x4YpPx8-jtsUwRgarroF2YhBGD9hcguy4z0A7el_IL_eJ5s\" hspace=\"6\" vspace=\"6\" width=\"480\" height=\"565\" fetchpriority=\"high\"></b></p> <p>Some important things to note:</p> <ol> <li><p>79% of sales are high-value products, only 21% is commodity grade</p></li> <li><p>Potential growth areas like aerospace and oil/gas are 51% of sales</p></li> <li><p>The remainder is widely diversified, with only an 8% exposure to the cyclical automotive business</p></li> </ol> <p><img src=\"https://static.seekingalpha.com/uploads/2013/5/2/saupload_trans.png\" loading=\"lazy\">The exciting<span class=\"paywall-full-content invisible\"> part of the story is the expected growth in titanium alloys in the aircraft market. After two decades of hyper-competition that led to too many bankruptcies to count, the U.S. airline industry seems to finally have its house in order. The rapid growth in Asian air travel has also contributed to solid long-term order book for both Airbus and Boeing. Titanium will be an important part of the new aircraft fleet. Few cyclical companies serve a rapidly growing market like that shown in the slide below.</span></p> <p class=\"paywall-full-content invisible\"><b><img src=\"https://lh5.googleusercontent.com/1nbZuIOj1qQWVtnncCSJCLS2R5ZmDRVMm-shL86DREuWkF5DAWMnfXrR6Xha-LgoeJHJb7h9_3xJVyv75xMw-Q7r3_y4aiGnoE_i1ai2DHpPe6MiJc8FTdYp\" hspace=\"6\" vspace=\"6\" width=\"480\" height=\"361\" loading=\"lazy\"></b></p> <p class=\"paywall-full-content invisible\"><em>Source: November 2012 Presentation.</em></p> <p class=\"paywall-full-content invisible\">ATI is part specialty metal producer, and also part a maker of a semi-commodity type of steel. Maybe part of ATI is similar to Precision Cast Parts (PCP), which sells for 3x book and 3x sales, and the other part is similar to Carpenter Technology (<a href=\"https://seekingalpha.com/symbol/CRS\" title=\"Carpenter Technology Corporation\">CRS</a>), which sells for 1x sales and 1.5x book. But most importantly, ATI has little in common with the big commodity steel producers like Nucor and U.S. Steel.</p> <p class=\"paywall-full-content invisible\"><strong>History</strong></p> <p class=\"paywall-full-content invisible\">ATI can trace its history back to a furnace that was used to make cannon balls for the Revolutionary War. Allegheny steel was used to build the Empire State Building. The company came public in 1987, and served as a \"white knight\" by acquired the conglomerate Teledyne in 1996. The combined company was later broken into three parts, with one becoming the ATI that exists today. ATI was spun out with too much debt, and had a near death experience in 2002-03 but emerged a stronger company. The stock went fro $2 to $120 in four years as earnings exploded to over $7.00/share in 2007.</p> <p class=\"paywall-full-content invisible\">Since 2004 ATI has spent over $3.7 billion on capital expenditures. That is roughly the current market capitalization of the company. Starting in 2004, the focus was on titanium and titanium alloys, and also nickel alloys. Given the growth prospects of those businesses it was money well spent. Then the company started a greenfield $500 million investment in a titanium sponge operation in Utah. That facility is just beginning to ramp up production. The final piece to this plan is completing the $1.2 billion hot-rolling and processing facility (HRPF). ATI's claim is that the mill will be \"the most powerful mill in the world producing specialty metals.\" This is not really added capacity, but it will help make products thinner and wider than the old mill allows. This mill basically replaces a 60-year-old facility. The facility will begin production in 2014. It is currently on time and on budget.</p> <p class=\"paywall-full-content invisible\">You can search through a lot of U.S. industrial and not find many that have rebuilt themselves in the past 10 years. This has all been self-funded, and the balance sheet is comfortable with 32% debt/cap and an unused revolver of $400 million. Richard Harshman, who has been CEO since 2010, leads management. It is important to note that Harshman comes from the number crunching side of the business. He worked his way up the financial side and became CFO in 2003. It has been our experience that these grand capital spending programs work best when a guy with a sharp pencil is in charge. If a dreamy engineer or a wild marketing guy were running ATI, we would have more concern that these plans would not eventually benefit shareholders.</p> <p class=\"paywall-full-content invisible\">In a world that is way too interested in short-term results, ATI has embarked on a true long-term plan. Just what Wall Street hates, and what value investors should cherish.</p> <p class=\"paywall-full-content invisible\"><strong>Valuation</strong></p> <p class=\"paywall-full-content invisible\">Valuing a cyclical company like ATI is an art and not a science. All you can do is try a few methods, mix them together, and see what you get. If you like precise models that value a company to two decimal points, do not read the remainder of this article.</p> <p class=\"paywall-full-content invisible\"><b>Earnings</b></p> <p class=\"paywall-full-content invisible\">Let's look at the last 10 years of earnings:</p> <p class=\"paywall-full-content invisible\"></p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table border=\"1\" cellpadding=\"0\" cellspacing=\"0\"> <tr> <td width=\"113\" valign=\"top\"><p><b>Year</b></p></td> <td width=\"113\" valign=\"top\"><p><b>EPS</b></p></td> </tr> <tr> <td width=\"113\" valign=\"top\"><p>2004</p></td> <td width=\"113\" valign=\"top\"><p>-$0.26</p></td> </tr> <tr> <td width=\"113\" valign=\"top\"><p>2005</p></td> <td width=\"113\" valign=\"top\"><p>$3.35</p></td> </tr> <tr> <td width=\"113\" valign=\"top\"><p>2006</p></td> <td width=\"113\" valign=\"top\"><p>$5.59</p></td> </tr> <tr> <td width=\"113\" valign=\"top\"><p>2007</p></td> <td width=\"113\" valign=\"top\"><p>$7.26</p></td> </tr> <tr> <td width=\"113\" valign=\"top\"><p>2008</p></td> <td width=\"113\" valign=\"top\"><p>$5.55</p></td> </tr> <tr> <td width=\"113\" valign=\"top\"><p>2009</p></td> <td width=\"113\" valign=\"top\"><p>$0.46</p></td> </tr> <tr> <td width=\"113\" valign=\"top\"><p>2010</p></td> <td width=\"113\" valign=\"top\"><p>$0.82</p></td> </tr> <tr> <td width=\"113\" valign=\"top\"><p>2011</p></td> <td width=\"113\" valign=\"top\"><p>$2.23</p></td> </tr> <tr> <td width=\"113\" valign=\"top\"><p>2012</p></td> <td width=\"113\" valign=\"top\"><p>$1.50</p></td> </tr> <tr> <td width=\"113\" valign=\"top\"><p>2013</p></td> <td width=\"113\" valign=\"top\"><p>$1.75 est.</p></td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span><p class=\"paywall-full-content invisible\">A simple average is about $3.00/share. Or, take the high and the low and split the difference, which gives you $3.50 in earning power. Since some of ATI's capital spending has not yet provided any returns, we would argue these estimates are low. ATI is a much better company today than it was 10 years ago.</p> <p class=\"paywall-full-content invisible\">It is very important to note to note that even though sales collapsed nearly 50% from 2008 to 2009, ATI was able to break even. Stop and think about that. How many cyclical companies can do that? The answer is not very many.</p> <p class=\"paywall-full-content invisible\">What kind of earnings multiple should you put on this stream? At least 10x (let's call the market multiple 15x), but you could argue for 12x with little difficulty. Peak earnings were $2.00/share in 2000 and $7.00/share in 2007. Sales and book value have grown 4%-6% over the last 10 years. ATI is more of a growth cyclical than a pure cyclical. So $3.00 at 10x, or $3.50 at 12x, gives you $30 to $40 very conservatively.</p> <p class=\"paywall-full-content invisible\"><b>Book Value<br></b></p> <p class=\"paywall-full-content invisible\">Book value is not a magic number that cyclical stocks will never trade below, but can be a useful guide toward a rough valuation estimate. The quality of ATI's book value is quite high. Most importantly ATI's financial record is not littered with the frequent charges found in the results of other industrials. Its pension plan is fully funded on an economic basis, though not on a GAAP basis. ATI does not expect to make a cash contribution in 2013. Again, this puts ATI ahead of other industrials.</p> <p class=\"paywall-full-content invisible\">ATI has been able to earn decent returns on this book value, over a 30% ROE at the top of the cycle. ATI has been able to steadily grow book value since the bottom of the 2002-03 cycle. ATI does have some goodwill on the balance sheet from the Ladish acquisition in 2011. This deal seemed to be a great strategic fit and was decently priced, and ATI said that it was accretive to earnings in 2012. ATI sells at a very modest 25% premium to a pretty clean book value. Relative to the average stock selling at over 2x book, the discount seems unwarranted.</p> <p class=\"paywall-full-content invisible\"><strong>Asset Value<br></strong></p> <p class=\"paywall-full-content invisible\">A key acquisition that dramatically solidifies our valuation argument is the November 2012 acquisition of Titanium Metals (TIE) by Precision Castparts. PCP paid 2x book, 10x peak (2006) earnings, and 2.5x sales for a titanium company run by legendary Dallas investor Harold Simmons. TIE is a competitor of ATI in many markets. Simmons spent very little on capital expenditures since 2000. If old capacity is worth such multiples, what is much newer capacity worth?</p> <p class=\"paywall-full-content invisible\">PCP has grown to be $15 billion specialty metals company by making numerous smart acquisitions. They are not dummies. We do not expect PCP to acquire ATI because of anti-trust concerns. We are interested that smart guys are buying specialty metals processors at premium multiples.</p> <p class=\"paywall-full-content invisible\"><strong>Valuation Summary<br></strong></p> <p class=\"paywall-full-content invisible\">All three valuation methods mixed together give us confidence the value of ATI is not $20/share, or even $25/share. We believe ATI has limited downside. We believe you can invest in ATI with a margin of safety. Does that mean ATI has no risk? Of course not -- a global worldwide depression could start next Tuesday. If so, ATI might not survive. A new competitor could build a new plant that would destroy profitability forever. What we do believe is that, given circumstances that might reasonably be expected to occur, ATI has significantly less downside risk than can be found in other stocks.</p> <p class=\"paywall-full-content invisible\"><strong>What About a Catalyst?<br></strong></p> <blockquote class=\"quote paywall-full-content invisible\"><p>It's always darkest before the dawn -- Florence and the Machine</p></blockquote> <p class=\"paywall-full-content invisible\">The timing of investments in cyclical stocks is a subject of much debate. It has been our experience that if you wait too long for a catalyst to become even slightly obvious, the stock has already run, and the attractive risk/reward tradeoff vanishes.</p> <p class=\"paywall-full-content invisible\">ATI is a classic example of what we have always called \"time arbitrage.\" ATI is finishing a very successful long-term plan. No one knows exactly when it will begin to work. Listening to the quarterly earnings calls is quite humorous. The Wall Street guys are searching for signs that a turn has occurred. They ask complex questions about trends in sequential margins. While all the time missing the point that ATI is a cheap stock. I can actually see the Wall Street analysts sitting in sober client meetings saying, \"ATI lacks visibility,\" and then quickly moving on to the next story where they are absolutely certain of their quarterly estimates.</p> <p class=\"paywall-full-content invisible\">By the time Wall Street is certain the turn has occurred, the stock will be will be $45. And a new report will come out of the mill with a $5.00 estimate a few years out, with a target price of $75. We will be selling our stock to them at $60, even though now the visibility is crystal clear but the risk/return tradeoff is no longer attractive. We will be looking for another value stock with \"low visibility,\" and patiently waiting for the clouds to clear.</p> <p class=\"paywall-full-content invisible\"><strong>Disclosure: </strong>I have no positions in any stocks mentioned, but may initiate a long position in <a href=\"https://seekingalpha.com/symbol/ATI\" title=\"ATI Inc.\">ATI</a> over the next 72 hours.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\"><strong>Business relationship disclosure:</strong> Business relationship disclosure: Investing 501 is a pair of analysts with over 60 years of professional investment experience. This article was written by Gregg Jahnke, one of our Founders. We did not receive compensation for this article (other than from Seeking Alpha), and we have no business relationship with any company whose stock is mentioned in this article.</p>", "twitContent": "$ATI - Don't Wait For The Clouds To Clear - Buy ATI Now. https://seekingalpha.com/article/1400031-dont-wait-for-the-clouds-to-clear-buy-ati-now?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "39951", "type": "author"}}, "sentiments": {"data": [{"id": "115417", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2607", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "91841", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17913", "type": "tag"}, {"id": "9082", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17927", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/1400031-dont-wait-for-the-clouds-to-clear-buy-ati-now", "canonical": "https://seekingalpha.com/article/1400031-dont-wait-for-the-clouds-to-clear-buy-ati-now", "uriImage": "https://lh4.googleusercontent.com/q55yUCFVEWR7SyfzUxFv94cx_uX8PdoI3sQwyzBOuNlP5Scvs7tjhsZVWN67b6D6cibWfXd75x4YpPx8-jtsUwRgarroF2YhBGD9hcguy4z0A7el_IL_eJ5s", "schemaImage": {"@type": "ImageObject", "url": "https://lh4.googleusercontent.com/q55yUCFVEWR7SyfzUxFv94cx_uX8PdoI3sQwyzBOuNlP5Scvs7tjhsZVWN67b6D6cibWfXd75x4YpPx8-jtsUwRgarroF2YhBGD9hcguy4z0A7el_IL_eJ5s"}}}, "included": [{"id": "39951", "type": "author", "attributes": {"company": null, "slug": "investing-501", "userId": 310283, "tagId": 91841, "bio": "<p>We have over 80 years of investment analysis experience. We have published investment research from the perspective of the buy side and the sell side. Our work has been used by institutions managing over $1 trillion in aggregate. We have published reports from both the long and short perspective and have worked with the largest short selling mutual fund in the world. We are long term value investors. It is our belief that, contrary to popular opinion, most individual investors and patient professional investors have the best opportunity since the beginning of our investment career to beat institutional and mutual fund managers in terms of risk adjusted performance. The \"Information Arbitrage\" advantage institutional investors have had is mostly eliminated, while the individual investor still can maintain an edge with \"Time Arbitrage\". Our goal is to provide institutional quality buy side articles that educate and stimulate investors in the hope of improving their returns. We also are willing to mentor young analysis who wish to improve their analytical skills. </p>", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/000/310/283/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/000/310/283/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/000/310/283/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/000/310/283/extra_large_pic.png"}, "nick": "Investing 501", "deactivated": null, "memberSince": 2008, "isRss": false, "contributorSince": 2012, "followersCount": 1202}, "relationships": {"user": {"data": {"id": "310283", "type": "user"}}, "userBioTags": {"data": [{"id": "73391", "type": "userBioTag"}, {"id": "73401", "type": "userBioTag"}, {"id": "73411", "type": "userBioTag"}, {"id": "73421", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/investing-501", "profileUrl": "/author/investing-501", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2607", "type": "tag", "attributes": {"slug": "ati", "name": "ATI", "company": "ATI Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "15", "type": "sector"}}}, "links": {"self": "/symbol/ATI"}}, {"id": "91841", "type": "tag", "attributes": {"slug": "investing-501", "name": "Investing 501", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/investing-501"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17913", "type": "tag", "attributes": {"slug": "industrial-goods", "name": "Industrial Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/industrial-goods"}}, {"id": "9082", "type": "tag", "attributes": {"slug": "sa-submit", "name": "SA Submit", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-submit"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17927", "type": "tag", "attributes": {"slug": "metal-fabrication", "name": "Metal Fabrication", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/metal-fabrication"}}, {"id": "115417", "type": "sentiment", "attributes": {"articleId": 1400031, "type": "bullish", "createdAt": "2013-05-03T14:21:59.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "1400031", "type": "article"}}, "tag": {"data": {"id": "2607", "type": "tag"}}}}]}