{"data": {"id": "1656612", "type": "fullArticle", "attributes": {"publishOn": "2013-08-26T09:27:55-04:00", "isLockedPro": false, "commentCount": 1, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"researchcows": {"id": 105132, "slug": "researchcows", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "ati": {"id": 2607, "slug": "ati", "kind": "common", "non_theme": true}, "industrial-goods": {"id": 17913, "slug": "industrial-goods", "kind": "common", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "metal-fabrication": {"id": 17927, "slug": "metal-fabrication", "kind": "common", "non_theme": true}, "materials": {"id": 15, "slug": "materials", "kind": "sector", "path": "/stock-ideas/basic-materials", "title": "Basic Materials", "sasource": "theme_breadcrumb"}}, "title": "Allegheny Technologies: Positioned To Capitalize And Treat Its Shareholders", "summary": [], "structuredInsights": null, "isPaywalled": false, "lastModified": "2013-08-26T09:27:55-04:00", "isModerated": false, "closestTradingDate": "2013-08-26", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>On the basis of diversification in specialty metal producers, Allegheny Technologies (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ATI\" title=\"ATI Inc.\">ATI</a></span>) is one of the world's leading producers. \"Change\" is the one constant. The pace with which \"change\" is taking place has never been so quick. <strong>Sustaining innovation</strong> maintains or grows ATI's position in legacy products. <strong>Game-changing innovation</strong> creates competitive advantage and advances ATI's leading position in specialty metals technology in its key growth markets, as well as in markets that are more focused on commodities.</p> <p>ATI's key global markets - Aerospace and Defense, Electrical Energy, Oil &amp; Gas/Chemical Process Industry (CPI) and Medical - are projected to grow faster than global GDP in the short-term and intermediate-term, which should help in offsetting the impact of the more short cycle GDP-growth dependent markets.</p> <p><img src=\"https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_0.png\" fetchpriority=\"high\"></p> <p><em>Source: ATI Annual Report 2012 - 10K</em></p> <p>The CPI, electrical energy, and construction/mining equipment markets continuously faced negative impact in the demand and pricing pressure of its products due to weak economic growth in the United States, slower growth in India, China and other developing economies, and negative growth in the Eurozone. Though the market fundamentals for the oil and gas, commercial aerospace, medical and automotive markets remained strong, due to the consistent falling price in the raw materials, especially titanium and nickel scrap, contributed to the weakening the demand of the jet engine aftermarket. Also, aggressive management of inventory in the supply chains and short lead times negatively impacted the short-term demand and prices for most of the company's products belonging to these markets.</p> <p><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_1.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_1_thumb.jpg\" loading=\"lazy\"></a></span></p> <p><em>Source: ATI 2Q 2013 Conference Call</em></p> <p>Recently, in ATI's second quarter earnings release, sales for 2Q13 amounted to $1.14 billion versus $1.36 billion in 2Q12. ATI's key markets represented approximately 69% of the total sales for 2Q13. The total sales as reported for the 1H13 amounted to $2.31 billion posting a decline of 15% compared to the corresponding period for<span class=\"paywall-full-content invisible\"> 2012.</span></p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_2.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_2_thumb.jpg\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em><strong>Lucrative growth in commercial aerospace market</strong></em></p> <p class=\"paywall-full-content invisible\">ATI has a high potential to post profits through the aerospace market and its operations. The new aircraft airframe design requires a large percentage of titanium alloys, and ATI being a leading producer of specialty metals, can significantly gain through it.</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_3.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_3_thumb.jpg\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">For example, the airframe (excluding engines) of the new Boeing 787 Dreamliner's airframe comprises more percentage of titanium and its alloys of the aircraft's total weight than any other previous commercial aircraft airframe.</p> <p class=\"paywall-full-content invisible\">Even the new aircraft designs from Airbus, the A380 and A350-XWB, and also from defense contractors, comprises more of titanium alloys. As per the current backlogs reported by Boeing and Airbus, as well as other engine manufacturers, the demand for the titanium alloys mill products is expected to significantly increase and last for several years. The Boeing and the Airbus have announced and implemented the increase in their productions. They have also announced that the production of their legacy and next generation aircraft is likely to increase over the next several years, which in turn are expected to positively impact the demand for titanium alloys and nickel-based superalloys for both airframe applications and jet engine.</p> <p class=\"paywall-full-content invisible\"><em><strong>Business Segments:</strong></em></p> <p class=\"paywall-full-content invisible\">ATI basically operates in three business segments: High-Performance Metals, Flat Rolled Products, and Engineered Products.</p> <p class=\"paywall-full-content invisible\">On the basis of the business segments, sales for the High Performance Metals, Flat-Rolled Products, and Engineered Products declined by 14%, 16% and 26% respectively.</p> <p class=\"paywall-full-content invisible\">The operating profit for these segments for 2Q13 was $71.7 million (6.3% of sales) versus $159.9 million (11.8% of sales) for 2Q12. This <a href=\"https://ir.atimetals.com/phoenix.zhtml?c=98187&amp;p=irol-newsArticle&amp;ID=1840413&amp;highlight=\" rel=\"nofollow\">decline in operating profit</a> of approximately $88.2 million was primarily due to:</p> <ol class=\"paywall-full-content invisible\"> <li>Lower shipments related to ATI's high value and standard products,</li> <li>Lower base selling prices of several other products, and</li> <li>The impact of raw material costs, which significantly increased for those products which have a longer manufacturing cycle and which do not have an alignment with surcharges on raw material.</li> </ol> <p class=\"paywall-full-content invisible\">Segment operating profit for 2Q13 in the High Performance Metals segment was $67.2 million, or 13.9% of sales, compared to $102.2 or 18.1% of sales for 2Q12.</p> <p class=\"paywall-full-content invisible\">Flat-Rolled Products segment operating profit was $1.4 million, or 0.3% of sales, compared to $44.5 million or 6.8% of sales for 2Q12.</p> <p class=\"paywall-full-content invisible\">Operating profit in Engineered Products segment was $3.1 million, or 3.1% of sales, for the 2Q13 compared to $13.2 million or 9.9% of sales for 2Q12.</p> <p class=\"paywall-full-content invisible\">During 2Q13, the cost reductions by ATI contributed approximately $40.1 million to the segment operating profit. Segment operating profit as reported for the 1H13 was $150.0 million.</p> <p class=\"paywall-full-content invisible\">As a percentage of sales, the segment operating profit, as reported for three and six month periods ended June 30, 2013 and 2012, was:</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_4.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_4_thumb.jpg\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em>Source: 10Q Second Quarter Results.</em></p> <p class=\"paywall-full-content invisible\"><em><strong>Hot-Rolling and Processing Facility - Game-Changing Innovation</strong></em></p> <p class=\"paywall-full-content invisible\">ATI is building the world's most powerful and technologically advanced specialty <a href=\"https://ir.atimetals.com/phoenix.zhtml?c=98187&amp;p=irol-newsArticle&amp;ID=1840413&amp;highlight=\" rel=\"nofollow\">metals Hot-Rolling and Processing Facility (HRPF)</a> in Brackenridge, PA at a projected cost of approximately $1.16 billion. The construction of the HRPF is expected to be finished late 2013, along with the assets which will be ready to put to use. ATI also expects that the Formal commissioning is likely to start in 1H14.</p> <p class=\"paywall-full-content invisible\">For the specialty metals flat rolled products, HRPF is a turn-around technology that provides ATI with a cost-competitive unsurpassed manufacturing process flow.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_5.png\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><em>Source: 10-K 2012 Annual Report</em></p> <p class=\"paywall-full-content invisible\">The HRPF is designed to produce an exceptional quality of thinner and wider hot-rolled coils which are cost effective with shorter lead times. The working capital requirements for such products are even low. It is expected that after the completion of HRPF project, ATI will experience an unheard of capability and versatility in manufacturing a range of specialty flat-rolled metal products. ATI expects that this new project will intensify the quality of its wide range of product mix for flat rolled specialty metals with improved productivity and lower costs.</p> <p class=\"paywall-full-content invisible\">This investment in the HRPF is expected to unlock new growth opportunities and post significant profits for all of its flat-rolled products. The HRPF enables both <strong>sustaining and game-changing innovation</strong>. The HRPF is designed to enable the development of future generation materials that cannot be produced today.</p> <p class=\"paywall-full-content invisible\"><em><strong>Growth in International Sales</strong></em></p> <p class=\"paywall-full-content invisible\">For the 1H13, direct international sales reported were $902.8 million, and comprised approximately 39% of total sales, versus $973.6 million, or 36%, of total sales for the first six months of 2012. The high value products contributed approximately 79% to the total of International sales for the six months ended June 30, 2013.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_6.png\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><em>Source: 10-K 2012.</em></p> <p class=\"paywall-full-content invisible\"><em><strong>Positioned to Capitalize</strong></em></p> <p class=\"paywall-full-content invisible\">ATI, since 2004, has significantly expanded and has continued to expand its manufacturing capabilities to meet the desired intermediate and long-term demand from the aerospace (airframe and engine), oil and gas, chemical process industry, medical markets and electrical energy, especially for titanium and titanium-based alloys, specialty alloys, nickel-based alloys, zirconium and related alloys.</p> <p class=\"paywall-full-content invisible\">The current capital expenditure projects include the overall expense related to the new advanced specialty metals HRPF of approximately $1.2 billion. Capital expenditures incurred for the first six months ended June 30, 2013 were $223.7 million, which were primarily in connection to the HRPF project. ATI expects that the total capital expenditure for the year 2013 is expected to be approximately $575 million, which comprises approximately 90% of the costs related to the HRPF project.</p> <p class=\"paywall-full-content invisible\">ATI expects that 2013 is the peak year of capital expenditures. ATI plans to fund their cap-ex with the help of the available cash on hand, which will also include the proceeds from the 2023 Notes, cash flow generated from its operations. If further required, ATI will use a portion of its $400 million unsecured domestic credit facility.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_7.png\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><em>Source: 10-K 2012</em></p> <p class=\"paywall-full-content invisible\">ATI is committed to capitalize on what they do well. ATI's future is being effectively created by the people working with it and by their commitment to relentless innovation. ATI expects to benefit from their product diversification and technology, both alloys and products. It is an experienced leader in specialty metals technology has been centered on creating the products and technology that allow industrial development and social progress throughout the world.</p> <p class=\"paywall-full-content invisible\">ATI is consistently focusing to deliver value for their customers by posting adequate profits and sustainable growth for its stockholders. ATI can experience a strong growth over the next 3 to 5 years as it is believed that the market conditions will favor ATI's operations.</p> <p class=\"paywall-full-content invisible\"><em><strong>Management's successful efficiency in reducing unessential costs</strong></em></p> <p class=\"paywall-full-content invisible\">In the short-term, ATI continues to concentrate on issues which are within its control. The priority lies in reduction of cost. The company is keen on cost reduction efforts, which has resulted in a gross <a href=\"https://ir.atimetals.com/phoenix.zhtml?c=98187&amp;p=irol-newsArticle&amp;ID=1840413&amp;highlight=\" rel=\"nofollow\">cost reduction of $79 million</a> and above for the 1H13. These cost reductions will surely benefit ATI's operations for the current year and several years to come. ATI is focused on reducing and managing working capital through various actions, which includes priority based initiatives to improve inventory turns. It was successful in reducing the managed working capital by $48 million in 2Q13 versus 1Q13, and was reduced to 39.8% of annualized sales at the end of June 2013 from 41.1% at year-end 2012.</p> <p class=\"paywall-full-content invisible\"><em><strong>ATI keen to treat its shareholder paying quarterly dividends</strong></em></p> <p class=\"paywall-full-content invisible\">Despite a huge cap-ex to be incurred for the year, ATI is focused on treating its shareholders with regular cash dividends. Recently, on Aug. 2, 2013, ATI announced that its Board of Directors has declared a regular cash dividend of $0.18 per share for 2Q13. The record date is Aug. 21, 2013 for the stockholders who are entitled to receive the dividend payment on September 18, 2013. Earlier this year, ATI has paid its regular quarterly cash dividend of $0.18 per common share on June 19, 2013.</p> <p class=\"paywall-full-content invisible\"><em><strong>Conclusion</strong></em></p> <p class=\"paywall-full-content invisible\">These secular growth markets are not dependent upon strong short-term GDP growth cycles in any one economy. Rather, the markets are responding to a long-term demographic shift, and the long-term infrastructure building and rebuilding occurring on a global basis.</p> <p class=\"paywall-full-content invisible\">ATI has following strategies and future outlook:</p> <ol class=\"paywall-full-content invisible\"> <li>Capital Investments and Strategic Acquisitions</li> <li>Lucrative growth in commercial aerospace market</li> <li>Cost Reduction</li> </ol> <p class=\"paywall-full-content invisible\">Change in Management ATI has a strategy to look beyond any short-term challenges and ensure it remains in a place for profitable growth within the foreseeable future. Their matchless variability in specialty metal products, customer responsiveness, unsurpassed manufacturing capabilities, increasingly competitive cost structure, and technology leadership are essential to any growth strategy in the metal sector.</p> <p class=\"paywall-full-content invisible\">The company has an impressive capital structure and the net debt to capitalization for 2Q13 stood at 37.2% versus 37.4% for the year ended Dec. 31, 2012. With strong position of the company in its industry and its relentless innovations, I am long on the stock.</p> <p class=\"paywall-full-content invisible\"><strong>Disclosure: </strong>I have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\"><strong>Business relationship disclosure:</strong> The article has been written by an Analyst at ResearchCows, ResearchCows is not receiving compensation for it (other than from Seeking Alpha). ResearchCows has no business relationship with any company whose stock is mentioned in this article. Any analysis presented herein is illustrative in nature, limited in scope, based on an incomplete set of information, and has limitations to its accuracy. The author recommends that potential and existing investors conduct thorough investment research of their own, including detailed review of the company's SEC filings, and consult a qualified investment advisor. The information upon which this material is based was obtained from sources believed to be reliable, but has not been independently verified. Therefore, the author cannot guarantee its accuracy. Any opinions or estimates constitute the author's best judgment as of the date of publication, and are subject to change without notice.</p>", "twitContent": "$ATI - Allegheny Technologies: Positioned To Capitalize And Treat Its Shareholders. https://seekingalpha.com/article/1656612-allegheny-technologies-positioned-to-capitalize-and-treat-its-shareholders?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "50512", "type": "author"}}, "sentiments": {"data": [{"id": "120786", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2607", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "105132", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17913", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17927", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/1656612-allegheny-technologies-positioned-to-capitalize-and-treat-its-shareholders", "canonical": "https://seekingalpha.com/article/1656612-allegheny-technologies-positioned-to-capitalize-and-treat-its-shareholders", "uriImage": "https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_0.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2013/8/12833651_13774242939774_0.png"}}}, "included": [{"id": "50512", "type": "author", "attributes": {"company": null, "slug": "researchcows", "userId": 12833651, "tagId": 105132, "bio": "ResearchCows is a team of qualified professionals, who provide quality Research Reports with utmost accuracy.", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/012/833/651/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/012/833/651/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/012/833/651/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/012/833/651/extra_large_pic.png"}, "nick": "ResearchCows", "deactivated": null, "memberSince": 2013, "isRss": false, "contributorSince": 2013, "followersCount": 149}, "relationships": {"user": {"data": {"id": "12833651", "type": "user"}}, "userBioTags": {"data": [{"id": "514236", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/researchcows", "profileUrl": "/author/researchcows", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2607", "type": "tag", "attributes": {"slug": "ati", "name": "ATI", "company": "ATI Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "15", "type": "sector"}}}, "links": {"self": "/symbol/ATI"}}, {"id": "105132", "type": "tag", "attributes": {"slug": "researchcows", "name": "ResearchCows", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/researchcows"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17913", "type": "tag", "attributes": {"slug": "industrial-goods", "name": "Industrial Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/industrial-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17927", "type": "tag", "attributes": {"slug": "metal-fabrication", "name": "Metal Fabrication", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/metal-fabrication"}}, {"id": "120786", "type": "sentiment", "attributes": {"articleId": 1656612, "type": "bullish", "createdAt": "2013-08-26T09:27:55.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "1656612", "type": "article"}}, "tag": {"data": {"id": "2607", "type": "tag"}}}}]}