{"data": {"id": "4211624", "type": "fullArticle", "attributes": {"publishOn": "2018-10-15T10:30:17-04:00", "isLockedPro": false, "commentCount": 66, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"nicholas-ward": {"id": 97701, "slug": "nicholas-ward", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "itw": {"id": 2752, "slug": "itw", "kind": "common", "non_theme": true}, "industrial-goods": {"id": 17913, "slug": "industrial-goods", "kind": "common", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "diversified-machinery": {"id": 17917, "slug": "diversified-machinery", "kind": "common", "non_theme": true}, "industrials": {"id": 20, "slug": "industrials", "kind": "sector", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "sasource": "theme_breadcrumb"}}, "title": "This Beaten-Down Dividend Aristocrat's Yield Nearly 50% Above Its 5-Year Average", "summary": ["Illinois Tool Works has sold off ~10% since the start of October.", "Shares are hovering near 52-week lows.", "The company's dividend yield is nearly 50% above its 5-year average."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2018-10-15T10:30:17-04:00", "isModerated": false, "closestTradingDate": "2018-10-15", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 17, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long ITW.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Illinois Tool Works (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ITW\" title=\"Illinois Tool Works Inc.\">ITW</a></span>) is a company that I wrote about <a href=\"https://seekingalpha.com/article/4196877-i-bought-illinois-tool-works-after-nearly-30-percent-dividend-increase\">buying back in August</a>. I initiated exposure to this dividend aristocrat after it announced a surprising 28.2% dividend increase. For months I'd been watching ITW as it fell from prior highs as the globalized industrial names sold off due to Chinese exposure and trade war fears. I'd stated several times that I had a $130 price target on ITW, but when the company announced the large dividend increase, its yield hit my target threshold and I decided to go ahead and make an entry level purchase at $140.59, locking in a 2.9% yield. Well, it turns out that I should have stayed patient and waited for my original $130 target because Chinese concerns are only growing and ITW's sell-off continues.</p> <p>For a little while there, I was feeling pretty smart. Prior to last week's sell-off, ITW had bounced off of recent lows and was on what appeared to be a steady comeback, trading up from recent lows at $135 to nearly $150. However, ITW took an absolute beating during the last couple of trading sessions and is now back down near 52-week lows.</p> <p>Shares are down ~10% since the start of October and even though they bounced a bit during Friday's recovery rally, ITW significantly performed the broader market averages, up only 1.02% compared to the S&amp;P 500's (<a href=\"https://seekingalpha.com/symbol/SPY\" title=\"SPDR® S&amp;P 500 ETF Trust\">SPY</a>) 1.42% increase. It appears that the industrials are still experiencing relative weakness and I'm not sure what it will take (other than the announcement of a trade agreement with China) to change the market's sentiment.</p> <p>But, I'm not here to complain. I'm no soothsayer and while I'm currently down a few bucks per share on my August ITW purchase, I still feel comfortable holding these shares long term. Not much has changed regarding ITW's<span class=\"paywall-full-content invisible\"> business between my August piece and this one; however, I wanted to revisit ITW because several followers have asked me about it recently due to share price weakness and I think this is an attractive discount worth highlighting for income-oriented investors.</span></p> <p class=\"paywall-full-content invisible\">Right now, ITW is trading for just 17.6x ttm earnings (my fair value estimate for ITW was 17.5x before I let that 28.2% dividend increase lower my standards as far as margin of safety is concerned). This is well below the company's long-term 19.8x multiple. ITW shares haven't seen ttm multiples this low since their pullback in Sept./Oct. of 2015. In other words, this dividend aristocrat is trading with its cheapest valuation in 3 years. In a market that is generally overpriced, it's hard to pass up a bargain like that.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2018/10/14/5939041-15395737570877497_origin.png\" rel=\"lightbox\" data-width=\"1638\" data-height=\"1102\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2018/10/14/5939041-15395737570877497.png\" width=\"640\" height=\"431\" data-width=\"640\" data-height=\"431\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></span></p> <p class=\"paywall-full-content invisible\">Source: <a href=\"https://www.fastgraphs.com/\" rel=\"nofollow\">F.A.S.T. Graphs</a></p> <p class=\"paywall-full-content invisible\">Furthermore, the combination of ITW's recent share price weakness and that big dividend increase have pushed the company's dividend yield to levels well above its 5-year average yield. During the last 5 years, ITW's average dividend yield was just 2.09%. Well, today, shares are yielding 3.06% (which is 47% higher than that 2.09% 5-year average). This 3.06% yield is also well above the S&amp;P 500's of just 1.82%. Over the long term, ITW has produced much better dividend growth than the broader market's average. Over the last 20 years, ITW's average annual dividend increase was 13.6% and the company's dividend growth CAGR over that same period of time was 13.3%. I don't expect to see ~30% increases like investors received in 2018 consistently moving forward, though I do think that dividend growth that is more in-line with historical averages is likely.</p> <p class=\"paywall-full-content invisible\">When a 3% yield compounds at a double-digit clip, it doesn't take long for the snowballing effect of the passive income produced to really get out of hand. Amidst all of the volatility and fear that is oftentimes associated with stock market fluctuations, this is what I like to focus on to calm myself down and ground myself in my DGI strategy.</p> <p class=\"paywall-full-content invisible\">Right now, ITW's annual dividend yield is $4.00/share. If the company is able to maintain its 13.3% historical average for another decade, then in 2028, you'll be looking at an annual dividend of $13.94. At today's share price of $130.67, we're talking about a 10.66% yield on cost, in just 10 years.</p> <p class=\"paywall-full-content invisible\">And, as we all know, compound interest works exponentially, so looking out 20 years, we're talking about an annual dividend of $48.60/share. This would represent a yield on cost of 37.2%.</p> <p class=\"paywall-full-content invisible\">Now, I suppose that asking for 13.3% annual dividend growth might seem like a lot. Sure, ITW has managed to produce it during the prior two decades, which included two significant bear markets, which gives me confidence moving forward, but for the sake of this piece, I'll lower the forward-looking dividend growth estimates to something much more conservative. Let's say: 7% (which, in all honesty, would be disappointing to me and is well below my expectations, but the point of this exercise is to show that buying beaten down DGI names with above average yields can work wonders in terms of boosting future income, even if dividend growth expectations are not met).</p> <p class=\"paywall-full-content invisible\">10 years down the road, if a 3.06% yielding ITW produced 7% annual dividend growth, today's $4.00 dividend would grow to $7.87. This represents a 6.02% yield on cost with today's share price. Looking out 20 years, we're talking about the $4.00 dividend growing into an annual payment of $15.48, which represents an 11.8% yield on cost. Still, not so bad, is it?</p> <p class=\"paywall-full-content invisible\">Obviously, all of this is speculative, but I've spent a lot of time studying dividend growth histories and I believe that it's much easier to predict dividend growth moving forward than it is to predict future share prices/total returns. At this point in time, ITW is an extremely mature business that has the strong cash flows required to compete and evolve over time. This company has a suite of dominant brands, a strong IP portfolio, and a global scale that give the company defensible moat against the competition. Will the trade war hurt ITW's business? Most likely, yes. But, will it destroy the company? I feel comfortable saying, \"No, far from it.\"</p> <p class=\"paywall-full-content invisible\">Analysts and the talking heads on the financial media screens will say that investors should be wary of purchasing shares of cyclical companies like ITW so late in an economic cycle. In a way, they're not wrong. However, I also think they're being a bit short-sighted.</p> <p class=\"paywall-full-content invisible\">While I say that ITW is trading at a discount here at ~17.5x earnings, it's important to realize that shares traded down significantly lower, to less than 10x earnings, during the great recession. This could happen again and if it did with ITW's current EPS expectations, we're talking about a ~$75 stock.</p> <p class=\"paywall-full-content invisible\">Granted, I don't see that happening anytime soon and when weighing the benefits of adding a reliable 3% yield with double-digit growth prospects versus the downside potential in the event that the world's economies fall apart, I'm willing to place my bets on ITW. No equity investment is ever truly safe. There will always be competition and the threat of demise. However, when I look at the way that ITW's management guided the ship through the recessionary waters in 08/09, I'm confident in their abilities.</p> <p class=\"paywall-full-content invisible\">ITW's EPS fell from $3.35 in 2007 to just $1.93 in 2009. As you can see on the F.A.S.T. Graph posted above, that means a -9% performance in 2008 followed by a -37% performance in 2009. That seems pretty terrible, right? Well, I suppose for those with short-term mindsets, it was pretty terrible. But, for others who remained confident in ITW's proven business model, it was only a slight bump in the road.</p> <p class=\"paywall-full-content invisible\">In 2010, ITW's EPS shot up ~60%, to $3.08. This was still a bit lower than the pre-recessionary levels but not by much. And then in 2011 and 2012, ITW posted EPS growth of 22% and 8%, respectively, meaning that even if you bought shares at the absolute pre-recessionary peak, it took less than 5 years for the shares that you own to be more productive than they were before. Furthermore, in 2018, ITW is expected to post full-year EPS of ~$7.65, meaning that they're more than doubled from pre-recessionary levels in just over a decade.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">This is why I don't worry too much about making late-cycle industrial purchases when it comes to the blue-chip names. This is why ITW is moving higher on my water list at the moment and it's why I may well add to the position that I initiated in August sometime in the near future.</p>", "twitContent": "$ITW - This Beaten-Down Dividend Aristocrat's Yield Nearly 50% Above Its 5-Year Average. https://seekingalpha.com/article/4211624-this-beaten-down-dividend-aristocrats-yield-nearly-50-percent-above-5-year-average?source=tweet ", "innerMarketing": null, "marketingBullet": null, "isReit": false, "videoData": null, "marketingBulletVariant": "I'm Nicholas Ward, a financial analyst covering dividend growth stocks. I am a contributor to the investing group <a href=\"/checkout?service_id=mp_1319&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A5939041%7Csection_asset%3Aauthor_bullets%3A-the-dividend-kings\" data-test-id=\"author-custom-template-link\">The Dividend Kings</a> where we teach members how to invest more wisely in dividend stocks.", "marketingBio": "Nicholas Ward is a Senior Investment Analyst with Wide Moat Research and the former editor-in-chief and portfolio manager at The Intelligent Dividend Investor, The Dividend Growth Club, and The Income Minded Millennial.  \n                                                                                                                                                                                                                               Nicholas is a contributor to the investing group <a href=\"/checkout?service_id=mp_1319&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A5939041%7Csection_asset%3Aauthor_root%3A-the-dividend-kings\" data-test-id=\"author-custom-template-link\">The Dividend Kings</a> where he shares analysis on dividend growth stocks. The Dividend Kings is a group of analysts, led by Dividend Sensei, that teach members how to invest more wisely in dividend stocks. The focus is on helping investors safeguard and grow their money in all market conditions through the highest-quality dividend investments. Features include: 13 model portfolios, buy ideas, company research reports, and a thriving chat community for readers looking to learn how to invest more intelligently in dividend stocks. <a href=\"/checkout?service_id=mp_1319&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A5939041%7Csection_asset%3Aauthor_root%3A-the-dividend-kings\" data-test-id=\"author-custom-template-link\">Learn more</a>.", "audioDuration": null}, "relationships": {"author": {"data": {"id": "44781", "type": "author"}}, "sentiments": {"data": [{"id": "238151", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2752", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "97701", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17913", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17917", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4211624-this-beaten-down-dividend-aristocrats-yield-nearly-50-percent-above-5-year-average", "canonical": "https://seekingalpha.com/article/4211624-this-beaten-down-dividend-aristocrats-yield-nearly-50-percent-above-5-year-average", "uriImage": "https://static.seekingalpha.com/uploads/2018/10/14/5939041-15395737570877497_origin.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2018/10/14/5939041-15395737570877497_origin.png"}}}, "included": [{"id": "1026", "type": "authorResearch", "attributes": {"createdAt": "2016-02-05T06:54:50-05:00", "title": "iREIT®+HOYA Capital", "rating": "4.8", "reviewCount": 456, "shortPitch": "Enrich Your Retirement with Safe and Reliable REIT Income", "categories": ["Income", "REITs"], "serviceAssistantIds": [17838342, 51680711, 50064784, 15127382, 2670, 10007051, 27886573, 49839830, 13800852, 50785209, 49836612, 4847251, 5764111, 57332724, 56579885, 31557165, 11947801, 60682554, 330973, 58613619, 54869375, 59404817], "inAppPurchasesAllowedInIos": true, "inAppPurchasesAllowedInAndroid": true, "activeSubscriptionsCount": 135534, "androidIapPlan": "semi_annual", "iosIapPlan": "annual", "description": "iREIT®+HOYA Capital helps members build a sustainable real estate portfolio for steady income generation. In addition to REITs, the service focuses on real income-producing asset classes: ETFs, closed-end funds, preferreds, homebuilders, and dividend champions across various investing vehicles. Members gain access to an extensive suite of Investment Research Trackers and Dividend Tools including data on more than 200 REITs, targeting dividend yields of up to 10%.", "landingPageColor": "light-green", "adUnits": ["direct_access", "trading_alert", "active_chat", "model_portfolio", "exclusive_idea", "wildcard"], "tempData": {}, "price": 81.0, "wildcardText": "CEO Interviews", "slug": "ireit-hoya-capital", "annualPriceWithDiscount": 519.2, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": true}, "relationships": {"author": {"data": {"id": "98286", "type": "author"}}}}, {"id": "44781", "type": "author", "attributes": {"company": null, "slug": "nicholas-ward", "userId": 5939041, "tagId": 97701, "bio": "<p>Nicholas Ward is a Senior Investment Analyst with Wide Moat Research and the former editor-in-chief and portfolio manager at The Intelligent Dividend Investor, The Dividend Growth Club, and The Income Minded Millennial. </p><p> Nicholas is a contributor to the investing group <a href=\"https://seekingalpha.com/checkout?service_id=mp_1319\">The Dividend Kings</a> where he shares analysis on dividend growth stocks. The Dividend Kings is a group of analysts, led by Dividend Sensei, that teach members how to invest more wisely in dividend stocks. The focus is on helping investors safeguard and grow their money in all market conditions through the highest-quality dividend investments. Features include: 13 model portfolios, buy ideas, company research reports, and a thriving chat community for readers looking to learn how to invest more intelligently in dividend stocks. <a href=\"https://seekingalpha.com/checkout?service_id=mp_1319\">Learn More</a>.</p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/005/939/041/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/005/939/041/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/005/939/041/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/005/939/041/extra_large_pic.png"}, "nick": "Nicholas Ward", "deactivated": null, "memberSince": 2012, "isRss": false, "contributorSince": 2013, "followersCount": 33655}, "relationships": {"user": {"data": {"id": "5939041", "type": "user"}}, "userBioTags": {"data": [{"id": "141833", "type": "userBioTag"}, {"id": "141843", "type": "userBioTag"}, {"id": "141853", "type": "userBioTag"}, {"id": "141863", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1026", "type": "authorResearch"}}}, "links": {"self": "/author/nicholas-ward", "profileUrl": "/author/nicholas-ward", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2752", "type": "tag", "attributes": {"slug": "itw", "name": "ITW", "company": "Illinois Tool Works Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "20", "type": "sector"}}}, "links": {"self": "/symbol/ITW"}}, {"id": "97701", "type": "tag", "attributes": {"slug": "nicholas-ward", "name": "Nicholas Ward", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/nicholas-ward"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17913", "type": "tag", "attributes": {"slug": "industrial-goods", "name": "Industrial Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/industrial-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17917", "type": "tag", "attributes": {"slug": "diversified-machinery", "name": "Diversified Machinery", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/diversified-machinery"}}, {"id": "238151", "type": "sentiment", "attributes": {"articleId": 4211624, "type": "bullish", "createdAt": "2018-10-15T10:30:17.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4211624", "type": "article"}}, "tag": {"data": {"id": "2752", "type": "tag"}}}}]}