{"data": {"id": "4213214", "type": "fullArticle", "attributes": {"publishOn": "2018-10-22T15:26:03-04:00", "isLockedPro": false, "commentCount": 43, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"dividend-power": {"id": 5966, "slug": "dividend-power", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "itw": {"id": 2752, "slug": "itw", "kind": "common", "non_theme": true}, "industrial-goods": {"id": 17913, "slug": "industrial-goods", "kind": "common", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "diversified-machinery": {"id": 17917, "slug": "diversified-machinery", "kind": "common", "non_theme": true}, "industrials": {"id": 20, "slug": "industrials", "kind": "sector", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "sasource": "theme_breadcrumb"}}, "title": "Illinois Tool Works Has Long-Term Dividend Growth But I'm Waiting To Buy", "summary": ["Illinois Tool Works is a Dividend King with 54 years of increasing dividends.", "The company is undervalued by some metrics.", "The company is facing cyclical downturn in some of its end markets.", "The company is also facing other near-term challenges for input costs and a stronger U.S. dollar."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2018-10-22T15:26:03-04:00", "isModerated": false, "closestTradingDate": "2018-10-22", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 15, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<h3>An Undervalued Dividend King<strong><em> </em></strong> </h3> <p>Illinois Tool Works (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ITW\" title=\"Illinois Tool Works Inc.\">ITW</a></span>) is appealing to many investors since it has a long history of consistent dividend increases dating back 54 years except for a period of government controls in 1971 and on that basis can be considered a Dividend King. There clearly exists a bullish case for buying the stock at the current price. The company’s stock price peaked in late January 2018 at $178.88 and since then it has declined ~29% to $127.03 this past Friday on October 19<sup>th</sup>,<sup> </sup>putting it squarely in correction territory. Simultaneously, the dividend yield has increased from ~1.8% to ~3.15% in the same time period, which is ~50% greater than its 5-year average. The decline in stock price has also lowered the PE ratio (FWD) to ~15.7, which is less than its long-term average of ~19.8. Furthermore, the dividend yield is greater than the average yield for the S&amp;P 500. Clearly, ITW can be considered undervalued based on the aforesaid metrics. But ITW recently indicated that it is facing near-term challenges. In Q2 2018, the company missed revenue estimates, although it was in line for EPS estimates. However, ITW also cut its outlook by $0.12 EPS due to the negative effect of a stronger dollar and further the company lowered its outlook for operating margin, suggesting that it is facing higher costs. Since then ITW’s stock price has been under pressure. But despite the slide in stock price, ITW may be in the early stages of a down cycle in some of its end markets. What is the near-term bearish case for not buying ITW now and why one may want to wait until purchasing shares of this long-term dividend grower?</p> <h3>ITW’s Businesses</h3> <p>Illinois Tool Works is a large industrial conglomerate that has 85 divisions categorized into seven<span class=\"paywall-full-content invisible\"> operating segments, including Automotive OEM, Test &amp; Measurement and Electronics, Food Equipment, Polymers and Fluids, Welding, Construction Products, and Specialty Products. Below we briefly review the different business segments.</span></p> <p class=\"paywall-full-content invisible\">The Automotive OEM segment is a niche supplier to the global automotive OEMs. This business segment has complex plastic injection molding and metal forming capabilities. It primarily produces plastic and metal components, fasteners and assemblies for automobiles, light trucks and other industrial uses.</p> <p class=\"paywall-full-content invisible\">The Test &amp; Measurement and Electronics segment is a branded producer of equipment, consumables, and related software for testing and measuring of materials, structures, gases and fluids, as well as equipment and consumables used in the production of electronic subassemblies and microelectronics. This includes consumables for soldering, packaging and pressure sensitive adhesives.</p> <p class=\"paywall-full-content invisible\">The Food Equipment segment is the branded industry leader in commercial food equipment, and food service, food institutional/restaurant and food retail markets. Businesses in this segment produce washing equipment, cooking equipment, refrigeration equipment, food processing equipment, and kitchen exhaust and ventilation systems. This segment includes well-known brands such as Hobart and Vulcan.</p> <p class=\"paywall-full-content invisible\">The Polymers &amp; Fluids segment is a branded supplier of engineered adhesives, sealants, lubrication and cutting fluids, and fluids and polymers (epoxies, fillers, coatings, etc.) for the auto aftermarket. This segment also makes products for the construction and general industrial markets.</p> <p class=\"paywall-full-content invisible\">The Welding segment is a branded equipment and specialty consumable manufacturer, including the well known Hobart and Miller Electric brands. Businesses in this segment produce arc welding equipment, arc welding consumables and accessories, and metal jacketing and other insulation. End markets include shipbuilding, energy, construction, and automotive industries.</p> <p class=\"paywall-full-content invisible\">The Construction segment is a branded supplier of engineered fastening systems and solutions serving the residential construction, renovation/remodel, and commercial construction markets. This business segment produces fasteners and fastening tools for wood and metal, anchors, fasteners and tools for concrete, metal plate truss components and related equipment and software; and packaged hardware, fasteners, anchors and other products for retail.</p> <p class=\"paywall-full-content invisible\">The Specialty Products segment provides patent-protected beverage packaging equipment and consumables, product coding and marking equipment and consumables, and appliance components and fasteners. This segment primarily serves the food and beverage, consumer durables, general industrial, printing and publishing and industrial capital goods markets.</p> <p class=\"paywall-full-content invisible\">It is clear that ITW is a diversified industrial conglomerate not dependent on any one product or business. Although the company’s businesses are divided into seven distinct operating segments, there is overlap between them on the end markets they serve. For example, the Test &amp; Measurement and Electronics and Polymers &amp; Fluids segments also sell products and services to the automotive industry, although they are not part of the Automotive OEM segment.</p> <h3 class=\"paywall-full-content invisible\">Diversified Revenue and Operational Excellence Leads to Accelerating Dividend Growth</h3> <p class=\"paywall-full-content invisible\">The chart below illustrates revenue by business segment in 2017. The largest segment is Automotive OEM with ~$3.3B in revenue or ~23.2% of the total and the smallest segment is Welding with ~$1.5B in revenue or ~10.6% of the total. No single segment exceeds ~25% of total revenue for the company, supporting the thesis that ITW is a broadly diversified industrial conglomerate. But at the same time, the company has a significant presence as a supplier to the automotive and construction industries, which together make up ~35.2% of total revenue in 2017. In addition, three other business segments sell to the automotive and construction industries likely making that number a lower bound.</p> <p class=\"paywall-full-content invisible\">However, total revenue has been choppy the past five years due to cyclicality of its end markets combined with reducing the number of divisions. For example, the oil &amp; gas industry experienced a slowdown as the price of oil dropped from near $100 ppb in 2014 to sub-$40 ppb in early 2016 after which it started to increase. The decline in oil prices paralleled ITW’s decline in revenue from ~$14.5B in 2014 to ~$13.4B in 2015 and ~$13.6B in 2016.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2018/10/21/60842-15401452950113351_origin.png\" rel=\"lightbox\" data-width=\"1503\" data-height=\"1077\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2018/10/21/60842-15401452950113351.png\" width=\"640\" height=\"459\" data-width=\"640\" data-height=\"459\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></span>Source: DP Research, 2017 ITW Investor Presentation</p> <p class=\"paywall-full-content invisible\">The company’s senior management has executed its strategic vision and business plan exceedingly well by simplifying the operating structure, reducing the number of division, improving the supply chain, and changing from an acquisition growth model to an organic growth model. In turn, this has resulted in significant increases to operating margins between 2012 and 2017. In 2012, the margins ranged 12%-25% for the seven business segments, and by 2017, the margins had increased for all seven segments and all were greater than 23% ranging 23%-27% as illustrated in the chart below. Furthermore, the company reportedly has operating margins that exceeded its peer group in each segment and in some cases by a significant differential as seen in the chart below.</p> <p class=\"paywall-full-content invisible\"><strong>Operating Margins Have Increased from 2012 to 2017</strong></p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2018/10/21/60842-15401453229552226_origin.png\" rel=\"lightbox\" data-width=\"1151\" data-height=\"572\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2018/10/21/60842-15401453229552226.png\" width=\"640\" height=\"318\" data-width=\"640\" data-height=\"318\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span>Source: 2017 ITW Investor Presentation</p> <p class=\"paywall-full-content invisible\"><strong>Operating Margins Are Greater Than Its Peers</strong></p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2018/10/21/60842-15401453387894633_origin.png\" rel=\"lightbox\" data-width=\"1137\" data-height=\"599\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2018/10/21/60842-15401453387894633.png\" width=\"640\" height=\"337\" data-width=\"640\" data-height=\"337\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span>Source: 2017 ITW Investor Presentation</p> <p class=\"paywall-full-content invisible\">The large improvement in operating margins has in turn permitted the company to maintain good free cash flow even during industry-specific slowdowns such as in energy market and driven a rapidly increasing dividend. The dividend payout ratio was ~22% in 2012 and grew to ~43% in 2017 and is targeted to grow to ~50% in 2022. The chart below shows the dividend growth rate over the past 10 years was ~11.6%. Note that there have been significant dividend increases in past three years and the growth rate has accelerated to ~16.1%. Furthermore, the forward dividend payout is $3.56 in 2018 after the most recent increase. The dividend and its growth is supported by a balance sheet with ~$1.6B in cash in Q2 2018 but only ~$1.3B in short-term debt. Long-term debt is only ~$6.07B, which is not large for a company of ITW’s size.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2018/10/21/60842-1540145357674234_origin.png\" rel=\"lightbox\" data-width=\"1453\" data-height=\"757\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2018/10/21/60842-1540145357674234.png\" width=\"640\" height=\"333\" data-width=\"640\" data-height=\"333\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span>Source: DP Research, SA</p> <p class=\"paywall-full-content invisible\">In terms of revenue, organic growth, and operating margins, ITW continues to perform well in 2018 based on these metrics. Revenue increased from 1H 2017 to 1H 2018 by roughly 7% and EPS by about 20%. This included about 3% organic revenue growth and all seven business segments reportedly experienced organic revenue growth. Operating margin increased 50 bps for the company as a whole in the same time period. However, there are signs that the company is more recently experiencing a slowdown and input cost pressures in a few of its end markets. Automotive OEM, Food Equipment, and Polymers &amp; Fluids have had flat to very low single-digit organic growth in 2018 as seen in Table 1. Both Test &amp; Measurement and Electronics and Construction Products have decelerating organic growth. Furthermore, operating margins for the Automotive OEM segment has decreased, indicating rising costs. In addition, relative to Q2 2017, the Food Equipment, Polymers &amp; Fluids, and Specialty Products segments had small decreases in operating margin. Note that the Welding and Specialty Products segments continue to perform well based on the table presumably because the energy and packaging end markets are growing.</p> <p class=\"paywall-full-content invisible\">In addition, the company has reportedly reduced its operating margin guidance from between <a href=\"https://www.fool.com/investing/2018/08/28/are-these-2-dividend-aristocrat-stocks-to-buy-toda.aspx\" rel=\"nofollow\">25% and 25.5% to between 24% and 25%.</a> The company is also experiencing rising input costs due to general inflation, rising oil prices, and tariffs on steel and other inputs, but the company has indicated that raw material cost inflation is manageable and represents only 3% of total spend. The company may also be experiencing rising freight costs that were recently reported by some other industrial companies. In addition, tariffs represent a degree of uncertainty as when they will be resolved is not clear.</p> <p class=\"paywall-full-content invisible\"><strong>Table 1. </strong>Organic Growth and Operating Margins By Business Segment</p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <tr> <td><p><strong>Business Segment</strong></p></td> <td colspan=\"2\"><p><strong>Organic Growth</strong></p></td> <td colspan=\"3\"><p><strong>Operating Margin</strong></p></td> </tr> <tr> <td> </td> <td><p><strong><em>Q1 2018</em></strong></p></td> <td><p><strong><em>Q2 2018</em></strong></p></td> <td><p><strong><em>Q2 2017</em></strong></p></td> <td><p><strong><em>Q1 2018</em></strong></p></td> <td><p><strong><em>Q2 2018</em></strong></p></td> </tr> <tr> <td><p><strong>Automotive OEM</strong></p></td> <td><p>1%</p></td> <td><p>3%</p></td> <td><p>22.3%</p></td> <td><p>24.1%</p></td> <td><p>22.5%</p></td> </tr> <tr> <td><p><strong>Food Equipment</strong></p></td> <td><p>flat</p></td> <td><p>2%</p></td> <td><p>26.4%</p></td> <td><p>24.6%</p></td> <td><p>25.4%</p></td> </tr> <tr> <td><p><strong>Test &amp; Measurement and Electronics</strong></p></td> <td><p>8%</p></td> <td><p>4%</p></td> <td><p>21.9%</p></td> <td><p>23.4%</p></td> <td><p>23.5%</p></td> </tr> <tr> <td><p><strong>Welding</strong></p></td> <td><p>8%</p></td> <td><p>13%</p></td> <td><p>27.2%</p></td> <td><p>27.7%</p></td> <td><p>29.3%</p></td> </tr> <tr> <td><p><strong>Polymers &amp; Fluids</strong></p></td> <td><p>flat</p></td> <td><p>1%</p></td> <td><p>21.4%</p></td> <td><p>20.9%</p></td> <td><p>21.2%</p></td> </tr> <tr> <td><p><strong>Construction Products</strong></p></td> <td><p>3%</p></td> <td><p>2%</p></td> <td><p>24.0%</p></td> <td><p>22.2%</p></td> <td><p>24.5%</p></td> </tr> <tr> <td><p><strong>Specialty Products</strong></p></td> <td><p>1%</p></td> <td><p>4%</p></td> <td><p>28.3%</p></td> <td><p>26.7%</p></td> <td><p>28.1%</p></td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p class=\"paywall-full-content invisible\">Source: DP Research, ITW Q2 2018 Presentation</p> <h3 class=\"paywall-full-content invisible\">Automotive and Residential Construction End Markets Are Slowing</h3> <p class=\"paywall-full-content invisible\">As stated above, the company has significant exposure to the automotive and construction end markets. But the automotive market is cyclical and experiencing a slowdown in the United States. In the U.S., auto sales are slowing in parallel with rising <a href=\"https://seekingalpha.com/article/4212416-perspective-on-10-year-u-s-treasury-yield-and-stock-market-returns\">10-Year U.S. Treasury yield </a>(interest rates). Auto sales are trending down from a peak of ~17.5M units in 2016 to ~17.1M in 2017 and an estimated ~16.8M units this year. Recently, auto sales are also declining in China, which is the largest auto market in the world. Reportedly, auto sales have declined 5.3% in July, 4.6% in August, and 11.6% in September on a year-on-year basis with 2017. Note that the ITW’s Automotive OEM segment has a growing presence in China. If sales in both the U.S. and Chinese auto markets continue to decline, it will negatively impact ITW’s Automotive OEM business segment and possibly some other segments with exposure to the auto industry.</p> <p class=\"paywall-full-content invisible\">Similarly, the residential housing construction market in the U.S. is experiencing a slowdown, which is likely due to an increasing 30-year mortgage rate, high prices in some locations on the West Coast and Northeast, a lower supply of homes, and changes in the tax law. The net effect is that home affordability is lower. Since early 2018, the number of building permits has been on a downward trend. They are down ~3.92% from last year and ~9.3% since March 2018. Although this is a leading indicator, it points to a slowing housing construction market since builders will start less new construction in the future. In addition, existing home sales were <a href=\"https://www.marketwatch.com/story/existing-home-sales-slump-to-a-near-3-year-low-as-buyers-back-out-2018-10-19?mod=MW_home_top_stories\" rel=\"nofollow\">down ~4.1% in September</a> and flat in August 2018 after four straight months of declines compared to last year and are down 1.5% this year compared to last year. The pending home sales index (PHSI) is down 1.8% in August 2018 to 104.2, decreasing on a year-over-year basis for eight months straight and it is down 2.3% this year compared to last year. These two indicators are pointing to weak current market conditions and can also indicate slower future residential construction.</p> <h3 class=\"paywall-full-content invisible\"><strong><em>Conclusion</em></strong></h3> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Illinois Tool Works remains on my watch list. I like the company’s long history of dividend increases and broad diversification. It is a Dividend King and only ~0.7% of all publicly listed companies in the United States have entered this select group. In addition, ITW is improving its operations as indicated by their increasing operating margins in all business segments. Furthermore, the stock is clearly inexpensive by some valuation metrics. But at the same time, I believe that the company is experiencing a general slowdown in some of its major end markets due to their cyclical nature and rising interest rates that in turn have pressured the company’s stock price. Although the automotive and residential markets will likely recover with time, they may also experience further declines in the near term, further pressuring ITW’s stock price. There are added risks due to the strong U.S. dollar, tariffs, and increasing input costs. Hence, I have decided to continue tracking the stock and wait before making a purchase.</p>", "twitContent": "$ITW - Illinois Tool Works Has Long-Term Dividend Growth But I'm Waiting To Buy. https://seekingalpha.com/article/4213214-illinois-tool-works-long-term-dividend-growth-waiting-to-buy?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "20449", "type": "author"}}, "sentiments": {"data": [{"id": "238112", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2752", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "5966", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17913", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17917", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4213214-illinois-tool-works-long-term-dividend-growth-waiting-to-buy", "canonical": "https://seekingalpha.com/article/4213214-illinois-tool-works-long-term-dividend-growth-waiting-to-buy", "uriImage": "https://static.seekingalpha.com/uploads/2018/10/21/60842-15401452950113351_origin.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2018/10/21/60842-15401452950113351_origin.png"}}}, "included": [{"id": "20449", "type": "author", "attributes": {"company": null, "slug": "dividend-power", "userId": 60842, "tagId": 5966, "bio": "<p>I am a self-taught individual investor and I have been investing in stocks for over 25 years. I focus on dividend growth investing with a long-term horizon since I believe in the compounding power of dividend growth investing. I generally look for undervalued large cap stocks with sustainable dividend growth and capital appreciation potential. My second focus is tech and small- or mid-cap stocks with or without dividends for their growth potential. I try to provide a little more in depth analysis weighing the positives and negatives. I am now in the Top 2.0% out of 28,000+ financial bloggers (December 2023) as tracked by Tip Ranks for my SA articles.</p><p>Work/ associated with the existing authors James Marino and Ferdis.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/000/060/842/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/000/060/842/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/000/060/842/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/000/060/842/extra_large_pic.png"}, "nick": "Dividend Power", "deactivated": null, "memberSince": 2007, "isRss": false, "contributorSince": 2006, "followersCount": 5858}, "relationships": {"user": {"data": {"id": "60842", "type": "user"}}, "userBioTags": {"data": [{"id": "951780", "type": "userBioTag"}, {"id": "951781", "type": "userBioTag"}, {"id": "951782", "type": "userBioTag"}, {"id": "951783", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/dividend-power", "profileUrl": "/author/dividend-power", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2752", "type": "tag", "attributes": {"slug": "itw", "name": "ITW", "company": "Illinois Tool Works Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "20", "type": "sector"}}}, "links": {"self": "/symbol/ITW"}}, {"id": "5966", "type": "tag", "attributes": {"slug": "dividend-power", "name": "Dividend Power", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/dividend-power"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17913", "type": "tag", "attributes": {"slug": "industrial-goods", "name": "Industrial Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/industrial-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17917", "type": "tag", "attributes": {"slug": "diversified-machinery", "name": "Diversified Machinery", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/diversified-machinery"}}, {"id": "238112", "type": "sentiment", "attributes": {"articleId": 4213214, "type": "bullish", "createdAt": "2018-10-22T15:26:03.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4213214", "type": "article"}}, "tag": {"data": {"id": "2752", "type": "tag"}}}}]}