{"data": {"id": "4479499", "type": "fullArticle", "attributes": {"publishOn": "2022-01-13T09:19:54-05:00", "isLockedPro": false, "commentCount": 0, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"patrick-doyle": {"id": 578431, "slug": "patrick-doyle", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro Inc. Stock? No. Short Puts? Definitely", "summary": ["I think 2021 has been very good for Hasbro, and I suspect the company will post extraordinarily good full year results. The dividend remains reasonably well covered.", "In addition, the capital structure has improved dramatically in my view.", "The problem, as is frequently the case, is the price. I would recommend avoiding the shares at the moment, and sell the puts I describe in this article."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2022-01-13T09:20:07-05:00", "isModerated": false, "closestTradingDate": "2022-01-13", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 4, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no stock, option or similar derivative position in any of the companies mentioned, but may initiate a beneficial Long position through a purchase of the stock, or the purchase of call options or similar derivatives in HAS over the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I&#39;ll be selling 5 of the puts described in this article over the next few days.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-w750\" alt=\"Dungeons and Dragons Books, Dice and Map\" data-id=\"517008876\" data-type=\"getty-image\" width=\"4256px\" height=\"2832px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"></picture><figcaption><p class=\"item-credits\">MichaelRLopez/iStock Editorial via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>It's been a few months since I turned <a href=\"https://seekingalpha.com/article/4409832-switching-to-neutral-hasbro\">neutral</a> on Hasbro Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>), and in that time the shares have returned about 11.4% against a gain of 23% for the S&amp;P 500. I like to see<span class=\"paywall-full-content invisible\"> underperformance, so I thought I'd look at the company again. I'll try to determine whether or not it makes sense to buy at current levels by looking at the latest financial data, and by looking at the stock as a thing distinct from the underlying business. I wouldn't be me if I didn't take some time to brag about my short puts in general, and dealing with Hasbro in particular. In the midst of my bloviating, I do make what I consider to be an interesting trade recommendation.</span></p> <p class=\"paywall-full-content invisible\">I'm sure you've got a new mini adventure to write for the elves, dwarves, and dragonborn coming over this Friday night, so I'll not waste any more of your time than I need to. I think Hasbro is a great business, and I think the dividend is very well covered. The stock is certainly not as expensive as it was when I last looked at this business, but it's pretty darned expensive. For that reason, I can't recommend buying the stock. That said, I think it's possible to add to my put premia earned on this business once again. The shares aren't so enormously expensive that you can't earn some money by selling put options. That's exactly what I intend to do, and I recommend others do the same. For those who \"don't do options\", I would recommend sitting and waiting until the shares drop in price. For the rest of you, I would recommend selling the put described below.</p> <h2 class=\"paywall-full-content invisible\"><strong>Financial Update</strong></h2> <p class=\"paywall-full-content invisible\">I've written about the long term financial performance here a few times in the past, so in this missive I want to focus on the first nine months of 2021, and compare that period to 2020. In a few words: the first nine months of 2021 were spectacular relative to the same period in 2020, with revenue and net income up ~18% and 199% (!) respectively.</p> <p class=\"paywall-full-content invisible\">As soon as I mention the comparison to 2020, I know exactly what you're thinking, dear readers. That's an unfair comparison given the $218 million acquisition cost in 2020, and the $301 million increase in program cost amortization in the same year, obviously driven largely by the eOne business acquisition. You might also say something like \"let's not forget the $98 million intangible asset amortization or the royalty expense increases of ~$155 million. In a nutshell I'll agree with you. It would be silly to only compare 2021 to the same period in 2020, with all of its unique expenses.</p> <p class=\"paywall-full-content invisible\">The situation doesn't change much when we compare to 2019, though. Even when compared to that more \"normal\" year, the first nine months of 2021 look particularly good. Specifically, revenue and net income were up about 34% and 38.5% respectively in 2021 relative to the same period in 2019. I think it's possible that both 2020 was a uniquely bad year, and 2021 is a singularly good one.</p> <p class=\"paywall-full-content invisible\">In addition, the capital structure has improved fairly dramatically, with long term debt down fully 19% relative to the same period last year. This is important, because I see a strong positive correlation between debt and risk. Holding all else constant, this will obviously have the effect of bringing debt costs down in future. The reduction in debt also reduces the risk of these contractual obligations crowding out the dividend. Speaking of contractual obligations, and the dividend…</p> <h2 class=\"paywall-full-content invisible\"><strong>Dividend Sustainability</strong></h2> <p class=\"paywall-full-content invisible\">Although I \"like\" to live in the world of accrual accounting, when it comes to thinking about the sustainability of a dividend, I like to think in terms of cash flow generating capacity, relative to contractual obligations. The greater the delta between the amount of cash on the balance sheet, and the average cash from operations on the one hand and contractual obligations on the other, the better obviously. I've taken the liberty of reproducing the size and timing of future contractual obligations for your edification, dear readers. There's no need to thank me, though it may be polite to do so. Anyway, this table reveals that 2022 will see the company spending ~$873 million, and next year, they will spend ~$729.5 million on contractual obligations.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\"><picture><span><a href=\"https://static.seekingalpha.com/uploads/2022/1/12/saupload_tRcKgOMzcwvfsysKf9fVL-GC1-T_HYIJddPDyZODAN2a5eI2ciD5BrBJGCrAlJitTd1OjA7HXtGiILdoyEfTBHcpm2CUyi9yMagJVXRcow019SGVTW5xnlVWt22_z3lbxRjFwSkg.png\" rel=\"lightbox\" data-width=\"1354\" data-height=\"390\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2022/1/12/saupload_tRcKgOMzcwvfsysKf9fVL-GC1-T_HYIJddPDyZODAN2a5eI2ciD5BrBJGCrAlJitTd1OjA7HXtGiILdoyEfTBHcpm2CUyi9yMagJVXRcow019SGVTW5xnlVWt22_z3lbxRjFwSkg_thumb1.png\" alt=\"Hasbro Contractual Obligations\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></picture><figcaption><p class=\"item-caption\">Hasbro's Contractual Obligations</p> <p class=\"item-credits\"><a href=\"https://investor.hasbro.com/static-files/26e7e1fe-4546-4fc6-8110-3bda3689ca88\" rel=\"nofollow\">Hasbro 2020 10-K</a></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Against these the company currently has about ~$1.18 billion in cash, and over the past three years they've generated an average of ~$758.5 million in cash from operations. This suggests to me that the dividend is reasonably well covered. This is important in my view, because the dividend offers support to the stock price.</p> <p class=\"paywall-full-content invisible\">For all of these reasons, I'd be very happy to buy this business at the right price.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\"><picture><span><a href=\"https://static.seekingalpha.com/uploads/2022/1/12/48515253-16420346141849415_origin.png\" rel=\"lightbox\" data-width=\"850\" data-height=\"446\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2022/1/12/48515253-16420346141849415.png\" alt=\"Hasbro Financial History\" width=\"640\" height=\"336\" loading=\"lazy\"></a></span></picture><figcaption><p class=\"item-caption\">Hasbro Financial History</p> <p class=\"item-credits\"><a href=\"https://investor.hasbro.com/financial-information/sec-filings?field_nir_sec_form_group_target_id%5B%5D=466&amp;field_nir_sec_date_filed_value=&amp;items_per_page=10#views-exposed-form-widget-sec-filings-table\" rel=\"nofollow\">Hasbro Investor Relations</a></p></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\"><strong>The Stock</strong></h2> <p class=\"paywall-full-content invisible\">Some of you who follow me may remember that this is where I become a complete \"debbie downer\" and refuse to buy the shares of a perfectly good company just because the shares are expensive. Well, what I'm about to write is directed at you naysayers. You may not have noticed, but the more you pay for a stock, the lower will be your subsequent returns. Rather than try to demonstrate this point abstractly, I'll use Hasbro stock itself to prove it. The people who bought way back in early October of 2019 are sitting on a 13.6% loss today. The people who bought virtually identical shares a mere 5 months later are up about 36%. Not much really changed in the business over that 5 month span, and the nearly 50% swing in returns suggests price matters a great deal. This is why I try to avoid overpaying for a stock.</p> <p class=\"paywall-full-content invisible\">As you may recall, I measure the cheapness (or not) of a stock in a few ways, ranging from the simple to the more complex. On the simple side, I look at the ratio of price to some measure of economic value like sales, earnings, free cash flow, and the like. I want to see a stock trading at a discount to both its own history and the overall market. On that basis, I think the evidence for Hasbro is mixed, per the following.</p> <p class=\"paywall-full-content invisible\">For instance, the price to free cash flow is about 10% cheaper relative to the last time I looked at this business.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/1/12/saupload_8fb4f76c2c75d7eb81b29e38a7ab4159.png\" class=\"sa-ycharts-img\" alt=\"Chart\" width=\"635\" height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">At the same time, though, I'd suggest that the valuation is \"middling\" when we look at price to sales. It's neither relatively expensive nor cheap.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/1/12/saupload_289d41cef9667c7b1d1c689154a63ece.png\" class=\"sa-ycharts-img\" alt=\"Chart\" width=\"635\" height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">In addition to simple ratios, I want to try to understand what the market is currently \"thinking\" about Hasbro's future. In order to do this, I turn to the work of Professor Stephen Penman and his tome \"Accounting for Value.\" In this book Penman walks investors through how they can apply the magic of high school algebra to a standard finance formula in order to work out what the market's \"assuming\" about a given company's future growth. This involves isolating the \"g\" (growth) variable in a fairly standard finance formula. Applying this approach to Hasbro at the moment suggests the market is forecasting a fairly rich 5.8% growth rate for this business going forward. I consider this to be a bit on the optimistic side, and for that reason I can't recommend buying the shares at the current price.</p> <h2 class=\"paywall-full-content invisible\"><strong>Options As Alternative</strong></h2> <p class=\"paywall-full-content invisible\">As everyone knows, there is always more than one way to disarm a trap in a dungeon. You can try to disarm it, or you can trip it while putting yourself out of harm's way. That open mindedness is one of the traits I picked up playing Hasbro's very popular role playing game, and I apply it to investing. Just because I don't want to buy the shares at the current price doesn't mean there's nothing for me to do but wait. As is frequently the case, I think there's money to be made on a stock, and I think short put options represent a great way to do it, because such a trade is a \"win-win.\" To refresh your collective memories, I've earned about $4.40 in put premia on this name so far. Had I been exercised on these puts, I would have been forced to buy the shares at a lower price than the then market price, which is the definition of risk reducing. Since they simply expired worthless, the put premia enhanced my returns on the investment, which is the definition of return enhancing. I'm hopeful that you understand why I consider this to be a win-win trade.</p> <p class=\"paywall-full-content invisible\">Ok, getting past the theoretical and \"patting myself on the back for previous successes\" phase of the article, it's time to offer a specific trade idea. At the moment I like the July puts with a strike of $80. These are currently bid at $1.30. I consider this return reasonable for a very attractive entry price. If the shares remain above $80 over the next six months, I'll simply add this put premium to the pile. If the shares drop, I'll be obliged to buy, but will do so at a price ~22% below the current market price. This is why I consider these to be \"win-win\" investments.</p> <p class=\"paywall-full-content invisible\">I hope you're on board and excited about the prospects of a \"win-win\" trade, because it's time to engage in my sadistic tendency to deflate your bubble by writing about risk. The reality is that every investment comes with risk, and short puts are no exception. We do our best to navigate the world by exchanging one pair of risk-reward trade-offs for another. For example, holding cash presents the risk of erosion of purchasing power via inflation and the reward of preserving capital at times of extreme volatility. The risks of share ownership should be obvious to readers on this forum.</p> <p class=\"paywall-full-content invisible\">I think the risks of put options are very similar to those associated with a long stock position. If the shares drop in price, the stockholder loses money, and the short put writer may be obliged to buy the stock. Thus, both long stock and short put investors typically want to see higher stock prices.</p> <p class=\"paywall-full-content invisible\">Puts are distinct from stocks in that some put writers don't want to actually buy the stock - they simply want to collect premia. Such investors care more about maximizing their income and will be less discriminating about which stock they sell puts on. These people don't want to own the underlying security. I like my sleep far too much to play short puts in this way. I'm only willing to sell puts on companies I'm willing to buy at prices I'm willing to pay. For that reason, being exercised isn't the hardship for me that it might be for many other put writers. My advice is that if you are considering this strategy yourself, you would be wise to only ever write puts on companies you'd be happy to own.</p> <p class=\"paywall-full-content invisible\">In my view, put writers take on risk, but they take on less risk (sometimes significantly less risk) than stock buyers in a critical way. Short put writers generate income simply for taking on the obligation to buy a business that they like at a price that they find attractive. This circumstance is objectively better than simply taking the prevailing market price. This is why I consider the risks of selling puts on a given day to be far lower than the risks associated with simply buying the stock on that day.</p> <p class=\"paywall-full-content invisible\">I'll conclude this rather long discussion of risks by looking again at the specifics of the trade I'm recommending. If Hasbro shares remain above $80 over the next six months, investors will simply pocket the premium and move on. If the shares fall in price, investors will be obliged to buy, but will do so at a price ~22.3% lower than the current level. Both outcomes are very acceptable in my view, so I consider this trade to be the definition of \"risk reducing.\"</p> <h2 class=\"paywall-full-content invisible\"><strong>Conclusion</strong></h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">I think Hasbro is a great business, and they've had an excellent 2021 so far. I expect the holiday season will be good also. I think the dividend is very well covered, and I really like the fact that the capital structure has improved nicely. The problem is that we don't actually buy companies. We buy stocks, and the price of those stocks is influenced by a very emotional crowd. I don't think it's as bad as it was when I last looked at this company, but I think the crowd remains too optimistic at the moment. I think it would be prudent to express bullishness for the company by selling a relatively deep out of the money put. This reduces risk, enhances return, and is the definition of a win-win trade in my view.</p>", "twitContent": "$HAS - Hasbro Inc. Stock? No. Short Puts? Definitely. https://seekingalpha.com/article/4479499-hasbro-inc-stock-no-short-puts-definitely?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104099", "type": "author"}}, "sentiments": {"data": [{"id": "356889", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "578431", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4479499-hasbro-inc-stock-no-short-puts-definitely", "canonical": "https://seekingalpha.com/article/4479499-hasbro-inc-stock-no-short-puts-definitely", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/517008876/image_517008876.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "104099", "type": "author", "attributes": {"company": null, "slug": "patrick-doyle", "userId": 48515253, "tagId": 578431, "bio": "<p>I'm a quant investment newsletter writer who marries fundamental analysis with the latest research in momentum. Over the past few years, I’ve developed a piece of software that helps me track the level of optimism and pessimism embedded in stock price. I seek to challenge the assumptions embedded in price by profitably exploiting the disconnect between what the market thinks and what is a likely outcome. I invest in those companies that have a greater than average chance of giving us all a surprise in the next few months. </p><p><br></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/048/515/253/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/048/515/253/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/048/515/253/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/048/515/253/extra_large_pic.png"}, "nick": "Patrick Doyle", "deactivated": null, "memberSince": 2017, "isRss": false, "contributorSince": 2018, "followersCount": 7175}, "relationships": {"user": {"data": {"id": "48515253", "type": "user"}}, "userBioTags": {"data": [{"id": "927945", "type": "userBioTag"}, {"id": "927946", "type": "userBioTag"}, {"id": "927947", "type": "userBioTag"}, {"id": "927948", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/patrick-doyle", "profileUrl": "/author/patrick-doyle", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "578431", "type": "tag", "attributes": {"slug": "patrick-doyle", "name": "Patrick Doyle", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/patrick-doyle"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "356889", "type": "sentiment", "attributes": {"articleId": 4479499, "type": "neutral", "createdAt": "2022-01-13T09:19:54.000-05:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4479499", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}