{"data": {"id": "4492991", "type": "fullArticle", "attributes": {"publishOn": "2022-03-04T13:31:34-05:00", "isLockedPro": false, "commentCount": 9, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"patrick-doyle": {"id": 578431, "slug": "patrick-doyle", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "tier-1": {"id": 603709, "slug": "tier-1", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro: Closer, But Not Quite Yet", "summary": ["Hasbro has announced earnings since I last wrote about them, so I thought I'd review the name again. In my view, the shares are closer to becoming a \"buy.\"", "The dividend is very well covered, and the capital structure is very strong in my view, so I'd be comfortable buying this at the right price.", "The options I recommended in my previous missive have done much better than the stock itself. I recommend a similar trade today."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2022-03-04T13:31:46-05:00", "isModerated": false, "closestTradingDate": "2022-03-04", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 1, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of HAS either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I just sold 5 of the puts described in this article for $2.85 each.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<div> <figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-w750\" alt=\"New York Comic Con 2021 - Day 4\" data-id=\"1345860327\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p>Bennett Raglin/Getty Images Entertainment</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <p>It’s been just under two months since I wrote my “avoid the stock while selling puts” <a href=\"https://seekingalpha.com/article/4479499-hasbro-inc-stock-no-short-puts-definitely\">piece</a> on Hasbro Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>), and in that time the shares have dropped about 9%, against an identical loss from the S&amp;P 500. The<span class=\"paywall-full-content invisible\"> company has released full year results since I last looked at the name, so I thought I’d review these, and determine if the stock has fallen sufficiently in price to now make it a “buy.” I wrote put options previously, and I’m absolutely chomping at the bit to write about those, too.</span></p> <p class=\"paywall-full-content invisible\">Welcome to the ubiquitous “thesis statement” paragraph, dear readers. If you read this, you’ll get 90% of the message of my article, while experiencing virtually none of the tiresome jokes that I insist on sprinkling throughout my articles. I think Hasbro has just had a great year, and I expect profitability to return to 2019 levels over the next year. More importantly, the capital structure is very sound, and the dividend is very well covered. The problem now, as before, is the valuation. While the stock is down since I published my cautious note, it’s still not cheap enough. Thankfully the options market gives us yet another option to take a bullish position here by selling the October puts with a strike of $70. Speaking of puts, I’d note that the puts I recommended selling earlier are in economic loss, but have done far less bad than the stock itself. This demonstrates their power to reduce risk in my view.</p> <h2 class=\"paywall-full-content invisible\">Hasbro's <strong>Financial History</strong> </h2> <p class=\"paywall-full-content invisible\">I think 2021 was a great year for the company. Specifically, revenue and net income were up by 17.5%, and 93% (!) respectively. That said, net income has not returned to the level it reached in 2019, which was, admittedly, up massively from both 2017 and 2018. In addition, the capital structure has improved massively, with long term debt down fully 21% from the year ago period. Cash now represents about 14.7% of all liabilities. In my view, this is the definition of a financially strong enterprise.</p> <h2 class=\"paywall-full-content invisible\"><strong>Dividend Sustainability</strong></h2> <p class=\"paywall-full-content invisible\">As interesting as the recent financial history here is, I think investors are particularly interested in the future, particularly about the level of dividend sustainability, because if the dividend is cut, the stock will drop. Since this is an interest among readers, and given that I spend every waking moment trying to think up new and creative ways to make your lives better, I want to spend some time writing about the dividend. As I’ve written here many times, I'm as much of a fan of accrual accounting as any semi-sane person can be, but when it comes to tracking the sustainability of a given dividend, I look at cash. I specifically want to compare the size and timing of future calls on cash to the current and likely future sources of cash. Although this company didn't publish their contractual obligations in a single handy-dandy table, the information still exists in their 10-K. In terms of debt repayments, things are fairly light until 2024 when $500 million (12% of total) is due. After that, $675 million (17% of total) is due in 2026. The vast majority of it comes due much later. In addition, there are some small lease payments, as indicated by this table that I’ve plucked from the latest 10-K for your reading pleasure.</p> <figure class=\"regular-img-figure paywall-full-content invisible\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2022/3/4/saupload_Nn31NkwPkFoDzrVXau7uqq0CS2Ot1VtS9O29BTai0TtCUkcRg2YFwJs3i_sBDhgkhjRDQy12xaaKxaZ2oPCrWCBcZOTDz2XaROfs_wq_montwXgNedkDEsw6zAHadLcIaoDqeaY__thumb1.png\" alt=\"The size and timing of Hasbro\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\">Habro Lease Obligations <span>(Hasbro Latest 10-K)</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">Against these obligations, the company has a cash hoard of ~$1.019 billion, and has generated an average of ~$815 million in cash from operations over the past three years. Over the same timespan, they have spent an average of $1.4 billion, but this figure has been skewed higher, obviously, because of $4.4 billion spent on acquisitions in 2020.</p> <p class=\"paywall-full-content invisible\">Given the above, I think the dividend of about $375 million is very well covered, and so I’d be happy to buy the stock at the right price.</p> <figure class=\"regular-img-figure paywall-full-content invisible\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2022/3/4/saupload_nM697kRXF4W4WaDMUOVPmg21LWZ4O8dI7yrRpuDXfJHsEwXIO2WvqDbxjeTj5DAHxYIyJ9v38uHDae8x3myn7jOWTBrGX4IAlcOJCrUTurQYV0gwPp9sjErCxHxylx04sEfh5X3t.png\" alt=\"A financial history of Hasbro from 2015 to the present.\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\">Hasbro Financial History <span>(Hasbro Investor Relations)</span></p></figcaption></figure><h2 class=\"paywall-full-content invisible\"><strong>The Stock</strong></h2> <p class=\"paywall-full-content invisible\">We now come to the portion of the article where I warn investors, once again, of the perils of assuming that a \"good\" company is, by definition, a \"good\" stock. The fact is that a great business like this one can be a terrible investment if you overpay for it. I'll belabour this point by using Hasbro itself as an example. Someone who bought this stock on February 24, to pick a date completely at random, is basically at break even on their shares. Someone who bought this stock four days later is down about 5.2% since. Not enough happened at the business to warrant this massive swing in prices, so the relatively extreme variance in performance in such a short time comes down entirely to price paid. This is why I try, though don’t always succeed, to avoid overpaying for a stock, and insist on buying cheap.</p> <p class=\"paywall-full-content invisible\">As you may recall, dear readers, I measure the cheapness (or not) of a stock in a few ways, ranging from the simple to the more complex. On the simple side, I look at the ratio of price to some measure of economic value like sales, earnings, free cash flow, and the like. Ideally, I want to see a stock trading at a discount to both its own history and the overall market. You may recall from my previous missive on this name that I reached for my fainting couch because the price to free cash flow was just over 13.6 times, and price to sales was trading at 2.3 times. On the price to free cash flow basis, the shares are now about 37% more expensive, and they’re about 17% cheaper on a price to sales basis, per the following:</p> <figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/3/4/saupload_15a548386001b4047d3fdc292ca21fd4.png\" class=\"sa-ycharts-img\" alt=\"Chart\" width=\"635\" height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure><p class=\"paywall-full-content invisible\">Source: YCharts</p> <figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/3/4/saupload_0dab7d8fec593c31366d284603cb9c55.png\" class=\"sa-ycharts-img\" alt=\"Chart\" width=\"635\" height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure><p class=\"paywall-full-content invisible\">Source: YCharts</p> <p class=\"paywall-full-content invisible\">In addition to simple ratios, I want to try to understand what the market is currently \"assuming\" about the future of this company. In order to do this, I turn to the work of Professor Stephen Penman and his great book \"Accounting for Value.\" In this book, Penman walks investors through how they can apply some high school math to a standard finance formula in order to work out what the market is \"thinking\" about a given company's future growth. This involves isolating the \"g\" (growth) variable in the formula. Applying this approach to Hasbro at the moment suggests the market is assuming that this company will grow at a CAGR of about 4% over the long term. While this is a fairly optimistic forecast, it’s much better than the 5.8% growth rate forecasted when I last looked at this stock. Given that the shares aren't unambiguously cheap, and given that I’m paranoid about overpaying for stocks, I must continue to avoid the shares.</p> <h2 class=\"paywall-full-content invisible\"><strong>Options Update</strong></h2> <p class=\"paywall-full-content invisible\">Cast your minds back to my earlier work on Hasbro, if you will, dear readers. In that article, I recommended people sell the Hasbro July puts with a strike of $80 for $1.30. These are currently priced at $3.80, for a loss of $2.50 each. Over the same time period, the stock has lost about $10 per share. So, although the short term loss on the short puts isn’t ideal, they did fare much better than the individuals who went long the day I published my “stocks? No…” article. This is yet another example of how eschewing shares, while selling puts can be a profitable strategy.</p> <p class=\"paywall-full-content invisible\">I like to try to repeat success, obviously, so I’m going to offer yet another, very similar trade. In terms of specifics, I’m recommending selling the October puts with a strike of $70. These are currently bid at $2.50. I consider this sale to be a “win-win”, obviously, because I’m comfortable with either outcome. If the shares remain above $70 for the next eight months, I’ll add this premium to the others earned on this stock. If the shares fall another 24% from current levels, I’ll be obliged to buy, but will do so at a price that lines up with a dividend yield of over 4%. Given that I think the dividend is very well covered, I’d be happy to buy at this rate.</p> <p class=\"paywall-full-content invisible\">It’s time to talk about the risk of short put options, dear readers. I characterise them as “win-win”, but you might be forgiven for suggesting that’s a bit of hyperbole. The fact is that short put options, like everything in life, come with risk. The short puts that I consider to be ‘win-win” are a subset of all short puts. I consider a short put to be a “win-win” when it’s written on a company that I would be happy to own at a price at which I’d be happy to buy. So, not all puts are “win-win” trades. If the strike price is a terrible entry price, for instance, that’s a very bad trade in my view.</p> <p class=\"paywall-full-content invisible\">I should also state that I think the risks of put options are very similar to those associated with a long stock position. If the shares drop in price, the stockholder loses money, and the short put writer may be obliged to buy the stock. Thus, both long stock and short put investors typically want to see higher stock prices.</p> <p class=\"paywall-full-content invisible\">Some put writers don't want to actually buy the stock - they simply want to collect premia. Such investors care more about maximizing their income and will be less discriminating about which stock they sell puts on. To be very clear, I am not such an investor. I like my sleep far too much to sell puts based only on the income I can generate. I'm so much of a coward that I’m only willing to sell puts on companies I'm willing to buy at prices I'm willing to pay. I wasn’t always so disciplined, but after painful losses, I decided to only ever sell puts on quality companies at prices I was willing to pay.</p> <p class=\"paywall-full-content invisible\">I should also write that I think put writers take on risk, but they take on less risk (sometimes significantly less risk) than stock buyers in a critical way. Short put writers generate income simply for taking on the obligation to buy a business that they like at a price that they find attractive. This circumstance is objectively better than simply taking the prevailing market price. This is why I consider the risks of selling out of the money puts on a given day to be far lower than the risks associated with simply buying the stock on that day.</p> <p class=\"paywall-full-content invisible\">I'll conclude this rather long discussion of risks by looking again at the specifics of the trade I'm recommending. If Hasbro shares remain above $70 over the next several months, I'll simply pocket the premium and move on. If the shares fall in price, I'll be obliged to buy, but will do so at a price that lines up with a 4% dividend yield. Additionally, this price would be about 25% below the current market price. All outcomes are very acceptable in my view, so I consider this trade to be the definition of \"risk reducing.\" It’s weird to end a discussion of risk inherent in puts by writing about how deep out of the money short puts on companies you want to own are risk reducing. The mystery of how short puts are both risky and risk reducing is one of those mysteries for the ages, like dark matter or similar.</p> <h2 class=\"paywall-full-content invisible\"><strong>Conclusion</strong></h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">I think Hasbro is an excellent business, with a very well covered dividend. My problem is the valuation. It’s much cheaper than when I last looked at this business, but it’s not cheap enough in my view. Thankfully, the options market gives us a way to generate some return, while putting ourselves on the hook to buy at a great price. While on the topic of short put options, please note again how my bullish short put trade has done far less badly than the bullish long stock trade. If you haven’t yet acquainted yourselves with the risk reducing, yield enhancing potential of put options, I recommend you do so. If you’re comfortable with these, I recommend the above or a similar trade. If you’re not, I recommend putting in a good til cancelled order to buy at $70.</p> </div>", "twitContent": "$HAS - Hasbro: Closer, But Not Quite Yet. https://seekingalpha.com/article/4492991-hasbro-closer-but-not-quite-yet?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104099", "type": "author"}}, "sentiments": {"data": [{"id": "364188", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "578431", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "603709", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4492991-hasbro-closer-but-not-quite-yet", "canonical": "https://seekingalpha.com/article/4492991-hasbro-closer-but-not-quite-yet", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860327/image_1345860327.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "104099", "type": "author", "attributes": {"company": null, "slug": "patrick-doyle", "userId": 48515253, "tagId": 578431, "bio": "<p>I'm a quant investment newsletter writer who marries fundamental analysis with the latest research in momentum. Over the past few years, I’ve developed a piece of software that helps me track the level of optimism and pessimism embedded in stock price. I seek to challenge the assumptions embedded in price by profitably exploiting the disconnect between what the market thinks and what is a likely outcome. I invest in those companies that have a greater than average chance of giving us all a surprise in the next few months. </p><p><br></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/048/515/253/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/048/515/253/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/048/515/253/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/048/515/253/extra_large_pic.png"}, "nick": "Patrick Doyle", "deactivated": null, "memberSince": 2017, "isRss": false, "contributorSince": 2018, "followersCount": 7175}, "relationships": {"user": {"data": {"id": "48515253", "type": "user"}}, "userBioTags": {"data": [{"id": "927945", "type": "userBioTag"}, {"id": "927946", "type": "userBioTag"}, {"id": "927947", "type": "userBioTag"}, {"id": "927948", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/patrick-doyle", "profileUrl": "/author/patrick-doyle", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "578431", "type": "tag", "attributes": {"slug": "patrick-doyle", "name": "Patrick Doyle", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/patrick-doyle"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "603709", "type": "tag", "attributes": {"slug": "tier-1", "name": "Tier 1", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/tier-1"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "364188", "type": "sentiment", "attributes": {"articleId": 4492991, "type": "neutral", "createdAt": "2022-03-04T13:31:34.000-05:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4492991", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}