{"data": {"id": "4505884", "type": "fullArticle", "attributes": {"publishOn": "2022-05-02T15:11:16-04:00", "isLockedPro": false, "commentCount": 5, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"patrick-doyle": {"id": 578431, "slug": "patrick-doyle", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "tier-1": {"id": 603709, "slug": "tier-1", "kind": "general"}, "ep-include": {"id": 604113, "slug": "ep-include", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Continue To Avoid Hasbro Stock", "summary": ["In spite of a nice revenue increase, net income cratered during the most recent quarter. The capital structure improved nicely, though.", "While I think the dividend is very well covered here, I think the shares are overpriced.", "Thankfully, the options market is still offering reasonable premia for the October puts with a strike of $70. I recommend selling these in lieu of share ownership."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2022-05-02T17:09:29-04:00", "isModerated": false, "closestTradingDate": "2022-05-02", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of HAS either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I&#39;m still short the puts I wrote about previously. To be clear, I&#39;m not selling any more of the October 70s today, as I&#39;ve got enough exposure to this name already.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<div> <figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-w750\" alt=\"New York Comic Con 2021 - Day 4\" data-id=\"1345860330\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p>Bennett Raglin/Getty Images Entertainment</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <p>It’s been just under two months since I wrote my cautious <a href=\"https://seekingalpha.com/article/4492991-hasbro-closer-but-not-quite-yet\">piece</a> on Hasbro Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>), and in that time, the shares have returned a negative 4% against a loss of 4.5% for the S&amp;P 500. The company has announced earnings yet<span class=\"paywall-full-content invisible\"> again, so I thought I’d take another kick at the can to see if it’s worth buying this company aggressively. I’ll make that determination by looking at the financial history. In addition, I’ll be looking at the stock as a thing distinct from the underlying business. Finally, I want to write about puts, because I think they make sense to consider at the moment.</span></p> <p class=\"paywall-full-content invisible\">I know that my writing can be tedious. There are the bad jokes, there are the countless not so subtle brags, there is the pomposity. I get it. In order to insulate you from such nonsense, I thought I’d give you the gist of my arguments up front, so you can get in, and get out. In other words, I write this “thesis statement” paragraph to minimize your exposure to the Doyle mojo. You’re welcome. Not all heroes wear capes. Here goes. While I think the dividend is even more secure now, given the improvement in the capital structure, this is still not a great investment at current prices. This is highlighted by the back of the envelope comparison I make between this stock and a 10-year Treasury note. Additionally, the shares are arguably more expensive now because costs have risen faster than revenue. For that reason I recommend continuing to eschew these shares. Just because I don’t want to buy the stock doesn’t mean there’s nothing to be done here. I think the October puts with a strike of $70 are still reasonably priced. If you’re just joining us, and are comfortable with put options, I would recommend selling these. If you’re not, I would recommend holding off until the price falls to more closely line up with value. There it is. That’s my “thesis statement” paragraph. If you read on, that’s on you. I don’t want to read any moaning in the comments section about any nausea causing, uh, “humour” you are exposed to in the remainder of this article.</p> <h2 class=\"paywall-full-content invisible\">Financial Snapshot</h2> <p class=\"paywall-full-content invisible\">I’ve written at length about the long term financial history here previously, and if you really want to know my thoughts about various financial variables, feel free to check out my other articles on this name. In particular, you may want to check out my thinking about the dividend here, and why I consider it to be very well covered. I went into a fair bit of detail on that question in my previous note on this name. In this piece, I want to focus on the most recent quarter, as it may offer some insights into trends that are forming for the upcoming year.</p> <p class=\"paywall-full-content invisible\">I’m disappointed by the financial results. While revenue was ~4.3% higher in the quarter just past relative to the same period a year ago, net earnings were dramatically lower. The reason for this dramatic reduction is the fact that total costs and expenses were up by about 7.8% from last year. Particular stand outs were a 42% increase in program cost amortization, a 15% uptick in cost of sales, and a 12.6% increase in product development expenses.</p> <p class=\"paywall-full-content invisible\">On the bright side, the company has managed to reduce the level of indebtedness pretty dramatically from the year ago period. In particular, long term debt is down just under $930 million relative to Q1 2021. That’s a dramatic improvement, and brings the capital structure back to levels not seen since 2018. Going into this quarter, I was confident about the dividend. After this quarter I’m very confident about the dividend.</p> <figure class=\"regular-img-figure paywall-full-content invisible\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2022/5/2/saupload_4WNqb6eYKlJ_iv9rM7n9XaC7rYv-IPT7lEFmc2ZDEJC-6rwxqXkTT_kr8DsDoDQUQhFti-nSphwUZRDmyNLEq8_3WZqEz5-mm0Hl3KhMRwdUspUrwkcbg29vq-i_lj1EP1BBdXry.png\" alt=\"A financial history of Hasbro from 2015 to the present.\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\">Hasbro Financials <span>(Hasbro investor relations)</span></p></figcaption></figure><h2 class=\"paywall-full-content invisible\">Everything In Investing Is Relative</h2> <p class=\"paywall-full-content invisible\">In the domain of investing, everything is relative. If we buy \"X\", by definition we're eschewing countless \"Y\"s. This dynamic applies, whether you're talking about different stocks or different asset classes. If you buy stocks, for instance, you're not buying gold bars. I think it's helpful to sometimes review the relative merits of our favourite asset classes and to check our assumptions to see if they are still valid.</p> <p class=\"paywall-full-content invisible\">For instance, for years I've heard the argument that investors must buy stocks because the returns from government bonds are paltry. When the 10-year Treasury note was yielding 1.1% only one year ago, why would you lock in for such a pittance? Now that the 10-year note is very close to <a href=\"https://www.marketwatch.com/investing/bond/tmubmusd10y?countrycode=bx\" rel=\"nofollow\">3%</a>, I think it makes sense to review the relative merits of stocks versus bonds.</p> <p class=\"paywall-full-content invisible\">In the following analysis, I'm going to compare the cash flows from the dividend to the cash flows from the treasury note. While this analysis won't answer whether it's preferable to buy this stock or a 10-year note, I think it'll go some way toward defining for us what growth we need from the stock to be indifferent between owning that stock or treasury.</p> <p class=\"paywall-full-content invisible\">In the following spreadsheet, I'm going to compare the cash flows an investor would receive from a $20,000 treasury note investment relative to the stock. I'm going to compare the treasury to two future states: one in which the dividend remains constant, and one in which the dividend grows at the same rate as it did between 2018-2021 (i.e. CAGR of 1.9%).</p> <p class=\"paywall-full-content invisible\">Here's what I found:</p> <ol class=\"paywall-full-content invisible\"> <li><p>If the dividend continues to grow over the next decade at the same rate it grew between 2018 and 2021, the investor will receive about $600 more from dividend cash flows relative to the income received from the treasury note. Given that the dividend has stalled for a few years now, this may be an optimistic forecast.</p></li> <li><p>If the dividend does not grow, the treasury investor will finish the decade with an extra $2,200 on their $20,000 investment, which is about 11% of the original investment.</p></li> </ol> <p class=\"paywall-full-content invisible\">So, if the dividend does not grow over the next decade, the stock investor will need to see shares rise about 11% from current levels for the capital gains to make up for the relatively lower income. If the dividend manages to grow at the same rate over the next decade as it did between 2018 and 2020, the dividend cash flows will be about $600 greater. I'm comfortable pointing out that I’m of the view that the dividend will not grow at this rate, given that it’s been stalled for a while now.</p> <p class=\"paywall-full-content invisible\">There are obviously many other variables at play when we review the relative merits of bonds and stocks. For instance, investors sometimes forget for some reason that bonds, too, can make capital gains. For instance, if the yield on the 10-year note drops to its lows of the past year, the treasury will appreciate by about 28%. So, bonds rise in price, too.</p> <p class=\"paywall-full-content invisible\">Additionally, I think there's the \"sleep at night\" value you get from knowing that in 10 years, your bond investment will be repaid exactly 100 cents on the dollar. When I’ve mentioned this strong positive for bonds to people in the past, I’ve invariably heard some variation of “yes, but bonds are subject to inflation.” It’s as if some people’s mind's dividends are magically immune to inflation? Or that the public companies that stocks supposedly represent suffer no ill effects from rising input costs? In my view, these conversations highlighted the fact that investors remain more ignorant about the dynamics of bonds than they are of stocks. I’m sure this has nothing to do with the fact that the financial services industry makes much more money selling stocks than bonds.</p> <figure class=\"regular-img-figure paywall-full-content invisible\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2022/5/2/saupload_eS51wI_h4XgJwjR8djc8o58up4BMybwEnV83OfxLra8CGTS3VcFJ8IoFZH4oF3v3UMyf4fZdY5IBjuy1hki9WrdKUFNCS3hfQaNNLsFFcvcyirwDRetVGdRba6FdAToG6Uc8RKKlZe86ASF_FA_thumb1.png\" alt=\"The relative cash flows from Hasbro dividends v 10 Year Treasury Note.\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\">Relative merits of Hasbro dividend v 10 Year Treasury Note <span>(Author calculations from public sources)</span></p></figcaption></figure><h2 class=\"paywall-full-content invisible\">The Stock</h2> <p class=\"paywall-full-content invisible\">I've made the point many times that a stock is quite distinct from the underlying business. The business takes inputs and sells various toys and tabletop games. The stock, on the other hand, is a traded instrument that reflects the crowd’s aggregate belief about the long term prospects for a given company. The lower the price paid for the stock, the greater the investor’s future returns. In order to buy at this lower price, you need to buy when the crowd is not sanguine about the company’s prospects.</p> <p class=\"paywall-full-content invisible\">I measure the relative cheapness of a stock in a few ways ranging from the simple to the more complex. On the simple side, I like to look at the ratio of price to some measure of economic value, like earnings, sales, free cash, and the like. Once again, cheaper wins.</p> <p class=\"paywall-full-content invisible\">In the previous article on this name, I suggested that the shares were not quite cheap enough because they were trading at a price to free cash flow of 18.44 and a price to sales ratio of 1.977. Valuations have spiked higher as expenses outstripped revenues, per the following:</p> <figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/5/2/saupload_58eefa97b0dc4f1ae853bd22ec7869f6.png\" class=\"sa-ycharts-img\" alt=\"Hasbro price and price to free cash flow \" hspace=\"6\" vspace=\"6\" width=\"635\" height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure><p class=\"paywall-full-content invisible\">Source: YCharts</p> <p class=\"paywall-full-content invisible\">Admittedly, price to sales is a bit cheaper than it was a couple of months ago, but we've already seen that sales doesn't always translate into profits. It's profits that are the source of sustainable investor returns.</p> <figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/5/2/saupload_4e4c8006f14edde56ccdb8c9f2331da8.png\" class=\"sa-ycharts-img\" alt=\"Hasbro price and PS ratio\" hspace=\"6\" vspace=\"6\" width=\"635\" height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure><p class=\"paywall-full-content invisible\">In addition to simple ratios, I want to try to understand what the market is currently \"assuming\" about the future of this company. In order to do this, I turn to the work of Professor Stephen Penman and his great book \"Accounting for Value.\" In this book, Penman walks investors through how they can apply some high school math to a standard finance formula in order to work out what the market is \"thinking\" about a given company's future growth. This involves isolating the \"g\" (growth) variable in the formula. Applying this approach to Hasbro at the moment suggests the market is assuming that this company will grow at a CAGR of about 5% over the long term. This is a fairly optimistic forecast in my view, which is why I consider this to be a pretty optimistic valuation. This is why I can’t recommend buying at current levels.</p> <h2 class=\"paywall-full-content invisible\">Options As An Alternative to Stocks</h2> <p class=\"paywall-full-content invisible\">In my latest article on this name, I recommended selling the October Hasbro put with a strike of $70 for $2.85. These are currently bid at $2.25, and I think a strike price 20% below the current market price is reasonable at the moment. For that reason, I would recommend this trade for people who are just coming to this party. If the shares don’t happen to fall 20% over the next six months, you’ll pocket the premium. If the shares fall, you’ll be obliged to buy at a net price of ~$67.75. Holding all else constant, this represents a dividend yield north of 4%, which I consider to be very fair. While I won’t be selling these puts today because I sold them a few months ago, I think they would be a great sale for people just tuning in.</p> <p class=\"paywall-full-content invisible\">In case you’re too excited about finding a tasty trade, I want to spend some time spoiling your mood by writing about risk. The fact is that short put options, like everything in life, come with risk. The short puts that I consider to be ideal are a subset of all short puts. I consider a short put to be appropriate when it’s written on a company that I would be happy to own at a price at which I’d be happy to buy. If the strike price is a terrible entry price, for instance, that’s a very bad trade in my view.</p> <p class=\"paywall-full-content invisible\">I should also state that I think the risks of put options are very similar to those associated with a long stock position. If the shares drop in price, the stockholder loses money, and the short put writer may be obliged to buy the stock. Thus, both long stock and short put investors typically want to see higher stock prices.</p> <p class=\"paywall-full-content invisible\">Some put writers don't want to actually buy the stock - they simply want to collect premia. Such investors care more about maximizing their income and will be less discriminating about which stock they sell puts on. To be very clear, I am not such an investor. I like my sleep far too much to sell puts based only on the income I can generate. I'm so much of a coward that I’m only willing to sell puts on companies I'm willing to buy at prices I'm willing to pay. I wasn’t always so disciplined, but after painful losses, I decided to only ever sell puts on quality companies at prices I was willing to pay.</p> <p class=\"paywall-full-content invisible\">I should also write that I think put writers take on risk, but they take on less risk (sometimes significantly less risk) than stock buyers in a critical way. Short put writers generate income simply for taking on the obligation to buy a business that they like at a price that they find attractive. This circumstance is objectively better than simply taking the prevailing market price. This is why I consider the risks of selling out of the money puts on a given day to be far lower than the risks associated with simply buying the stock on that day.</p> <p class=\"paywall-full-content invisible\">I'll conclude this rather long discussion of risks by looking again at the specifics of the trade I'm recommending. If Hasbro shares remain above $70 over the next six months, I'll simply pocket the premium and move on. If the shares fall in price, I'll be obliged to buy, but will do so at a price that lines up with a 4% dividend yield. Additionally, this price would be about 20% below the current market price. This would be good because, as I suggested earlier, there’s a negative relationship between price paid and subsequent returns. I know that it’s weird to end a discussion of risk inherent in puts by writing about how deep out of the money short puts on companies you want to own are risk reducing. If this is the first time you’ve noticed something “weird” coming out of one of my articles, you’re not paying attention.</p> <h2 class=\"paywall-full-content invisible\">Conclusion</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">While I think the dividend is reasonably sustainable, I don’t think the shares represent good value at the moment. They remain too expensive, especially in light of the fact that profitability has fallen because of rising costs. Given that, I think the safest and most reasonable trade is the short put described above. If you’re comfortable selling put options, I’d recommend this or similar trade. If you’re not, I’d wait for shares to drop to a more reasonable level.</p> </div>", "twitContent": "$HAS - Continue To Avoid Hasbro Stock. https://seekingalpha.com/article/4505884-continue-to-avoid-hasbro-stock?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104099", "type": "author"}}, "sentiments": {"data": [{"id": "372143", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "578431", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "603709", "type": "tag"}, {"id": "604113", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4505884-continue-to-avoid-hasbro-stock", "canonical": "https://seekingalpha.com/article/4505884-continue-to-avoid-hasbro-stock", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1345860330/image_1345860330.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "104099", "type": "author", "attributes": {"company": null, "slug": "patrick-doyle", "userId": 48515253, "tagId": 578431, "bio": "<p>I'm a quant investment newsletter writer who marries fundamental analysis with the latest research in momentum. Over the past few years, I’ve developed a piece of software that helps me track the level of optimism and pessimism embedded in stock price. I seek to challenge the assumptions embedded in price by profitably exploiting the disconnect between what the market thinks and what is a likely outcome. I invest in those companies that have a greater than average chance of giving us all a surprise in the next few months. </p><p><br></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/048/515/253/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/048/515/253/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/048/515/253/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/048/515/253/extra_large_pic.png"}, "nick": "Patrick Doyle", "deactivated": null, "memberSince": 2017, "isRss": false, "contributorSince": 2018, "followersCount": 7175}, "relationships": {"user": {"data": {"id": "48515253", "type": "user"}}, "userBioTags": {"data": [{"id": "927945", "type": "userBioTag"}, {"id": "927946", "type": "userBioTag"}, {"id": "927947", "type": "userBioTag"}, {"id": "927948", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/patrick-doyle", "profileUrl": "/author/patrick-doyle", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "578431", "type": "tag", "attributes": {"slug": "patrick-doyle", "name": "Patrick Doyle", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/patrick-doyle"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "603709", "type": "tag", "attributes": {"slug": "tier-1", "name": "Tier 1", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/tier-1"}}, {"id": "604113", "type": "tag", "attributes": {"slug": "ep-include", "name": "ep-include", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/ep-include"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "372143", "type": "sentiment", "attributes": {"articleId": 4505884, "type": "neutral", "createdAt": "2022-05-02T15:11:16.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4505884", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}