{"data": {"id": "4542283", "type": "fullArticle", "attributes": {"publishOn": "2022-09-21T11:39:22-04:00", "isLockedPro": false, "commentCount": 2, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"patrick-doyle": {"id": 578431, "slug": "patrick-doyle", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "tier-1": {"id": 603709, "slug": "tier-1", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Why I'm Buying Hasbro, Inc. Stock?", "summary": ["The company has posted what I consider to be excellent financial results, and I think the upgrade to the next version of Dungeons & Dragons offers some interesting growth opportunities.", "In spite of this, the stock is now inexpensive, and the well-covered dividend yield is quite high. The last time the shares traded at current PEs, they did well.", "The puts I wrote have lost about 45% of their value so that trade's worked out very well. I prefer the stock to short puts at the moment, though."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2022-09-21T11:39:28-04:00", "isModerated": false, "closestTradingDate": "2022-09-21", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 2, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of HAS either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I&#39;m still short the October puts described in this article. Additionally, I&#39;ll be buying 400 shares of Hasbro this morning.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-w750\" alt=\"Nerd Gear\" data-id=\"471101791\" data-type=\"getty-image\" width=\"1536px\" height=\"1020px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"></picture><figcaption><p>busypix/E+ via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>I have some news to share with my readers. First, the monk I'm playing in this ongoing Dungeons &amp; Dragons campaign has just reached fifth level. I don't need to tell this crowd that that means that I've just unlocked the \"Stunning<span class=\"paywall-full-content invisible\"> Strike\" ability, so things are about to get very interesting indeed. Second, about 4 ½ months ago I recommended investors </span><a href=\"https://seekingalpha.com/article/4505884-continue-to-avoid-hasbro-stock\" class=\"paywall-full-content invisible\">eschew</a><span class=\"paywall-full-content invisible\"> the shares of the company that publishes the world's most popular role playing game, and in that time, Hasbro Inc (</span><span class=\"ticker-hover-wrapper paywall-full-content invisible\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span><span class=\"paywall-full-content invisible\">) stock has dropped about 15.6% against a loss of about 7.2% for the S&amp;P 500. So, as my regulars should know by now, it's time for some industrial grade bragging on my part. Although my primary motivation for writing today's piece is to bask in the success of my call, I also want to think about whether or not it makes sense to buy this stock now. After all, a stock trading at $75 is, by definition, a less risky investment than the same stock when it's trading at $89.67. I'll make that determination by looking at the most recent financial performance, and by looking at the stock as a thing distinct from the underlying business. Finally, in my previous article on this name I recommended selling October Hasbro puts with a strike of $70 for $2.85, and I'm champing at the bit to write about that trade.</span></p> <p class=\"paywall-full-content invisible\">Welcome to the \"thesis statement\" paragraph. If you're new here, this is where I offer the gist of my thinking in a single, pithy paragraph to both save you time while limiting your exposure to as much of the \"Doyle mojo\" as is practicable. I write this paragraph in each of my articles because I understand that not everyone wants to read someone else's incessant bragging for some reason. I'm of the view that Hasbro has just posted very decent financial results, and I remain of the view that the dividend is very well covered. In spite of this, I think it's fair to say that the shares are reasonably cheap. In fact they're so cheap that the yield is now higher than the 10 year Treasury Note, which is an enormous positive in my view. Finally, in spite of a massive drop in the stock price, the October puts I wrote previously have done very well, having lost about 45% of their value. This is yet another example of the yield enhancing, risk reducing potential of short puts, and if you don't know about these yet, I would recommend you learn about them forthwith. While I normally like to try to repeat success when I can, I think the shares themselves represent the greatest value at this point. For that reason, I'll let the October puts simply expire (or not), but will be buying the actual stock today. This ends the \"thesis statement.\" If you read on from here, that's on you. I don't want to read any complaints in the comments section about the fact that I am a tiresome writer or that I spell words like \"theater\" and \"characterize\" properly.</p> <h2 class=\"paywall-full-content invisible\">Potential Hedge Against Economic Softness &amp; Migration To Virtual Tabletops</h2> <p class=\"paywall-full-content invisible\">Before having a look at the most recent financial performance here, I want to offer an idea to the readers in order to gauge your collective opinion. Forgive me, but I'm about to offer an argument based on my own, obviously limited experiences. I play Dungeons and Dragons with a very diverse group of people, most of whom don't have very much money. This is mostly a function of age, given that most of the people I play with are in their 20s. I mean, I can find friends my own age, I really can. I just choose not to. I'm not insecure, you are. Anyway, this is a hobby that, depending on how you play it, doesn't require much of an investment. There's always someone ready to sell you $200 dice (which are awesome), but it's possible to play this game with very little money. This is one reason why I would characterize Hasbro as being a reasonably recession resistant company. Sales would obviously slow in the teeth of an economic slowdown, but not by very much in my view. I think playership would actually grow during an economic slowdown. While the company would earn less per player in this circumstance, it would tee Hasbro up nicely to benefit massively when the economy recovers. I'm open to having my mind changed on this score in the comments below.</p> <p class=\"paywall-full-content invisible\">In regard to the new edition, the company will be launching a new edition of Dungeons and Dragons (\"One D&amp;D\"), complete with a new virtual tabletop. This will likely be released in 2024 and it's interesting because it will allow players to move their characters relatively seamlessly from a face to face game to the virtual tabletop. This obviously sets up opportunities for ongoing subscriptions, and we know how much the market loves subscription models. I don't want to get too deep into the weeds about what makes a good role playing game, but I will say that this new version will be much more \"video-gamey\", and much less \"theater of the mind.\" That'll be troublesome for many players, myself included, and I think it will bifurcate the hobby between the cool pen and paper crowd and the hyper nerds who want to turn this hobby into a video game. Either way I think it will be financially profitable for Wizards of the Coast, and thus Hasbro.</p> <h2 class=\"paywall-full-content invisible\">Financial Snapshot</h2> <p class=\"paywall-full-content invisible\">I think the financial performance this year has been quite good. Specifically, while revenue has increased by only about 2.7% during the first six months of 2022 relative to the same period in 2021, net earnings have exploded higher by about 118%. Admittedly, the majority of this relative improvement is a function of the $101.8 million loss on the sale of assets the company took in 2021, but there have been some improvements on the cost structure side, too. Specifically, royalties, and advertising expenses are down by 9.2%, and 16.3% respectively. Other expenses, like product development and selling and distribution were down only slightly, by .13%, and 1.3% respectively, but \"down\" is better than \"up\", so I'll take it.</p> <p class=\"paywall-full-content invisible\">I also really like the fact that the company's capital structure has improved very nicely, with long term debt down by about 19.6%, or $947 million relative to 2021. This goes some way toward explaining the 14% reduction in interest expenses this year relative to last.</p> <p class=\"paywall-full-content invisible\">Some of you readers may remember that we recently suffered from a global pandemic, and may thus consider any comparisons to the 2020-2021 periods to be suspect. You may be curious to know how Hasbro looks now compared to the pre-pandemic. Well, dear readers, if you've got an itch, I'm absolutely obsessed with scratching it, so I'll write about how the first six months of 2022 looks relative to the same period in 2019 for your enjoyment and edification. In some sense this is a completely different company now than it was those short years ago. Revenue and net income for the first six months of this year were higher by 46% and 406% (!) respectively. While debt is much higher, I will write that the company is paying it down aggressively. The company has seen fit to reward shareholders with this improvement in profitability by increasing the amount spent on dividends by ~16.4% from 2019 to now.</p> <p class=\"paywall-full-content invisible\">I've written previously about why I think the dividend is very well covered, and you're free to check out my earlier work on this name if you're interested in why I think that. Nothing that's happened over the past six months has moved me from that view, and thus I'd be very happy to buy this stock outright at the right price.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><img src=\"https://static.seekingalpha.com/uploads/2022/9/21/saupload_M7bWNPo4OUcxoTOf4RE3QPo4NbT-oKDoUR6ot-teYxCaQA4S0KMSbXyyG7oyrGHl-iL3KR9ScrKZPL5hlSl_V617Ab4gSKzBEDF_AB8tms8JS2IRwXjKaXikN71hF79KMzpZ1QP9JLTpMmKkDEHpJRoBbDfKTVG1rPbb3kUI68WqcyP078MAbG4XUw.png\" alt=\"A financial history of Hasbro from 2015 to the present.\" contenteditable=\"false\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Hasbro Financials (Hasbro investor relations)</p></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">The Stock</h2> <p class=\"paywall-full-content invisible\">If you subject yourself to my stuff regularly, you know that I think the stock is distinct from the business in many ways. A business buys a number of inputs, like artistic talent, for example, adds value to those inputs by putting monster stat blocks on them and publishes them in a book, and then sells the results for a profit. The stock, on the other hand, is a traded instrument that reflects the crowd's aggregate belief about the long-term prospects for a given company, and the stock is buffeted by a number of forces that may have little to do with the underlying business. For instance, a fashionable analyst may offer an opinion about how an upcoming movie may impact the number of people playing a game based on that movie. Another analyst may opine that movies based on games are a terrible idea with a terrible pedigree. The crowd may form a view about the relative attractiveness of stocks in general, and that drives shares up or down. I recommended that you avoid Hasbro stock and it's down about 15.6% against a loss of 7.2% for the S&amp;P 500. I mention this as a way to brag, obviously, but also to suggest that some portion of that 15.6% loss may be attributed to a change in our collective appetite for stocks in general. Thus, some portion of Hasbro's drop in price has nothing at all to do with Hasbro. Strangest of all in my mind, stock investors can be mesmerized by the pronouncements of Fed officials, who drive prices up or down massively because of a 50 basis point difference in the overnight rate. Anyway, every stock is impacted by a host of factors that have more or less to do with the underlying business. You'd be forgiven for thinking that the market often overreacts to variables that are only peripherally related to the company.</p> <p class=\"paywall-full-content invisible\">Although it's tedious to see your favorite investment get buffeted around for reasons having little to do with the health of the business, within this tedium lies opportunity. If we can spot discrepancies between the price the crowd dropped the shares to, and likely future results, we'll do well over time. It's typically the case that the lower the price paid for a given stock, the greater the investor's future returns. This is why I only ever want to buy a stock that is relatively cheap. In order to buy at these cheap prices, you need to buy when the crowd is feeling particularly down in the dumps about a given name. Way back in May, I determined that the shares weren't cheap enough because they were trading at price to free cash flow that was on the high side, and this allowed me to sidestep a loss.</p> <p class=\"paywall-full-content invisible\">As my regulars know, I use a host of measures to judge the relative cheapness (or not) of a given stock, some of which are quite simple, some of which are quite sophisticated. On the simple side, I like to look at the ratio of price to some measure of economic value, like earnings, sales, free cash, and the like. Because I think \"cheaper wins\", I want to see a company trading at a discount to both the overall market, and the company's own history. In case you've forgotten, I eschewed Hasbro stock when the stock was trading at a price to free cash of 27.9 times, and a price to sales of 1.88. This is the current state of the world:</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/9/21/saupload_064719cb2a0e8a3c663a1f6d4eb208d3_thumb1.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/9/21/saupload_c557e24436c58e1689ee6847f64aef6e_thumb1.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/9/21/saupload_304abf87c0543575262fedba71530df3_thumb1.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/9/21/saupload_d7ebd46454b1677056a25077bb5884c9_thumb1.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Although the shares are expensive on a price to free cash flow basis, the market is paying about 15% less for $1 of sales. Additionally, the PE is near the low end of the historical range for the stock, and I'd note that over the past five years, when the shares have dropped to this level, they've gone on to do rather well. Finally, the share price has given us a very nice, well covered, yield of over 3.5%. This is mostly very positive in my view.</p> <p class=\"paywall-full-content invisible\">If you know I like cheap stocks, you also know that I want to try to understand what the market is currently \"assuming\" about the future of a given company. If you read me regularly, you know that I rely on the work of Professor Stephen Penman and his book \"Accounting for Value\" for this. In this book, Penman walks investors through how they can apply some pretty basic math to a standard finance formula in order to work out what the market is \"thinking\" about a given company's future growth. This involves isolating the \"g\" (growth) variable in this formula. In case you find Penman's writing a bit dense, you might want to try \"Expectations Investing\" by Mauboussin and Rappaport. These two have also introduced the idea of using stock price itself as a source of information, and then infer what the market is currently \"expecting\" about the future.</p> <p class=\"paywall-full-content invisible\">Anyway, applying this approach to Hasbro at the moment suggests the market is assuming that this company will grow at a rate of ~4%, which I consider to be neither excessively optimistic nor pessimistic. Given all of the above, I'd be comfortable buying some Hasbro this morning.</p> <h2 class=\"paywall-full-content invisible\">Options Update</h2> <p class=\"paywall-full-content invisible\">While I recommended that you continue to avoid the stock, previously I did recommend selling the October puts with a strike of $70. These were deep out of the money at the time, and I sold them for $2.85 each. In spite of the fact that the company has dropped dramatically in price, these are now priced at $1.25-$1.55, so I think the trade has worked out rather well. Given that I'm comfortable owning the shares at the current price of $75, I'm very, very comfortable owning them at $70, so I'll take no action with my puts this morning. If I'm exercised, I'll end up buying more of this decent business at a net price of $67.15. If the shares remain above $70 over the next month, I'll pocket the premium. Given that both outcomes are quite decent, I characterize these trades as \"win-win.\" If you have not yet familiarized yourselves with the risk reducing, yield enhancing potential of short puts, I would recommend you learn about them.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">While I like selling deep out of the money puts on wonderful businesses when the stock is too expensive, when shares return to more reasonable levels, I think it makes the most sense to simply buy the stock. In my view, the dividend yield is sufficiently great at this point, so the yield from the dividend is a superior risk adjusted return than most put options in my view. I'll remain short the October puts, and will hope that I'm exercised, but I'm going to simply buy stock this morning.</p>", "twitContent": "$HAS - Why I'm Buying Hasbro, Inc. Stock?. https://seekingalpha.com/article/4542283-buying-hasbro-inc-stock?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104099", "type": "author"}}, "sentiments": {"data": [{"id": "410302", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "578431", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "603709", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4542283-buying-hasbro-inc-stock", "canonical": "https://seekingalpha.com/article/4542283-buying-hasbro-inc-stock", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/471101791/image_471101791.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "104099", "type": "author", "attributes": {"company": null, "slug": "patrick-doyle", "userId": 48515253, "tagId": 578431, "bio": "<p>I'm a quant investment newsletter writer who marries fundamental analysis with the latest research in momentum. Over the past few years, I’ve developed a piece of software that helps me track the level of optimism and pessimism embedded in stock price. I seek to challenge the assumptions embedded in price by profitably exploiting the disconnect between what the market thinks and what is a likely outcome. I invest in those companies that have a greater than average chance of giving us all a surprise in the next few months. </p><p><br></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/048/515/253/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/048/515/253/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/048/515/253/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/048/515/253/extra_large_pic.png"}, "nick": "Patrick Doyle", "deactivated": null, "memberSince": 2017, "isRss": false, "contributorSince": 2018, "followersCount": 7175}, "relationships": {"user": {"data": {"id": "48515253", "type": "user"}}, "userBioTags": {"data": [{"id": "927945", "type": "userBioTag"}, {"id": "927946", "type": "userBioTag"}, {"id": "927947", "type": "userBioTag"}, {"id": "927948", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/patrick-doyle", "profileUrl": "/author/patrick-doyle", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "578431", "type": "tag", "attributes": {"slug": "patrick-doyle", "name": "Patrick Doyle", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/patrick-doyle"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "603709", "type": "tag", "attributes": {"slug": "tier-1", "name": "Tier 1", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/tier-1"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "410302", "type": "sentiment", "attributes": {"articleId": 4542283, "type": "bullish", "createdAt": "2022-09-21T11:39:22.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4542283", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}