{"data": {"id": "4543538", "type": "fullArticle", "attributes": {"publishOn": "2022-09-28T04:34:11-04:00", "isLockedPro": false, "commentCount": 11, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"steven-mallas": {"id": 490846, "slug": "steven-mallas", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro Should Stay Long Hollywood", "summary": ["Hasbro should not get out of filmed entertainment, in my opinion.", "Instead, it should look to further invest in original content so that Hasbro and Entertainment One can increase cross-promotional synergy.", "I go over in this brief article some points of advantage eOne brings to the table and agree that the division could be streamlined in certain areas.", "The stock is a long-term buy with an attractive dividend yield.", "Nevertheless, buy opportunistically, since the market is in the habit now of offering better prices (i.e., volatility)."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2022-09-28T04:34:17-04:00", "isModerated": false, "closestTradingDate": "2022-09-28", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of CMCSA, LGF.A, LGF.B, T either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-w750\" alt=\"Toy And Game Giant Hasbro Quarterly Earning Exceed Expectations\" data-id=\"1004357040\" data-type=\"getty-image\" width=\"3000px\" height=\"2250px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"></picture><figcaption><p>Justin Sullivan</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) has been urged as of late to reconsider its investment in filmed entertainment. According to an SA <a href=\"https://seekingalpha.com/news/3875483-hasbro-said-to-consider-sale-or-restructuring-of-entertainment-assets-report?source=content_type%3Areact%7Csection%3AAll%7Csection_asset%3ANews%7Cfirst_level_url%3Asymbol%7Cbutton%3ATitle%7Clock_status%3ANo%7Cline%3A2\">news item</a> from the latter part of August, the toy maker is considering its options as it concerns<span class=\"paywall-full-content invisible\"> Entertainment One, a $4 billion purchase Hasbro made three years ago.</span></p> <p class=\"paywall-full-content invisible\">The options are to sell the content studio, or sell parts of it. If the company got out of the eOne business altogether, it could simply license its IP to studios as it has already been doing. The eOne purchase was supposed to get Hasbro closer to a direct Hollywood business model, to make the toy manufacturer more of a producer as opposed to a passive player that doesn't receive the bulk of a project's profits.</p> <p class=\"paywall-full-content invisible\">But, Hollywood has a way of spooking companies that attempt to play the game; that goes especially for a company like Hasbro.</p> <p class=\"paywall-full-content invisible\">Think about what Hasbro is to a large extent: it basically turns plastic into playthings. As such, it monitors raw input costs and watches inflation barometers and keeps an eye on margins, etc. In other words, Hasbro is a by-the-numbers, economic-value-added concern that wants to know the risk profile of any given capital investment.</p> <p class=\"paywall-full-content invisible\">Going Hollywood means, to some degree, that one can't always let risk profiles rule the day. That isn't to say Hasbro should make a bunch of independent films for arthouses. One thing I always write about when it comes to Hollywood business models is: always think commercially-minded first and foremost. Tentpoles, franchises, whether on silver or streaming screens, should be top of mind in any C-suite.</p> <p class=\"paywall-full-content invisible\">Still, Hasbro <em>did</em> get the memo, the one that says you need a story to go along with the plastic plaything to increase its brand equity. If a movie such as <em>Star Wars</em> can yield a massively successful line of toys, then an existing successful set of toys can be the source material for films and television shows. That only stands to reason.</p> <p class=\"paywall-full-content invisible\">However, Hasbro was content for a while to allow others to do the heavy lifting and to simply take a smaller cut, thinking the big reward could be found in the promotional value of its IP in the other media - i.e., sales would increase for playthings and collectibles tied to a <em>Transformers</em> or a <em>Ouija</em> board.</p> <p class=\"paywall-full-content invisible\">Longer term, I believe Hasbro needs to be in the filmed-entertainment business, and it can't just think in terms of hitting a single demographic. Going after the kids market is certainly crucial and core, but going after adults is also key to longevity in Tinseltown. That's why eOne was such an interesting acquisition to me: it made sense from the point of view that Hasbro could make all kinds of content, and generate all kinds of merchandise from said content. The call from the activist investor to sell eOne ignores the fact that Hasbro can diversify its revenue stream by making content such as low-budget horror films and broad R-rated comedies...and, yes, you can make a line of collectible figures/playsets to go along with any of that. eOne was a purchase meant to expand opportunity; selling it now would be shortsighted and essentially pulling an AT&amp;T (<a href=\"https://seekingalpha.com/symbol/T\" title=\"AT&amp;T Inc.\">T</a>) move (i.e., buy a media company, then immediately panic and sell it). The activist call in this case is simply to move assets around so a possible pop in the stock can be achieved - I just don't buy the thesis. Instead, the thesis that investing in storytelling is a place where the toy maker should be is compelling and nearly inarguable.</p> <p class=\"paywall-full-content invisible\">As has been mentioned, though, SARS-CoV-2 really masked the potential for the studio. That, and acquisition costs. The <a href=\"https://investor.hasbro.com/static-files/78098a21-d496-4e87-892f-152b82ee1fe7\" rel=\"noopener\">annual report</a> discusses the losses the entertainment segment has produced over the last couple years (starting on page 58): over $140 million in 2020, and over $90 million in 2021. Revenue (page 57), however, jumped in 2021 to $1.1 billion from roughly $900 million. Over time, I expect the segment to do much better as Hasbro IP receives more of a focus and management learns the content-production ropes. Hasbro, too, has good cash flow (page 85) to help things along: going from 2019 to 2021, operational cash flow was $650 million, almost $980 million, and just under $820 million, respectively. Dividend payments and capital spending in each of those years was about $500 million. This isn't to say the content business isn't expensive and won't hit the cash-flow statement hard at times, but Hasbro can reap the merchandising benefits of a robust film slate to power the company's overall business goals.</p> <p class=\"paywall-full-content invisible\">Plus, management has a good hold on what's important with this division. Back in April 2021, the company <a href=\"https://seekingalpha.com/news/3685837-hasbro-announces-to-sell-eones-music-business\">sold off</a> the music investment held within eOne. That divestiture yielded $385 million. Hasbro could identify other parts of eOne that might not make sense to keep; this would help to concentrate a cohesive strategy for the division, one that can focus on synergy with the toy IP portfolio as well as a continued search for new franchise ideas. Music, while an interesting business, and one that has <a href=\"https://seekingalpha.com/article/4400733-hipgnosis-songs-great-idea-i-just-dont-quite-believe\">certainly attracted</a> a lot of investment capital via buyouts of various song-catalogue rights as of late, is something I believe isn't as useful for Hasbro (and I will say that may just be based on my bias toward filmed entertainment as an asset). Instead, focusing on shows and films should promote better synergy since the visual arts tend to pack a more powerful marketing punch.</p> <p class=\"paywall-full-content invisible\">Selling off stuff is a good strategy and probably would have been needed if Hasbro had purchased Lions Gate Entertainment (<a href=\"https://seekingalpha.com/symbol/LGF.A\" title=\"Lions Gate Entertainment Corp.\">LGF.A</a>) (<a href=\"https://seekingalpha.com/symbol/LGF.B\" title=\"Lions Gate Entertainment Corp.\">LGF.B</a>) a while back when it approached CEO Jon Feltheimer for a deal. Feltheimer apparently wanted more than Hasbro was willing to pay so that transaction never came to be, but both eOne and Lions Gate basically approach their business models by stringing together little deals and investments along the way to a desired scale. As an example with eOne, Hasbro could see if it still makes sense to be a part of Amblin Partners, Steven Spielberg's group that includes Comcast's (<a href=\"https://seekingalpha.com/symbol/CMCSA\" title=\"Comcast Corporation\">CMCSA</a>) Universal Pictures and Reliance Entertainment.</p> <p class=\"paywall-full-content invisible\">If Hasbro did decide to sell off some parts, the summary bullet points of an overall strategy should be:</p> <ul class=\"paywall-full-content invisible\"> <li>Identify all IP on the toy side that can be processed through the Entertainment One ecosystem.</li> <li>Look to make merchandise such as collective figures from just about all appropriate IP on the entertainment side, even if it only targets adults (as an example, maybe there should be action figures based on the <em>Yellowjackets</em> series, assuming there aren't any already).</li> <li>Be sure to only give a green light to material that is commercial in nature - edgy product that will either hit target demos or go full-on four-quadrant.</li> <li>Be careful of budgets, so emulate the low-cost horror model that many media companies have used.</li> <li>Take as much risk as possible - i.e., don't play around with too many co-financing structures; take the risk to reap a larger financial return.</li> </ul> <p class=\"paywall-full-content invisible\">Entertainment One could just be a start. As time goes on, the company could look for other acquisition targets - a small animation studio here, a small comic-book IP concern there. All the while the core business of toys and games (remember that Hasbro owns Wizards of the Coast which distributes <em>Magic: The Gathering</em> and <em>Dungeons &amp; Dragons</em>) helps to power further investment in Hollywood. The company can also use its expertise as a toy/game maker to attract talent, perhaps allowing financial participation on that side as a way of lowering compensation requirements on the content side (i.e., a bigger percentage of merchandise sales in exchange for rational backend deals, when appropriate - obviously Hasbro would want to keep 100% of merchandise rights for certain properties).</p> <p class=\"paywall-full-content invisible\">I would urge Hasbro to always remain long eOne, and Hollywood in general.</p> <h2 class=\"paywall-full-content invisible\">The Stock</h2> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/9/27/saupload_228f3a8edeaef46252ab21bf6510082c.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Obviously the market is what it is, and the stock as of this writing is just above the $70 52-week low (at a price of $71). That's a big drop from $105, the high.</p> <p class=\"paywall-full-content invisible\">The SA <a href=\"https://seekingalpha.com/symbol/HAS/valuation/metrics\">valuation</a> system gives the stock a below-average current rating. But there's one aspect that stands above the rest.</p> <p class=\"paywall-full-content invisible\">The dividend yield right now is just under 4%. Hasbro has a good <a href=\"https://seekingalpha.com/symbol/HAS/dividends/history\">dividend history</a>, although the dividend had stagnated the last couple years before recently rising from $0.68 per quarter to $0.70 per quarter.</p> <p class=\"paywall-full-content invisible\">It's understandable, given market conditions during SARS, but at this yield, Hasbro is looking attractive. However, it goes almost without saying that the volatility may offer even better prices below $70, so investors need to keep that in mind.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Nevertheless, I have to rate this a long-term buy, taking into account the dividend and the portfolio, as well as the opportunities to expand into Hollywood. I don't currently own the stock; I did previously but sold for other reasons owing to portfolio management at the time. At some point, I hope to be back in again.</p>", "twitContent": "$HAS - Hasbro Should Stay Long Hollywood. https://seekingalpha.com/article/4543538-hasbro-should-stay-long-hollywood?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "82146", "type": "author"}}, "sentiments": {"data": [{"id": "411429", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "490846", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4543538-hasbro-should-stay-long-hollywood", "canonical": "https://seekingalpha.com/article/4543538-hasbro-should-stay-long-hollywood", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1004357040/image_1004357040.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "82146", "type": "author", "attributes": {"company": null, "slug": "steven-mallas", "userId": 393777, "tagId": 490846, "bio": "I have previously written articles for The Motley Fool, TheStreet, and AOLs BloggingStocks.I also write fiction. I have stories published at Nikki Finke's Hollywood Dementia site, including \"The Streaming Service,\" \"The Screenwriterman,\" \"Mygalomorph\" and \"Spielberg's Last Film.\"<p><br></p><p>Here is a link to my YA book, \"<a href=\"https://www.amazon.com/Abner-Wilcox-Thornberry-Witch-Street-ebook/dp/B0180MHEOE\">Abner Wilcox Thornberry and The Witch of Wall Street</a>.\"</p><p><br></p><p>This is a collection of short horror stories: <a href=\"https://www.amazon.com/Tales-Salem-Massachusetts-Steven-Mallas-ebook/dp/B016D29INI\">Tales From Salem, Mass.</a><br><br></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/000/393/777/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/000/393/777/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/000/393/777/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/000/393/777/extra_large_pic.png"}, "nick": "Steven Mallas", "deactivated": null, "memberSince": 2009, "isRss": false, "contributorSince": 2015, "followersCount": 1846}, "relationships": {"user": {"data": {"id": "393777", "type": "user"}}, "userBioTags": {"data": [{"id": "526126", "type": "userBioTag"}, {"id": "526136", "type": "userBioTag"}, {"id": "526146", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/steven-mallas", "profileUrl": "/author/steven-mallas", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "490846", "type": "tag", "attributes": {"slug": "steven-mallas", "name": "Steven Mallas", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/steven-mallas"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "411429", "type": "sentiment", "attributes": {"articleId": 4543538, "type": "bullish", "createdAt": "2022-09-28T04:34:11.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4543538", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}