{"data": {"id": "4652060", "type": "fullArticle", "attributes": {"publishOn": "2023-11-16T08:00:00-05:00", "isLockedPro": false, "commentCount": 33, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"dhierin-bechai": {"id": 104891, "slug": "dhierin-bechai", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "eadsf": {"id": 12125, "slug": "eadsf", "kind": "common", "non_theme": true}, "eadsy": {"id": 11855, "slug": "eadsy", "kind": "common", "non_theme": true}, "ba": {"id": 769, "slug": "ba", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "industrials": {"id": 20, "slug": "industrials", "kind": "sector", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "sasource": "theme_breadcrumb"}}, "title": "Why The Boeing Shock Message To China Was Effective", "summary": ["The Boeing Company stock has seen significant gains recently, driven by positive coverage and bullish sentiment from analysts.", "The surge in stock price can be traced back to September 2022, when Boeing signaled willingness to remarket jets initially built for China.", "The return of the Boeing 737 MAX to service in China has been driven by demand trends and specific travel periods, rather than just the upcoming APEC summit."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-11-17T06:19:00-05:00", "isModerated": false, "closestTradingDate": "2023-11-16", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 18, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of BA, EADSF either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-w750\" alt='Xi Jinping Visits Hong Kong For 20th Anniversary Of The City\"s Handover' width=\"1536px\" height=\"1032px\" data-id=\"803127826\" data-type=\"getty-image\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"></p> <p class=\"item-credits\">Keith Tsuji</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <p>In recent trading sessions, <strong>The Boeing Company</strong> (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BA\" title=\"The Boeing Company\">BA</a></span>) stock has significantly gained and there has been positive coverage from analysts, including those on Seeking Alpha. While I do echo the bullish sentiment, I do want to add some valuable background to<span class=\"paywall-full-content invisible\"> this using data and a timeline. The reason is that the current bullish view is too much based on a single meeting between President Biden and President Xi on Wednesday, November 15th, during the Asia Pacific Economic Cooperation summit in San Francisco. However, there is a lot more to it than currently is being suggested with regard to airplane orders and deliveries by Boeing.</span></p> <h2 class=\"paywall-full-content invisible\">Boeing Stock Surged Following Harsh Stance On China</h2> <p class=\"paywall-full-content invisible\">While there is a lot of attention for the recent positive price movement in Boeing’s stock price, this most certainly did not happen overnight. In fact, it has been in the making for a very long time. To be precise, we can at least date it back to September 2022. I wrote a <a href=\"https://seekingalpha.com/article/4541338-boeing-shocks-china\">report</a> back then on the friction between Boeing and China and since then, the stock has gained 44% compared to 16.3% return for the broader markets. It makes the 6.5% jump in share prices that has media and analysts going wild now look rather small, perhaps also showing how a data driven approach with a sense of the industry dynamics actually helps investors pre-sort for investment way before analysts are able to change their views or at least before certain events even materialize.</p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/11/14/9932311-1700019898220746_origin.png\" rel=\"lightbox\" data-width=\"1138\" data-height=\"640\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/11/14/9932311-1700019898220746.png\" alt=\"This images shows a Boeing 737 MAX 8 airplane flying.\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Boeing</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">So, what is so special about September 2022. It definitely is not the report. My reports covering Boeing mostly focus on hot topics that may have long-term implications either in negative or positive direction, and such an event occurred in September 2022, when Boeing clearly signaled willingness to remarket some of the jets initially built for China.</p> <p class=\"paywall-full-content invisible\">When asked about the status of re-entry in service for the Boeing 737 MAX in China at the <a href=\"https://seekingalpha.com/article/4541310-boeing-company-ba-management-presents-morgan-stanley-10th-annual-laguna-conference-transcript\">10<sup>th</sup> Morgan Stanley Annual Laguna Conference</a>, Brian West who is the CFO of Boeing, provided the following comment:</p> <blockquote class=\"paywall-full-content invisible\"> <p></p> <p>So, as we exited last year and got into February, both the customers in China and the regulators, did exactly what they said they were going to do. And then, February came. And in February we actually had customers doing flight tests. And then everything stopped. And they paused, because they had to deal with their COVID lockdown restrictions, et cetera.</p> <p>So, right now, we are constantly communicating with our customers and the regulators and we stand ready. When they're ready to pick up where they left off to finish that work, we are ready. I can't dictate the timing [Indiscernible]. But I won't tell you more broadly, we have deferred decisions on those planes for a long time. We can't defer that decision forever. So, we will begin to remarket some of those airplanes. They were otherwise earmarked for our Chinese customers. And we don't do that lightly.</p> </blockquote> <p class=\"paywall-full-content invisible\">It is that comment that sparked something in China as the customers also became aware that they could be losing valuable delivery slots and led to a <a href=\"https://seekingalpha.com/article/4542248-boeing-shock-invokes-bullish-response-from-china\">response</a> stating that the Boeing 737 MAX review would soon be concluded by the Chinese aviation regulator. A month later, the first commercial flight with Boeing 737 MAX in Chinese airspace was <a href=\"https://www.flightglobal.com/fleets/first-737-max-flies-in-chinese-airspace-since-2019-grounding/150488.article\" rel=\"nofollow\">performed</a>. During the third quarter earnings call, Boeing’s CEO, David Calhoun, <a href=\"https://www.aerotime.aero/articles/32508-boeing-derisk-china-remarkets-737-max\" rel=\"nofollow\">repeated</a> the topic of remarketing. So, it is evident that the trending topic of recommencing deliveries to China is anything but stooled solely on the upcoming APEC summit. Boeing planted the seed for it a long time ago.</p> <p class=\"paywall-full-content invisible\">In fact, out of the 140 airplanes initially destined for Chinese operators Boeing ended up remarketing 55 airplanes which are now part of the <a href=\"https://seekingalpha.com/article/4578739-big-air-india-buy-record-order-for-boeing-and-airbus\">mega order from Air India</a>.</p> <h2 class=\"paywall-full-content invisible\">Let’s Dive Into The Boeing 737 MAX Flight Activity Data</h2> <p class=\"paywall-full-content invisible\">Since the Boeing 737 MAX return to service started, I have been tracking the flight hours and activity of airplanes returning to service on a weekly basis providing me with a lot of data over the course of the past 10 months. In total, I have close to a million data points that allow me to make the flight activity understandable for readers in visualization monitors.</p> <p class=\"paywall-full-content invisible\">From that data, we have tons of insight that hook into the timing of activation of the Boeing 737 MAX airplanes in China. The reactivation started in January 2023 and that timing most certainly is no coincidence. With the pandemic restrictions easing in late 2022 and Spring Festival or Chinese New Year starting at January 21<sup>st</sup>, there was a surge in travel demand prior to the Chinese New Year and in the days after the celebrations as people returned from visiting families. In that time, five airplanes were returned to service. The second hot spot is the May to August period, when tourists provided support to travel demand, and in that time frame another 39 airplanes were returned to service with utilization climbing to 8 hours per day. From January to August, 97% of the fleet had returned to service which to me is a clear sign of existing demand for air travel supported by the Boeing 737 MAX.</p> <p class=\"paywall-full-content invisible\">Initially, David Calhoun <a href=\"https://seekingalpha.com/article/4572364-boeing-company-ba-q4-2022-earnings-call-transcript\">expected</a> the return to be completed by July in a 6-month sprint to return the airplanes to service:</p> <blockquote class=\"paywall-full-content invisible\"> <p>I think as everybody knows, the opening up of China is going to be a major event in aviation. And the aviation industry was already stressed in terms of demand broadly in the world. So this is a serious bump for everybody, but most importantly, within China, they need the MAX to fly to satisfy those demands.</p> <p>So we were going to do there what we do here in the U.S. and focus on the airplanes they have on the Tarmac today, which is close to 100 airplanes, the readiness of each and every one of them, and ultimately, they're getting into full revenue service. So for six months, I think that's the course for all of us to stay focused on.</p> </blockquote> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/11/14/9932311-1700019899155185_origin.png\" rel=\"lightbox\" data-width=\"2143\" data-height=\"1217\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/11/14/9932311-1700019899155185.png\" alt=\"This image shows the utilization of the Boeing 737 MAX in China.\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>The Aerospace Forum</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">It actually took somewhat longer, and the delay is not completely unexpected. Parsing the data, we see that from half January through August the daily utilization climbed from 3.2 hours per day to 8.4 hrs. The first four months or so are really to bring the airplanes back in service and have the utilization improve and we see that from May through August which is the time where tourism travel demand increases, the utilization increased only to fall back in September. So, while Chinese airlines could have chosen to activate the entire fleet they did not do so because from demand perspective there was no urgent need to do so.</p> <p class=\"paywall-full-content invisible\">In October, we saw another increase in utilization driven by the Golden Week which occurred between October 1<sup>st</sup> and October 7<sup>th</sup> marking another high travel demand spot. The Golden Week is a weeklong national holiday occurring around three holidays namely Chunyun (also known as Spring Festival or Chinese New Year in January or February), Mid-Autumn Festival (around October 1<sup>st</sup>) and Labor Day (May). These Golden Weeks also drive demand and are responsible for the bump in utilization increases in February, May and October. The October Golden Week likely has <a href=\"https://efe.com/en/latest-news/2023-09-29/china-marks-2023-golden-week-with-record-travel-consumption-boom/\" rel=\"nofollow\">sparked</a> 800 million trips by rail, road, sea and air. So, within the data and overlaying the high demand spots we see a lot of support for bringing the Boeing 737 MAX back in an efficient way.</p> <h2 class=\"paywall-full-content invisible\">The Final Boeing 737 MAX To Be Returned To Service</h2> <p class=\"paywall-full-content invisible\">B-1261 is something that most probably have not heard of. It is the registration of that final airplane that had been pending return to service the longest and it has finally happened on the 4<sup>th</sup> of November completing the return to service of all 95 airplanes. Since the end of October, I already had seen indications that the return to service of this airplane was imminent and days later the airplane was put back into service operating a flight between Shanghai and Guangzhou.</p> <p class=\"paywall-full-content invisible\">The envisioned path for Boeing to start delivering Boeing 737 MAX airplanes to China again has always been that the reactivation of the Boeing 737 MAX fleet needed to be completed first. That is not to say that the upcoming meeting between the Chinese and US President is of no significance or that there is no relation between the timing of the last airplane returning to service and the upcoming meeting, but I think that by connecting the straightforward dots between the APEC summit meeting and recommencing deliveries to China, one might be ignoring that this has been a work in progress for well over a year intensifying over the past 10 months and that is the obvious danger when analyzing news and not being aware of the broader timelines and complexity making detailed and meticulous coverage even more valuable as it provides the broader picture.</p> <h2 class=\"paywall-full-content invisible\">Boeing 737 MAX and The Demand Trends</h2> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/11/14/9932311-17000198990735464_origin.png\" rel=\"lightbox\" data-width=\"2143\" data-height=\"1217\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/11/14/9932311-17000198990735464.png\" alt=\"This image shows the Chinese single aisle fleet pre-pandemic.\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>The Aerospace Forum</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">The above snapshot shows the single aisle fleet in China excluding the Boeing 737 MAX by the end of 2019. That is a fleet of nearly 3,000 airplanes. From the EFE report that estimated 800 million trips during the Golden Week, we also know that passengers on domestic flights increased 18% compared to 2019. Just assuming that the bulk of those domestic flights is operated by single aisle airplanes it means that around 3,533 airplanes were required. The reason to filter out the Boeing 737 MAX from the 2019 year-end fleet is because the Boeing 737 MAX had been grounded in March 2019.</p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/11/14/9932311-17000198992050238_origin.png\" rel=\"lightbox\" data-width=\"2143\" data-height=\"1217\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/11/14/9932311-17000198992050238.png\" alt=\"This image shows the number of single aisle Airbus airplanes delivered to China since 2020.\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>The Aerospace Forum</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">If we look at the number of airplanes that Airbus (<a href=\"https://seekingalpha.com/symbol/EADSF\" title=\"Airbus SE\">OTCPK:EADSF</a>) delivered, we see that since the end of 2019 there were 356 deliveries. If we add the 2020 fleet of approximately 3,000 airplanes to the Airbus deliveries to China and keep in mind there was no Boeing 737 MAX delivery activity to China, we get to 3,350 airplanes. Remember that that around 3,533 airplanes would be required from simply scaling the travel growth from 2019 to 2023 we see there would be a gap of 183 airplanes.</p> <p class=\"paywall-full-content invisible\">This is where we can without doubt conclude there is demand for the Boeing 737 MAX airplanes that goes beyond the reactivation of the fleet. We get to that conclusion by adding the 85 airplanes that Boeing still has available in the US for delivery to China and the activated fleet of 95 airplanes. <strong>Indeed, we get to 180 units. </strong>It is no coincidence that Boeing has not remarketed those 85 units to other customers outside of China and since some of the Airbus deliveries are actually deliveries to Chinese lessors that do not necessarily place their airplanes with Chinese operators that demand is likely even higher.</p> <p class=\"paywall-full-content invisible\">If we were to remove the lessor deliveries assuming none of the deliveries to Chinese lessors were destined for the Chinese market, we would get to an actual shortage of 250 airplanes to provide comfortable growth to the Chinese market. The actual number likely will be lower than 250 units given the higher seat counts on the newly delivered Airbus A320neo airplanes as well as the higher share of Airbus A321neo deliveries relative to the installed base, but it does show that the Chinese market likely will need a lot more airplanes beyond the ones that have been reactivated and the ones that are awaiting delivery. In fact, the 140 airplanes that were initially built for China but not delivered would fit right in this demand gap with a portion of the shortage caused by the Boeing 737 MAX boycott from China further amplified by the inability of Airbus to stick to their customer delivery schedules.</p> <p class=\"paywall-full-content invisible\">For the month of September, IATA <a href=\"https://www.iata.org/en/iata-repository/publications/economic-reports/air-passenger-market-analysis---september-2023/\" rel=\"nofollow\">reported</a> that capacity had grown 17.6% compared to pre-pandemic capacity which was supported by the Airbus deliveries, the reactivation of the Boeing 737 MAX fleet and more Airbus A321neo deliveries with a higher seat count in the mix but it is clear that there are limits to what capacity expansion can be achieved with the current fleet.</p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/11/14/9932311-17000198992549844_origin.png\" rel=\"lightbox\" data-width=\"2143\" data-height=\"1217\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/11/14/9932311-17000198992549844.png\" alt=\"This image show the Boeing 737 MAX flight statistics of Chinese operators.\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>The Aerospace Forum</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">With the fleet fully returned, there is not much that can be gained in utilization it seems. That utilization has been around 8 hrs and the cumulated flight hours and cycles show quasi-linear growth indicating that in terms of increasing utilization, flights and flight hours there is not much that can be squeezed out of the reactivated fleet of Boeing 737 MAX airplanes.</p> <p class=\"paywall-full-content invisible\">Beyond the point that recommencing deliveries of the Boeing 737 MAX is the logical next step in the process, we see that there still exists a demand gap for Chinese airlines to efficiently service demand. It is also with that in mind, that China has been looking to restart deliveries of the Boeing 737 MAX. So, it is not just a geopolitical event that brings Boeing 737 MAX deliveries back in the picture but mostly a combination of demand and timeline. Geopolitical easing is certainly an element that brings back the Boeing 737 MAX deliveries to the foreground, but we saw similar <a href=\"https://www.reuters.com/business/aerospace-defense/boeing-prepares-737-max-deliveries-china-bloomberg-news-2023-08-25/\" rel=\"nofollow\">arguments</a> in August as the U.S. Commerce Secretary Raimondo visited China and since then no deliveries of the Boeing 737 MAX to Chinese customers have occurred.</p> <h2 class=\"paywall-full-content invisible\">Boeing 737 MAX Deliveries To China: Why This Time Could Be Different</h2> <p class=\"paywall-full-content invisible\">One can wonder if the last political meeting between representatives of China and the U.S. did not result in a resumption of deliveries, why this one would be different. There are various reasons. For China, having continued tension with the U.S comes at a cost. We are <a href=\"https://seekingalpha.com/article/4634350-central-north-airport-group-buy-on-nearshoring-and-tesla-hype\">already seeing</a> nearshoring trends were production is placed outside of China, which is not a good thing for a country that developed due to a thriving manufacturing industry.</p> <p class=\"paywall-full-content invisible\">Furthermore, there is another straightforward reason: As echoed throughout this report, besides the geopolitical element there is the demand trends that necessitate it. Apart from an increase in passenger load factors, there is no pool of airplanes to be reactivated to carry demand besides new airplane deliveries including the 85 Boeing 737 MAX airplanes that are awaiting delivery. In February 2024, Spring Festival takes place which will mark a month of high-volume travel demand. The growth figures from 2022 and 2021 are not a strong indicator due COVID-19 restrictions imposed in comparable periods but in 2019, there were <a href=\"https://www.alwihdainfo.com/Chinese-make-over-400-million-trips-by-rail-during-Spring-Festival_a71315.html\" rel=\"nofollow\">11.4% more trips by air</a> compared to 2018 and this year’s mid Autumn Festival showed 18% more trips by air compared to 2019 so it is very likely that we see double digit growth compared to pre-pandemic times and as inbound as well as outbound tourism are expected to increase further in 2024 there should be an off-peak trend that requires more airplanes than currently are active.</p> <h2 class=\"paywall-full-content invisible\">Boeing 737 MAX Test Activity Has Been Occurring For Months</h2> <p class=\"paywall-full-content invisible\">Further fueling the argument that this is not just an APEC driven event is the fact that flight test activity has been increasing for the jets destined for China that are currently still in the U.S. from 0 to five flights in June to 15 signs of flight activity in September, the same number in October and November being half way through there already saw ten indications of flight activity. So, the flight activity has been ongoing signaling that Boeing has been preparing deliveries way before it was clear that President Biden and President Xi would meet.</p> <h2 class=\"paywall-full-content invisible\">Boeing Appoints China-born Executive</h2> <p class=\"paywall-full-content invisible\">That this is really a multi-angled story also becomes clear from the fact that Boeing <a href=\"https://boeing.mediaroom.com/2023-08-16-Boeing-Appoints-Alvin-Liu-as-China-President\" rel=\"nofollow\">appointed</a> Alvin Liu earlier this year as President of Boeing China. Previously, Liu led the Government Operations team, in which role he likely has had access to promoting the Boeing 737 MAX recertification effort with regulators. In its press release, Boeing did not fail to mention that he was a native. All of this seems to have been to get the delivery flow of Boeing 737 MAX jets to China going again and secure orders in the future.</p> <h2 class=\"paywall-full-content invisible\">It's About More Than Boeing Orders, It's About Deliveries and Leverage</h2> <p class=\"paywall-full-content invisible\">There seems to be some expectations that the APEC meeting will bring some orders for Boeing from China and that is something that would surprise me. It is known that President Xi likes to arrive with a bag of orders for Boeing or Airbus to project purchasing power but that is not the top priority now. If it carries any significance for Boeing, it is more about reinstating the delivery flow to China. The 85 Boeing 737 MAX jets that Boeing has built are closest to deliveries for which no order is required. Those deliveries alone are worth $4.5 billion with hundreds of millions in reported profits as well as a healthy inventory and balance sheet deleveraging. The APEC meeting carries significance in the sense that a very unsatisfactory outcome will delay deliveries, but if things go better than they have been going the past years the actual plan that Boeing has been working on for well over a year now will be executed which will see a handful deliveries to Chinese operators layering <strong>on top</strong> of the 375-400 <a href=\"https://seekingalpha.com/article/4643847-boeing-stock-fails-to-take-off-despite-bullish-future\">guided</a> for.</p> <p class=\"paywall-full-content invisible\">Moreover, China’s need for airplanes remains high also in the years to come and there is no one manufacturer that can satisfy demand. China could be inclined to order more with Airbus, but it would continuously be at the risk of the Airbus production schedule which has also slipped various times and beyond that with each order placed with Airbus China would also be losing its negotiation power as Airbus production slots are fully booked for years to come.</p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/11/14/9932311-17000199071432087_origin.png\" rel=\"lightbox\" data-width=\"1200\" data-height=\"800\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/11/14/9932311-17000199071432087.png\" alt=\"This image shows the Boeing 737 assembly line in Renton.\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>The Ferrari Group</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">That is not necessarily the case with Boeing, as the U.S. jet maker will be <a href=\"https://seekingalpha.com/article/4573883-big-boeing-737-max-boost\">opening</a> a fourth production line for the Boeing 737 MAX in Everett in mid-2024 with production expected to reach 57 per month by 2025 for all four lines combined. The total capacity is estimated at 80 airplanes per month for the Boeing 737 MAX. It is likely that at this stage, China will also be looking to secure delivery slots of the increased rate else it will not have enough delivery slots secured to support demand over the mid to longer term.</p> <p class=\"paywall-full-content invisible\">In the five years prior to the Boeing 737 MAX crisis and even with trade tensions, Chinese airlines took delivery of more than 400 jets averaging 8 airplanes per month which was around 25% of the total production. At a rate of 57 airplanes per month, around 14 airplanes per month could be heading to China. If we assume that Boeing has de-risked China all the way and the ability to increase production to 57 airplanes per month without China, which is the way the company has communicated the demand profile ahead we can also calculate the implied rate including China which would be around 76 airplanes per month which basically means that the fourth production line will be handling capacity requirements from China.</p> <p class=\"paywall-full-content invisible\">It not necessarily the case that this will require more orders. China has a state-regulated ordering process which sees orders ending up in an undisclosed customer tally and that tally for Boeing currently stands at around 600 unidentified orders for the MAX. It is not the case that all of these unidentified orders are Chinese orders but the bulk likely is, meaning that getting an order would be nice but it is not a necessity as the current order book already would account for hundreds of deliveries. Over time to get back to that 25% share in deliveries, a follow-up order or several follow up orders would be required, but right now there is no urgent need for a commercial airplane orders as there still is a backlog to work though.</p> <h2 class=\"paywall-full-content invisible\">Conclusion: A Boeing Puzzle More Complex Than Geopolitics</h2> <p class=\"paywall-full-content invisible\">With this report, I want to show that there are more dynamics than just a single political meeting involved in the resumption of deliveries to China and while one might get the impression that the APEC summing meeting is pivotal, it is in fact only pivotal if that meeting does not go as smoothly as hoped for. This could delay deliveries but otherwise the scenario for which Boeing has presorted for months and almost a year now will unfold and that also keeps in mind demand trends and production capacity as I have firmly supported with data. As a result, I continue to mark Boeing stock a buy.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Editor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks.</p>", "twitContent": "$BA - Why The Boeing Shock Message To China Was Effective. https://seekingalpha.com/article/4652060-why-the-boeing-shock-message-to-china-was-effective?source=tweet ", "innerMarketing": "<p>If you want full access to all our reports, data and investing ideas, <strong><a href=\"https://seekingalpha.com/affiliate_link/JoinTAFBanner\">join The Aerospace Forum</a></strong>, the #1 aerospace, defense and airline investment research service on Seeking Alpha, with access to evoX Data Analytics, our in-house developed data analytics platform. </p><p><a href=\"https://seekingalpha.com/affiliate_link/JoinTAFBanner\"><img src=\"https://static.seekingalpha.com/uploads/2022/11/4/9932311-16675710677690873.png\"></a></p><p></p>", "marketingBullet": "Looking for more investing ideas like this one? Get them exclusively at The Aerospace Forum. <a href='/checkout?service_id=mp_1087&source=mp_marketing_text_top' sasource='mp_marketing_text_top'>Learn More »</a>", "isReit": false, "videoData": null, "marketingBulletVariant": "I am Dhierin Bechai. Using my Aerospace Engineering expertise, I provide a data-driven approach to investing ideas in the growing aerospace, defense and airline industry. I run the investing group <a href=\"/checkout?service_id=mp_1087&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A9932311%7Csection_asset%3Aauthor_bullets%3A-the-aerospace-forum\" data-test-id=\"author-custom-template-link\">The Aerospace Forum</a>.", "marketingBio": "Dhierin-Perkash Bechai is an aerospace, defense and airline analyst.   \n\nDhierin runs the investing group <a href=\"/checkout?service_id=mp_1087&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A9932311%7Csection_asset%3Aauthor_root%3A-the-aerospace-forum\" data-test-id=\"author-custom-template-link\">The Aerospace Forum</a>, whose goal is to discover investment opportunities in the aerospace, defense and airline industry. With a background in aerospace engineering, he provides analysis of a complex industry with significant growth prospects, and offers context to developments as they occur, describing how they might affect investment theses. His investing ideas are driven by data informed analysis. The investing group also provides direct access to data analytics monitors. \n<a href=\"/checkout?service_id=mp_1087&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A9932311%7Csection_asset%3Aauthor_root%3A-the-aerospace-forum\" data-test-id=\"author-custom-template-link\">Learn more.</a>", "audioDuration": null}, "relationships": {"author": {"data": {"id": "50291", "type": "author"}}, "sentiments": {"data": [{"id": "502145", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "769", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "12125", "type": "tag"}, {"id": "11855", "type": "tag"}]}, "otherTags": {"data": [{"id": "104891", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4652060-why-the-boeing-shock-message-to-china-was-effective", "canonical": "https://seekingalpha.com/article/4652060-why-the-boeing-shock-message-to-china-was-effective", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/803127826/image_803127826.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "1087", "type": "authorResearch", "attributes": {"createdAt": "2016-12-15T15:06:44-05:00", "title": "The Aerospace Forum", "rating": "5.0", "reviewCount": 2, "shortPitch": "In-depth insights from an expert on the aerospace and airline industries", "categories": ["Quantitative", "Value"], "serviceAssistantIds": [], "inAppPurchasesAllowedInIos": false, "inAppPurchasesAllowedInAndroid": false, "activeSubscriptionsCount": 11090, "androidIapPlan": "none", "iosIapPlan": "none", "description": "We believe that some industries require thorough expertise coverage in order to gain understanding of the industry and successfully invest in it. The AeroAnalysis premium service provides that with aerospace, where we go a step further in our research and share those details with our subscribers. ", "landingPageColor": null, "adUnits": ["direct_access", "active_chat", "weekly_news", "qa_session", "access_all", "wildcard"], "tempData": {}, "price": 49.0, "wildcardText": "Interactive Data Analytics", "slug": "the-aerospace-forum", "annualPriceWithDiscount": 499.0, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": true}, "relationships": {"author": {"data": {"id": "50291", "type": "author"}}}}, {"id": "50291", "type": "author", "attributes": {"company": null, "slug": "dhierin-bechai", "userId": 9932311, "tagId": 104891, "bio": "<p>Dhierin-Perkash Bechai is an aerospace, defense and airline analyst.</p> \r\nDhierin runs the investing group <a href=\"https://seekingalpha.com/checkout?service_id=mp_1087\">The Aerospace Forum</a>, whose goal is to discover investment opportunities in the aerospace, defense and airline industry. With a background in aerospace engineering, he provides analysis of a complex industry with significant growth prospects, and offers context to developments as they occur, describing how they might affect investment theses. His investing ideas are driven by data informed analysis. The investing group also provides direct access to data analytics monitors. \r\n<a href=\"https://seekingalpha.com/checkout?service_id=mp_1087\">Learn more</a>.", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/009/932/311/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/009/932/311/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/009/932/311/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/009/932/311/extra_large_pic.png"}, "nick": "Dhierin Bechai", "deactivated": null, "memberSince": 2013, "isRss": false, "contributorSince": 2013, "followersCount": 17992}, "relationships": {"user": {"data": {"id": "9932311", "type": "user"}}, "userBioTags": {"data": [{"id": "1039838", "type": "userBioTag"}, {"id": "1039839", "type": "userBioTag"}, {"id": "1039840", "type": "userBioTag"}, {"id": "1039841", "type": "userBioTag"}, {"id": "1039842", "type": "userBioTag"}, {"id": "1039843", "type": "userBioTag"}, {"id": "1039844", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1087", "type": "authorResearch"}}}, "links": {"self": "/author/dhierin-bechai", "profileUrl": "/author/dhierin-bechai", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "769", "type": "tag", "attributes": {"slug": "ba", "name": "BA", "company": "The Boeing Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "20", "type": "sector"}}}, "links": {"self": "/symbol/BA"}}, {"id": "12125", "type": "tag", "attributes": {"slug": "eadsf", "name": "EADSF", "company": "Airbus SE", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "OTCMKTS", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/EADSF"}}, {"id": "11855", "type": "tag", "attributes": {"slug": "eadsy", "name": "EADSY", "company": "Airbus SE", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "OTCMKTS", "fundTypeId": 8, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/EADSY"}}, {"id": "104891", "type": "tag", "attributes": {"slug": "dhierin-bechai", "name": "Dhierin Bechai", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/dhierin-bechai"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "502145", "type": "sentiment", "attributes": {"articleId": 4652060, "type": "bullish", "createdAt": "2023-11-16T08:00:00.000-05:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4652060", "type": "article"}}, "tag": {"data": {"id": "769", "type": "tag"}}}}]}