{"data": {"id": "4500464", "type": "fullArticle", "attributes": {"publishOn": "2022-04-08T12:02:51-04:00", "isLockedPro": false, "commentCount": 8, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"patrick-doyle": {"id": 578431, "slug": "patrick-doyle", "kind": "common", "non_theme": true}, "itw": {"id": 2752, "slug": "itw", "kind": "common", "non_theme": true}, "industrial-goods": {"id": 17913, "slug": "industrial-goods", "kind": "common", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "tier-1": {"id": 603709, "slug": "tier-1", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "diversified-machinery": {"id": 17917, "slug": "diversified-machinery", "kind": "common", "non_theme": true}, "industrials": {"id": 20, "slug": "industrials", "kind": "sector", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "sasource": "theme_breadcrumb"}}, "title": "Short Puts A Better Way To Play Illinois Tool Works", "summary": ["The company has returned to trend after a pretty soft 2020. The problem is that trend is quite flat. Revenue and net income are lower now than in 2014.", "In spite of this, the shares are priced at a relative premium. I don't think this is reasonable.", "There's value here, obviously, and the options market is offering us the opportunity to generate reasonable premia on reasonable strike prices."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2022-04-08T12:02:55-04:00", "isModerated": false, "closestTradingDate": "2022-04-08", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 5, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of ITW either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I just sold 4 of the puts described in this article for $2.15 each.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-w750\" alt=\"Trading Charts on a Display\" data-id=\"1317587887\" data-type=\"getty-image\" width=\"7952px\" height=\"5304px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"></picture><figcaption><p>da-kuk/E+ via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>It's been about 22 months since I announced that I was taking profits in Illinois Tool Works (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ITW\" title=\"Illinois Tool Works Inc.\">ITW</a></span>) in an <a href=\"https://seekingalpha.com/article/4352068-taking-profits-in-illinois-tool-works\">article</a> with the high original title \"Taking Profits in Illinois Tool Works\", and in that time<span class=\"paywall-full-content invisible\"> the shares have returned about 16% against a gain of ~42% for the S&amp;P 500. Much has happened since, obviously, so I thought I'd look at the company again to see if it makes sense to buy back in. I'll review the financials, and I'll look at the stock as a thing quite distinct from the underlying business. Finally, I think there's a pretty decent options trade here, so I'm going to write about it, too.</span></p> <p class=\"paywall-full-content invisible\">Let's imagine that you're someone who wants to know the thrust of a given article, but you're also the sort to skip right over the title of said article, along with the mandatory bullet points in that article. If this rather eccentric combination of <span>characteriztics exists within you, then this \"thesis statement\" paragraph is the answer to your prayers. It's here that I offer up the main points of my argument, because I understand that not everyone likes titles, and I very much understand that not everyone can read 2,000+ of my words. I'm of the view that Illinois Tool Works is a mediocre investment at best at the moment. Although 2021 was a great improvement from 2020, that's not much of an achievement, given that 2020 was the slough of despond. The fact is that both revenue and net income were significantly lower in 2021 than they were in 2014. This is not a growth company, and thus doesn't deserve a premium price, which it currently sports. For that reason, I would recommend continuing to eschew the name. Just because I don't want to buy the stock doesn't mean there's nothing to be done here, though. The options market is offering reasonable cash for deep out of the money puts, so I'll be selling some over the next few days. Specifically, I'll be selling the September puts with a strike of $160. If the shares don't happen to drop dramatically over the next 5 ½ months I'll simply pocket the premium. If they do, I'll be obliged to buy at a dividend yield just north of 3%. There you have it. That's the gist of my argument here. If you read on from this point, any emotional damage you suffer as a result is entirely your responsibility. I don't want to read any moaning about my correct spelling or anything else in the comments section.</span></p> <h2 class=\"paywall-full-content invisible\">Financial Snapshot</h2> <p class=\"paywall-full-content invisible\">Relative to 2020, the company's financial performance in 2021 was quite good in my estimation. For example, the top line grew by about 15%. IN spite of a 15% uptick in cost of revenue, a 9% uptick in SG&amp;A, operating income rose 20%, and net income was up a whopping 27% from the year ago period. In addition, the capital structure improved dramatically, with long term debt down about 11% from 2020. The company rewarded shareholders by upping the dividends per share by just under 7%.</p> <p class=\"paywall-full-content invisible\">I'm a historically minded guy, though, and I want to compare the most recent year with the long term trend here. When I do that, I see that the financial situation isn't as rosy. I'd say that 2021 was less of a \"growth\" year, and more of a \"return to trend\" year. For instance, when we compare 2021 to 2014, to pick a year totally at random, a different story emerges. Revenue in 2021 was actually about .2% lower than it was in 2014, and net income is about 8.5% lower. Long term debt hasn't budged from 2014. One thing that has improved dramatically is the amount of money dedicated to dividends. These have more than doubled, up by $752 million from 2014. This phenomenon of a flatlining business, with a higher dividend attached is expressed by the payout ratio which has moved from the mid-30s to the mid-50s. My view is that at some point these two functions (flatlining revenue and growing dividends) will intersect, and the growth the market may have bet upon will cease. We're not near that time yet, though, and I think the dividend is reasonably well covered, so I'd be open to buying back in at the right price.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\"><picture><img src=\"https://static.seekingalpha.com/uploads/2022/4/8/saupload_fLwW825HGzYuRt49MmdeTkmg60R8D8w5j_M4b-bpcY6EEeiOHnj4Bn4p8GdOdJYjAdfLJ2NHnoNUcgwW-hEn9-PbwYNQ6yR3ITMwae6EI-hs698_UJiKQH2x9YVcczCuIU2q5P4_.png\" alt=\"A financial history of Illinois Tool Works from 2014 to the present\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Illinois Tool Works Financial History (Illinois Tool Works investor relations.)</p></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">The Stock</h2> <p class=\"paywall-full-content invisible\">Some of you who follow me regularly for some bizarre reason know that it's at this point in the article where I turn into a real \"downer\" because it's here that I remind everyone that a great company can be a terrible investment at the wrong price. There is a difference between a company, and its stock. This is because the company sells goods or services, hopefully for a profit. The stock is a (sometimes poor) proxy for the fortunes of the company, and its price changes are governed more by the mood of the crowd than anything related to the company. In particular, the stock is buffeted by the crowd's changing opinions about the very long term future of a given company. It's for this reason that I treat stocks and companies as distinct entities.</p> <p class=\"paywall-full-content invisible\">Now I imagine that there are some of you reading this who are hopeful that I've made the point and will move on. You think, naively as it turns out, that I'm not going to indulge in my tendency to \"drone on\" about this further. Oh, poor dear hopeful souls. I'm just getting warmed up. I want to belabor this point further by using Illinois Tool Works stock itself to highlight the difference between \"company\" and \"stock.\" The company released annual results on February 11th. If you bought this stock that day, you're down about 6% since. If you waited until March 8th, to pick a date completely at random, you're up about .7% since then. Obviously, not much changed at the firm over these few weeks to justify a near 7% variance in returns. The differences in return came down entirely to the price paid. The investors who bought virtually identical shares more cheaply did better than those who bought the shares at a higher price. This is why I try to avoid overpaying for stocks.</p> <p class=\"paywall-full-content invisible\">My regulars know that I measure the cheapness (or not) of a stock in a few ways, ranging from the simple to the more complex. On the simple side, I look at the ratio of price to some measure of economic value like sales, earnings, free cash flow, and the like. Ideally, I want to see a stock trading at a discount to both its own history and the overall market. When I last looked at this name, the PE was about 23, which I considered to be a bit rich in light of the fact that at the time, management was telegraphing a decline in revenue. Although the ratio has been coming down recently, it's still rather high by historical standards per the following:</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/4/8/saupload_8469796a7248d2456b9f376d9172ded8.png\" class=\"sa-ycharts-img\" alt=\"Illinois Tool Works price and PE ratio \" hspace=\"6\" vspace=\"6\" width=\"635\" height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Source: YCharts</p> <p class=\"paywall-full-content invisible\">At least it could be said that at the same time the stock is trading near a <span>multiyear high ratio, at least investors are receiving an average dividend yield for their troubles at the moment.</span></p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/4/8/saupload_c495d8a3926841bab672818785eb6a85.png\" class=\"sa-ycharts-img\" alt=\"Illinois Tool Works price and dividend yield\" hspace=\"6\" vspace=\"6\" width=\"635\" height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Source: YCharts</p> <p class=\"paywall-full-content invisible\">So, to sum up so far:</p> <ol class=\"paywall-full-content invisible\"> <li><p>The business has remained static over the past 7 years, with both revenue and net income in 2021 being slightly lower than they were in 2014.</p></li> <li><p>Over the same time period, the stock is up at a CAGR of ~12%.</p></li> </ol> <p class=\"paywall-full-content invisible\">I understand that the market is not rational, but I see value in pointing out how far from rational we've ventured so we might get some understanding of what the world may look like if and when rationality reasserts itself.</p> <p class=\"paywall-full-content invisible\">In addition to looking at simple ratios of price to some value, I want to try to understand the market's current \"thinking\" about a given company's future. In order to do this, I turn to the methodology described by Professor Stephen Penman in his book \"Accounting for Value.\" In this book, Penman walks investors through how they might isolate the \"g\" (growth) variable in a standard finance formula to work out what the market must be assuming about the future. Applying this methodology to Illinois Tool Works at the moment suggests that the market is forecasting a growth rate here of about 5.8%. I consider this to be a fairly optimistic forecast. Given all of the above, I can't recommend buying the shares at current levels.</p> <h2 class=\"paywall-full-content invisible\">Options A Viable Alternative</h2> <p class=\"paywall-full-content invisible\">You may recall from the above and from my previous work on this name that I consider the dividend to be reasonably secure. For that reason, I'd be comfortable buying the shares at a different price. Thankfully, the options market gives me the chance to potentially do just that. As you know if you follow me regularly, I <span>characterize deep out of the money short puts on companies that I like to be \"win-win\" trades. I describe them thus because if the stock price remains above the strike price over the life of the contract, I collect the premium, which is never a hardship. If the stock price drops below the strike, I'll be obliged to buy, but will do so at a price that I had determined to be a good entry point. This is also a better outcome than the investor who simply took the market price on the day I wrote the option, so that outcome's fine, too. Hence, \"win-win.\"</span></p> <p class=\"paywall-full-content invisible\">With that out of the way, it's time for me to get into the specifics of the trade I'm recommending. At the moment I like the September ITW put with a strike of $160 which is currently bid at $2.05. I like this trade because if the shares remain above $160 over the next 5 ½ months, I'll simply pocket the premium. If the shares fall about 22%, I'll be obliged to buy. Holding all else constant, this net entry price of ~$158 is the equivalent of a PE of 18.5 and a dividend yield of just over 3%. I would consider this outcome to be pretty positive also.</p> <p class=\"paywall-full-content invisible\">It's that time again. Welcome to the point in the article where I get to indulge in my semi-sadistic tendency to spoil people's moods by pointing out that the phrase \"win-win\" is really just a bit of rhetoric. This trade, like all others, comes with risk. I consider the risks associated with these instruments to fall into two broad categories: the economic and the emotional.</p> <p class=\"paywall-full-content invisible\">Starting with the economic risks, I'd say that the short puts I advocate are a small subset of the total number of put options out there. I'm only ever willing to sell puts on companies I'd be willing to buy, and at prices I'd be willing to pay. So, I would never advocate that people simply sell puts with this highest premia. In my view, that strategy would lead to disastrous results. So, dear reader, only ever sell puts on companies you want to own at (strike) prices you'd be willing to pay.</p> <p class=\"paywall-full-content invisible\">The two other risks associated with my short puts strategy are both emotional in nature. The first involves the emotional pain some people feel from missing out on upside. To use this trade as an example, let's assume that the market continues to reward a flatlining company like this one with ever higher multiples, and the stock moves to $250 per share between now and the third Friday of September. Obviously my puts will expire worthless, which is a great outcome in some ways. I will not catch any of the upside in the stock price, though. So, short put returns are capped by the premium received. This is emotionally painful for some. If you knew the life I've lived, you'd understand why my expectations are muted, so \"not capturing 100% of the upside\" isn't really a hardship for me.</p> <p class=\"paywall-full-content invisible\">Secondly, it can be emotionally painful when the shares crash below your strike price. This has happened to me more than a few times over the years. While it most often works out well, it is emotionally painful in the short term. The fact is that it's not fun when the stock crashes well below the strike price. So, I can make a reasonable argument that ITW would be a steal at a net price of $158, but if the shares drop to $145, for instance, that will take an emotional toll, at least in the short run. I think people who sell puts should be aware of these emotional risks before selling.</p> <p class=\"paywall-full-content invisible\">If you understand these risks, and can tolerate them, I would recommend that you sell puts in lieu of buying shares. The return may be lower, but in my experience this game isn't about trying to capture maximum returns. It's about trying to capture maximum risk adjusted returns, and a deep out of the money put is a far less risky proposition than the stock in my view.</p> <h2 class=\"paywall-full-content invisible\"><strong>Conclusion</strong></h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">I think Illinois Tool Works is the most \"steady state\" business that I've reviewed in some time. It's less profitable now than it was in 2014, but not egregiously so. The dividend is reasonably well covered. I just don't think investors should expect much in the way of growth here, and for that reason, I can't buy at the current multiple. That said, I think there's a way to generate some return by entering into what I've <span>characterized as a \"win-win\" trade. If the shares don't happen to plummet in price, I'll simply pocket the premia. If the shares do drop in price, I'll be relieved I didn't buy today, and will lock in a price that lines up nicely with great long term returns here. If you're comfortable with short puts, I'd recommend this or similar trade. If you're not, I think you'd be wise to avoid these shares until they become more reasonably priced.</span></p>", "twitContent": "$ITW - Short Puts A Better Way To Play Illinois Tool Works. https://seekingalpha.com/article/4500464-short-puts-a-better-way-to-play-illinois-tool-works?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104099", "type": "author"}}, "sentiments": {"data": [{"id": "368903", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2752", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "578431", "type": "tag"}, {"id": "17913", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "603709", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17917", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4500464-short-puts-a-better-way-to-play-illinois-tool-works", "canonical": "https://seekingalpha.com/article/4500464-short-puts-a-better-way-to-play-illinois-tool-works", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1317587887/image_1317587887.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "104099", "type": "author", "attributes": {"company": null, "slug": "patrick-doyle", "userId": 48515253, "tagId": 578431, "bio": "<p>I'm a quant investment newsletter writer who marries fundamental analysis with the latest research in momentum. Over the past few years, I’ve developed a piece of software that helps me track the level of optimism and pessimism embedded in stock price. I seek to challenge the assumptions embedded in price by profitably exploiting the disconnect between what the market thinks and what is a likely outcome. I invest in those companies that have a greater than average chance of giving us all a surprise in the next few months. </p><p><br></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/048/515/253/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/048/515/253/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/048/515/253/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/048/515/253/extra_large_pic.png"}, "nick": "Patrick Doyle", "deactivated": null, "memberSince": 2017, "isRss": false, "contributorSince": 2018, "followersCount": 7175}, "relationships": {"user": {"data": {"id": "48515253", "type": "user"}}, "userBioTags": {"data": [{"id": "927945", "type": "userBioTag"}, {"id": "927946", "type": "userBioTag"}, {"id": "927947", "type": "userBioTag"}, {"id": "927948", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/patrick-doyle", "profileUrl": "/author/patrick-doyle", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2752", "type": "tag", "attributes": {"slug": "itw", "name": "ITW", "company": "Illinois Tool Works Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "20", "type": "sector"}}}, "links": {"self": "/symbol/ITW"}}, {"id": "578431", "type": "tag", "attributes": {"slug": "patrick-doyle", "name": "Patrick Doyle", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/patrick-doyle"}}, {"id": "17913", "type": "tag", "attributes": {"slug": "industrial-goods", "name": "Industrial Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/industrial-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "603709", "type": "tag", "attributes": {"slug": "tier-1", "name": "Tier 1", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/tier-1"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17917", "type": "tag", "attributes": {"slug": "diversified-machinery", "name": "Diversified Machinery", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/diversified-machinery"}}, {"id": "368903", "type": "sentiment", "attributes": {"articleId": 4500464, "type": "neutral", "createdAt": "2022-04-08T12:02:51.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4500464", "type": "article"}}, "tag": {"data": {"id": "2752", "type": "tag"}}}}]}