{"data": {"id": "4559303", "type": "fullArticle", "attributes": {"publishOn": "2022-11-20T04:29:19-05:00", "isLockedPro": false, "commentCount": 0, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"gs-analytics": {"id": 110742, "slug": "gs-analytics", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "itw": {"id": 2752, "slug": "itw", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "tier-1": {"id": 603709, "slug": "tier-1", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "industrials": {"id": 20, "slug": "industrials", "kind": "sector", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "sasource": "theme_breadcrumb"}}, "title": "Illinois Tool Works' Outperformance Can Continue", "summary": ["In the last quarter, Illinois Tool Works reported an organic growth rate between mid-teens and mid-20s percentage in 5 out of 7 segments, driven by healthy demand in the end market.", "The demand across the industrial sector remained strong, while consumer-related demand was down.", "Looking forward, revenue should benefit from the company’s “Win the Recovery” initiative.", "The improvement in price/cost and enterprise strategy (80/20 Front-to-back) are the tailwinds for operating margin."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2022-11-20T04:29:25-05:00", "isModerated": false, "closestTradingDate": "2022-11-21", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 3, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-w750\" alt=\"bull and chart for business or bull market trader concept\" data-id=\"1331863711\" data-type=\"getty-image\" width=\"5962px\" height=\"3354px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">niphon</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Investment Thesis</h2> <p>Since our last <a href=\"https://seekingalpha.com/article/4529862-itw-solid-growth-potential\">bullish article</a>, Illinois Tool Works Inc. (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ITW\" title=\"Illinois Tool Works Inc.\">ITW</a></span>) has outperformed the broader markets, gaining over 9% versus S&amp;P 500’s (<a href=\"https://seekingalpha.com/symbol/SPY\" title=\"SPDR® S&amp;P 500 ETF Trust\">SPY</a>) ~4% decline in the same period. In the third quarter of 2022, Illinois<span class=\"paywall-full-content invisible\"> Tool Works recorded double-digit growth rates in 5 out of 7 segments, aided by its “Win the Recovery” strategy and strong demand across the end market. In the quarter, demand in the industrial sector remained strong, while consumer-related demand was essentially down. In line with its 80/20 Front-to-Back strategy, the operating margin also showed improvement helped by better operational efficiency and productivity, and the company should continue to benefit from this strategy.</span></p> <p class=\"paywall-full-content invisible\">In recent quarters, one of the major headwinds for the operating margin has been the prevailing negative price/cost impacts caused by supply chain disruptions, raw material scarcity, an inflationary business environment, and changes in US trade policy. However, management is taking steps to offset cost inflation through price increases, and the price/cost has improved sequentially, which should support the operating margin growth in the coming quarters.</p> <p class=\"paywall-full-content invisible\">Looking ahead, I believe the solid demand in ~80% of ITW’s business portfolio and the price increase should continue to support revenue growth. Further, the price and cost improvement coupled with an enterprise strategy should support the growth of the operating margin in upcoming years. While the valuations have increased after the recent run-up, I believe the stock is still a good long-term buy given the prospects of organic revenue growth, market share gains, and margin expansion.</p> <h2 class=\"paywall-full-content invisible\">ITW Q3 2022 Earnings</h2> <p class=\"paywall-full-content invisible\">Last month, ITW reported better-than-expected results for the third quarter of 2022. Sales for the quarter stood at $4 billion, an increase of 13% Y/Y, and were above the consensus estimate of $3.89 billion. Organic growth in the Automotive OEM and Food segments was especially strong, and the segments recorded growth of 25% Y/Y ($753 million) and 23% ($633 million) Y/Y, respectively. The operating margin stood at 24.5%, an increase of 70 bps Y/Y due to better productivity and price management. Improved revenue growth, and margin expansion, resulted in increased EPS, which was $2.35, up 16% Y/Y and above the consensus estimate of $2.25.</p> <h2 class=\"paywall-full-content invisible\">Revenue Analysis And Outlook</h2> <p class=\"paywall-full-content invisible\">In the third quarter of 2022, Organic growth was 16% Y/Y while the acquisition of MTS had a positive impact of ~3% Y/Y on the revenue growth rate. Foreign currency translation was a ~6% Y/Y headwind to the revenue growth rate in Q3 as compared to a 4% headwind in Q2 due to the further strengthening of the US dollar. The price increases contribute meaningfully to the revenue growth in the third quarter of 2022, and I believe that it should support revenue growth in upcoming quarters as well.</p> <p class=\"paywall-full-content invisible\">Despite the challenging business environment in the recent quarter, the company reported an organic growth rate of 16% Y/Y with double-digit growth in 5 out of 7 segments. The company’s organic growth was helped by its \"Win the Recovery\" strategy and strong demand in the end market.</p> <p class=\"paywall-full-content invisible\">The Automotive OEM segment recorded a strong organic growth of 25% Y/Y. China was up 29% due to sequential recovery as the restrictions imposed in the lockdown in Q2 22 were eased.</p> <p class=\"paywall-full-content invisible\">The food equipment segment also delivered strong organic growth of 23% Y/Y with robust growth in the institutional markets, which was up 50% Y/Y with strong demand across the business, most importantly in lodging as the economy reopens.</p> <p class=\"paywall-full-content invisible\">The welding segment grew 14% Y/Y organically, with equipment up 13% Y/Y and consumables up 15% Y/Y. The industrial business was the standout, with organic growth of 32% Y/Y, while the commercial side, which sells to smaller businesses and individual sellers, was down 10% Y/Y due to lower demand and inventory destocking in the channel.</p> <p class=\"paywall-full-content invisible\">Organically, the polymers and fluids segment grew by 8% Y/Y. The polymers business was up 21% Y/Y with continued strength in industrial applications, offset by the lower organic growth of 5% Y/Y in the fluid business, which is seeing softening in demand due to higher gas prices.</p> <p class=\"paywall-full-content invisible\">Specialty growth was essentially flat as product line simplification (PLS) activities resulted in the elimination of a product line in one of its consumer packaging businesses. Excluding PLS, the segment would have been up 3%.</p> <p class=\"paywall-full-content invisible\">Looking forward, I expect the company's consumer-related and interest-sensitive end markets like the global residential construction, automotive aftermarket, commercial welding, and appliance components markets to slow. However, the good news is these businesses together represent only 20% of the company's revenues. The strength in the rest 80% of the business, especially automotive and food equipment, should more than offset this weakness.</p> <p class=\"paywall-full-content invisible\">The chip shortage has been a major headwind in the automotive OEM segment since Q3 last year. However, in the recent quarter, a sequential improvement in the supply chain and improved chip shortage situation, combined with easing comps has contributed meaningful growth to net sales. I believe these improvements should continue and generate an improved revenue growth rate in the coming quarters.</p> <p class=\"paywall-full-content invisible\">Also, in line with the \"Win the recovery strategy\" which is focused on market share gains, the company is making good progress on its content per vehicle growth which can be evident from the YTD growth rate of 9% that outperformed the auto build growth rate of 7% Y/Y. This indicates good growth prospects for the automotive OEM segment. The restrictions imposed due to COVID-19 are being removed in the hospitality sector, which should support further revenue growth in the food equipment segment. The manufacturing PMI index is still above the level of 50 points which indicates the growth in the Industrial end market which is another positive for ITW.</p> <p class=\"paywall-full-content invisible\">The revenue should continue to benefit from the “Win the Recovery” strategy, robust demand, and price increases. So, I believe the company should be able to post mid-single-digit organic growth despite macroeconomic concerns. FX should continue to be a headwind, especially in the first half of the next year, even if we assume USD remains at the current levels (given that USD has strengthened as this year has progressed and is higher compared to 1H 2022 levels). However, even if we assume a couple of hundred bps headwinds from strong USD, the company can still post low single-digit percentage growth in revenue in FY 2023. My estimates are slightly above the sell-side consensus and, while I understand challenging macros, I am more optimistic about ITW’s execution and market share growth prospects compared to what the Street is expecting.</p> <h2 class=\"paywall-full-content invisible\">Margin Outlook</h2> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2022/11/19/saupload_Rn5ZVjyvnQnTd_21xcvXYcjHoSrFW0kXadA--XEv8nDqb6wPfFESmCbRihUVqKKanNkeTR0cXb-jCvzQPjDOSncdaxGUKNcXKCnshmemD7UM9nnCqLtbjWshQ_geBNujQ3cX9oi0no5o0FMDdqltmVy9v099rwCh11BuWkpGxMaPoHDFpDC31SPHiz8ZzFcR.png\" alt=\"ITW Operating Margins\" contenteditable=\"false\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\">ITW Operating Margins <span>(Company Data, GS Analytics Estimates)</span></p></figcaption></figure><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2022/11/19/saupload_IHfrI0uo6PJrDCRiqHSMYS4-HUKPI5PG2uUEuzqf36nDvzW7mlibjxLrI2MU55FoYjaXC2zQw9d42ALSFD8-eXf4QeGpMEiOKAvfX8kq5n6w9_lhBB1d_2C6Wsbr9GHn8NG7lxsUmas8wWRvYgVjOOOiBRjDCQCuLexbiy9p59S_lXWLgxwxc7OCh5oMpwLP.png\" alt=\"ITW Price Cost Impact\" contenteditable=\"false\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\">ITW Price Cost Impact <span>(Company Data, GS Analytics Estimates)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">The operating margin increased sequentially from 23.09% in the second quarter to 24.50% in the third quarter of 2022, which is around the pre-pandemic level. One of the major tailwinds for the operating margin is reduced SG&amp;A expenses as a % of the total revenue, which contributed to a ~90 bps improvement sequentially. In the third quarter of 2022, the price/cost impact was negative 40 bps, a sequential improvement from negative 160 bps in Q2, which supported the operating margin growth.</p> <p class=\"paywall-full-content invisible\">In line with the 80/20 Front-to-Back strategy, the company continued to show improved productivity and operational efficiency, which benefited the operating margin. Through the application of data-driven insights generated by 80/20 practice, ITW focuses on its largest and best opportunities (the \"80\") and eliminates the cost, complexity, and distractions associated with the less profitable opportunities (the \"20\").</p> <p class=\"paywall-full-content invisible\">For the first time in five quarters, the incremental margins in 3Q22 returned to their normal 30% plus level. The impact of volume growth, enterprise initiatives, pricing action, and some improvement in cost inflation resulted in an incremental margin of ~39%.</p> <p class=\"paywall-full-content invisible\">Looking ahead, with price/cost is turning further positive, the incremental margins could continue to be in the high 30s. Further, in line with the 80/20 Front-to-back initiative, the company should continue to improve operational efficiency and productivity and reduce SG&amp;A as a % of total sales. These factors coupled with easing supply chain constraints should drive the operating margin expansion in upcoming years.</p> <h2 class=\"paywall-full-content invisible\">Valuation And Conclusion</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">The stock is trading at a 24.21x FY2022 consensus EPS estimate of $9.37 and has a forward dividend yield of 2.31%. While the valuations have increased since our <a href=\"https://seekingalpha.com/article/4529862-itw-solid-growth-potential\">last article</a> and are now in line with its 5-year historical average, I believe the stock still offers a good buying opportunity for medium to long-term investors. The company’s initiatives like “Win the Recovery” can help it gain market share and there is a good possibility that it can post better than expected revenue growth compared to what most of the investors and sell-side analysts are expecting based on the broader macroeconomic conditions. With incremental margins in the high 30s, the EPS growth might also surprise the street positively. Further, for long-term investors who can look beyond the current slowdown, the stock offers a good secular growth opportunity that can grow at a higher pace than the end markets. Hence, I continue to have a buy rating on the stock.</p> <div id=\"highlighter--hover-tools\" style=\"display: none;\" class=\"paywall-full-content invisible\"><div id=\"highlighter--hover-tools--container\"> <div class=\"highlighter--icon highlighter--icon-copy\" title=\"Copy\"> </div> <div class=\"highlighter--icon highlighter--icon-change-color\" title=\"Change Color\"> </div> <div class=\"highlighter--icon highlighter--icon-delete\" title=\"Delete\"> </div> </div></div>", "twitContent": "$ITW - Illinois Tool Works' Outperformance Can Continue. https://seekingalpha.com/article/4559303-illinois-tool-works-outperformance-can-continue?source=tweet ", "innerMarketing": "<div id=\"highlighter--hover-tools\" style=\"display: none;\"><div id=\"highlighter--hover-tools--container\"><div class=\"highlighter--icon highlighter--icon-copy\" title=\"Copy\"> </div>         <div class=\"highlighter--icon highlighter--icon-change-color\" title=\"Change Color\"> </div>         <div class=\"highlighter--icon highlighter--icon-delete\" title=\"Delete\"> </div></div></div>", "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "54272", "type": "author"}}, "sentiments": {"data": [{"id": "421379", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2752", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "110742", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "603709", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4559303-illinois-tool-works-outperformance-can-continue", "canonical": "https://seekingalpha.com/article/4559303-illinois-tool-works-outperformance-can-continue", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1331863711/image_1331863711.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "54272", "type": "author", "attributes": {"company": null, "slug": "gs-analytics", "userId": 15666062, "tagId": 110742, "bio": "<p>We focus on GARP (Growth at reasonable Price) opportunities in industrial, consumer, and technology sectors. We are among the top 50 financial experts (Out of ~39,000 tracked) as measured by Tipranks based on the consistency of our stock recommendations and returns generated https://www.tipranks.com/experts/bloggers/gs-analytics. Please click the \"Follow\" button to receive our latest research. If you have any questions, feel free to reach out to us through the comments section of our articles or SA messaging functionality. </p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/015/666/062/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/015/666/062/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/015/666/062/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/015/666/062/extra_large_pic.png"}, "nick": "GS Analytics", "deactivated": null, "memberSince": 2013, "isRss": false, "contributorSince": 2013, "followersCount": 3205}, "relationships": {"user": {"data": {"id": "15666062", "type": "user"}}, "userBioTags": {"data": [{"id": "921214", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/gs-analytics", "profileUrl": "/author/gs-analytics", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2752", "type": "tag", "attributes": {"slug": "itw", "name": "ITW", "company": "Illinois Tool Works Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "20", "type": "sector"}}}, "links": {"self": "/symbol/ITW"}}, {"id": "110742", "type": "tag", "attributes": {"slug": "gs-analytics", "name": "GS Analytics", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/gs-analytics"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "603709", "type": "tag", "attributes": {"slug": "tier-1", "name": "Tier 1", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/tier-1"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "421379", "type": "sentiment", "attributes": {"articleId": 4559303, "type": "bullish", "createdAt": "2022-11-20T04:29:19.000-05:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4559303", "type": "article"}}, "tag": {"data": {"id": "2752", "type": "tag"}}}}]}