{"data": {"id": "4336757", "type": "fullArticle", "attributes": {"publishOn": "2020-04-08T18:00:55-04:00", "isLockedPro": false, "commentCount": 4, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"harrison-liftman": {"id": 586260, "slug": "harrison-liftman", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "dis": {"id": 86, "slug": "dis", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro Diversified For Future Success", "summary": ["The closure of Toys R Us created an unfair knock on Hasbro and has skewed toy industry data for the last two years.", "Hasbro can replicate its successful playbook of driving revenue across toys, digital gaming, and movies & TV with the upcoming release of GI Joe.", "The integration of its recent acquisition, eOne, will allow Hasbro to diversify into movies & television with additional digital content.", "Hasbro has strong runway to grow its digital gaming segment, particularly through Wizards of the Coast.", "Hasbro can drive further meaningful revenue off Disney's forward push into content creation as it grows Disney+."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2020-04-08T18:00:55-04:00", "isModerated": false, "closestTradingDate": "2020-04-09", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 5, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<h2>Investment Thesis</h2> <p>Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) represents a compelling long opportunity with ~40% upside based on the potential to leverage its intellectual property and recent acquisition of Entertainment One to transition into a more diversified company with toys, digital gaming, and television and movies, while continuing to build upon its existing relationship with Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>).</p> <h2>Background</h2> <p>Hasbro’s stock is ~40% off of its record high, trading at $75 per share compared to $126 per share in July of 2019. The stock has had a recent bounce in the past two weeks after the CEO, Brian Goldner, <a href=\"https://www.cnbc.com/2020/03/23/coronavirus-hasbro-shares-soar-as-ceo-cites-great-demand-for-toys.html\" rel=\"nofollow\">appeared on CNBC</a>. Goldner stated that supply chains have been operationalized in China and demand for its traditional board games has remained strong. Short-term investors seek companies that are conducive to remaining at home during the coronavirus and a company that produces board games certainly resonates. Overall weakness in Hasbro’s stock is driven by consumer outlook for the toy industry, which remains bleak for the remainder of 2020.</p> <h2>Description</h2> <p>Hasbro is a toy and entertainment company whose business is organized into three segments: U.S. and Canada, International, and Entertainment, Licensing and Digital. While only ~10% of revenue, Entertainment, Licensing and Digital represents the strongest avenue for future growth as historical growth for the segment was ~22% over the past year. Hasbro has a strong focus on this area as evident by its recent acquisition of Entertainment One, which is a global entertainment company that focuses on the production of films and television.</p> <h2>Toys R Us Failure Cast Unfair Shadow on Hasbro</h2> <p>The ~20% decline in Hasbro stock in 2019 following Toys R Us bankruptcy was not merited, as Toys R Us did not primarily close as a result of slowing toy sales. The street believed that the expiration of Toys R Us signaled a major decline in sales of traditional<span class=\"paywall-full-content invisible\"> toys and thought Hasbro would have a difficult time selling its product through the retail channel. Toys R Us largely failed as a result of the debt that Bain Capital layered on during its takeover. Creditors have </span><a href=\"https://www.bloomberg.com/news/articles/2020-03-13/toys-r-us-creditors-sue-directors-and-private-equity-owners\" rel=\"nofollow\" class=\"paywall-full-content invisible\">filed a lawsuit</a><span class=\"paywall-full-content invisible\"> against former Toys R Us executives and private equity owners as to how the company was handled prior to bankruptcy. In addition, the timing of the bankruptcy filing prior to the holiday season, combined with the efforts of Amazon, Target, and Walmart to lower prices ultimately proved successful in putting Toys R Us out of business. The positive news for Hasbro is that Amazon, Target, and Walmart have likely picked up the majority of the lost share in the toy market. However, the biggest loss from Toys R Us closures is a reduction in impulse buys based on the wide variety of inventory that Toys R Us previously carried.</span></p> <h2 class=\"paywall-full-content invisible\">Decline of Toy Sales in 2019 not Indicative of Industry Slowdown</h2> <p class=\"paywall-full-content invisible\">Negative growth in 2019 was an anomaly for the toy industry and encouragingly, Hasbro’s key categories were able to weather the storm. The <a href=\"https://www.toyassociation.org/ta/research/data/u-s-sales-data/toys/research-and-data/data/us-sales-data.aspx\" rel=\"nofollow\">decline of toy sales</a> of 4% from 2018 to 2019 is not representative of the industry because Toys R Us’ liquidation sales in <a href=\"https://www.npd.com/wps/portal/npd/us/news/press-releases/2019/the-npd-group-reports-on-us-toy-industry-sales--expectations-through-2021/\" rel=\"nofollow\">2018 distorted growth</a> for that year. The liquidation occurred in the first half of 2018 and relative growth for the first half of 2019 was down 9%; however, the back half of 2019 largely made up for the first half losses. In addition, 2019 had six fewer shopping days between Thanksgiving and Christmas, further skewing the data.</p> <p class=\"paywall-full-content invisible\">An encouraging sign for Hasbro was that the two sub-categories where it over-indexes experienced the fastest growth from 2018 to 2019 relative to all other categories. These categories were action figures &amp; accessories (~10%) and games/puzzles (~0%). Within games/puzzles, Hasbro’s Magic: The Gathering actually contributed positive growth. Prior to coronavirus, projections were positive for 2020 and 2021 according to NPD, the most reputable source of industry data. In addition, U.S. toy sales grew by 5% from 2016 to 2017 and 1% from 2017 to 2018, another signal that the last two years are not representative of industry growth. See below for all segment data from 2018 to 2019.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/4/8/23030683-1586359188886316_origin.png\" rel=\"lightbox\" data-width=\"1412\" data-height=\"844\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/4/8/23030683-1586359188886316.png\" width=\"355\" height=\"213\" data-width=\"640\" data-height=\"383\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></span><em>Source: The NPD Group</em></p> <h2 class=\"paywall-full-content invisible\">Transformers Franchise Represents Blueprint for GI Joe</h2> <p class=\"paywall-full-content invisible\">Hasbro has the company architecture to monetize its strong catalogue of IP across toys, digital gaming, and movies &amp; TV. One of the strongest examples of this monetization is the Transformers brand. In the mid 2000s, Transformers did no generate significant revenue for Hasbro despite high notoriety. In 2007, the first Transformers film generated over $700M. Since 2009, four additional films have been released, <a href=\"https://www.the-numbers.com/movies/franchise/Transformers#tab=summary\" rel=\"nofollow\">generating a total of $4.8B</a> for the entire franchise. These films essentially served as free advertising for Hasbro where it was able to then drive revenue across toy sales and digital gaming in addition to fees collected for licensing out its IP.</p> <p class=\"paywall-full-content invisible\">Hasbro will try to continue to execute this successful blueprint with its 2020 release of Snake Eyes, a reboot of the GI Joe Franchise. The coronavirus should not impact its release given that filming has already been completed. In addition, Snake Eyes is expected to have much stronger success than the past two GI Joe films. GI Joe also is a lifecycle brand where Hasbro can drive revenue throughout a consumer’s life as opposed to only during childhood. Children can buy the action figures when they are young and then follow the movies as they grow. Like Transformers, GI Joe is not generating a tremendous amount of revenue for the company but that is likely to soon change.</p> <h2 class=\"paywall-full-content invisible\">Integration of eOne Provides Diversification</h2> <p class=\"paywall-full-content invisible\">Hasbro’s acquisition of eOne will enable it to be more balanced across toys, digital gaming, and movies &amp; TV. First, eOne offers several strong brands to Hasbro’s portfolio including Peppa Pig, Cupcake &amp; Gino, PJ Masks, and Ricky Zoom. Hasbro will have the opportunity to further monetize the consumer base for these shows. Peppa has already generated 20.3B views on YouTube and currently has 44M subscribers according to management. The street does not appreciate the strength of eOne’s content as well as the ability of Hasbro to monetize the content across toys, digital gaming, and movies &amp; TV. The company stated in its <a href=\"https://investor.hasbro.com/sec-filings/sec-filing/10-k/0001193125-19-052025\" rel=\"nofollow\">recent annual report</a> that “beginning in 2020, we plan to leverage eOne’s production expertise to enhance the Company’s film, television and animated production initiatives.” With the acquisition of eOne, Hasbro becomes a more diversified entity and limits the risk of weakness in traditional toys.</p> <h2 class=\"paywall-full-content invisible\">Growth of Digital Gaming</h2> <p class=\"paywall-full-content invisible\">Hasbro has the opportunity to expand its presence in digital gaming, particularly through its Magic brand. Hasbro already maintains existing relationships with several of the major gaming producers on the market including Electronic Arts, Activision, Scopely, and Ubisoft. Magic is still in the early innings of its IP lifecycle and is likely to be rolled out across PlayStation and Xbox new generation consoles (expected in Q4), driving further meaningful revenue for the successful original card game. Beyond Magic, Hasbro has 7 titles in its pipeline that are expected to launch before 2025 and can leverage the additional content that it acquired from eOne in order to push deeper into gaming.</p> <h2 class=\"paywall-full-content invisible\">Continue to Build on Relationship with Disney</h2> <p class=\"paywall-full-content invisible\">Finally, the Street underappreciates Hasbro’s relationship with Disney because these contracts involve massive upfront payments; however, the relationship is unlikely to expire and represents considerable upside for revenue. Already, Hasbro maintains the rights to create promotional content for Marvel Entertainment (owned by Disney) and Star Wars. The big knock on Hasbro is the massive upfront fee that it pays Disney in order to maintain these rights. Disney will continue to accelerate its content production, including 15 different Marvel releases spread across movies &amp; TV, digital gaming, and toys, as well as additional Star Wars content on Disney+. While the margins on these contracts are dilutive, Hasbro is unlikely to lose these contracts over the next several years given its long-term relationship with Disney and the scale that Hasbro has to manufacture these products. Hasbro may win additional contracts as Disney develops more content over the coming years to increase demand for Disney+. Hasbro is an attractive play on Disney’s forward push into content creation without the large capital costs involved to produce the content itself.</p> <h2 class=\"paywall-full-content invisible\">Valuation</h2> <p class=\"paywall-full-content invisible\">For FY2021, Hasbro can achieve earnings of 5.28 a share and should see P/E multiple appreciation to 20x, leading to a price of $106 per share. Hasbro currently trades on a forward 12 month P/E ratio of 16, in-line with the S&amp;P 500. Since the merger with eOne, Hasbro’s sales mix consists of 40% traditional toys, 30% games &amp; digital gaming, and 30% media and licensing. As Hasbro’s revenue base experiences higher margins from a greater portion of digital gaming and media and licensing revenue, the company should experience multiple expansion.</p> <p class=\"paywall-full-content invisible\">Prior to the March market meltdown, traditional toys traded at ~18x, games &amp; digital games at ~21x, and media &amp; licensing at ~22x. Using a weighted average based on its revenue mix, Hasbro deserved a 20x P/E ratio. Conservatively, by Q4 2021, Hasbro should see this multiple appreciation. Taking into account the societal effects of the coronavirus, the industries that Hasbro operates in are less susceptible to adverse effects relative to most other industries. In fact, social distancing should increase the likelihood of consumers playing video games and board games or watching movies.</p> <p class=\"paywall-full-content invisible\">Based on a revenue build across its five product segments, Hasbro should achieve revenue of $6.6B in 2021. According to NPD, the toy industry declined ~4% in 2019 and Hasbro experienced a decline of ~9% in its franchise brands (traditional games &amp; toys). Based on an expected steeper decline in 2020, Hasbro should experience another decline of ~9% and a modest rebound in 2021. Partner brands should be able to achieve mid double digit growth given the amount of content that Disney is expected to unveil over the next two years (Mulan, Marvel, Star Wars, etc.). Hasbro gaming, which largely consists of Wizards of the Coast (Magic and Dungeons &amp; Dragons) accounts for the largest individual segment of gaming and has experienced growth as high as 20% in recent years. Hasbro’s emphasis on this segment, combined with the ability to utilize eOne content, should lead to similar growth for the segment as a whole.</p> <p class=\"paywall-full-content invisible\">Emerging Brands should remain stable with 2% growth largely driven by its recent acquisition of Power Rangers. Finally, Hasbro can materially drive growth in eOne as it continues to monetize the strong digital content that it now controls including a rollout of more content across multiple platforms (Netflix, Hulu, traditional cable, etc.). Mid double digit growth appears achievable. Holding margins constant, Hasbro has the opportunity to achieve earnings per share of $5.28 in 2021.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/4/8/23030683-15863591909983897_origin.png\" rel=\"lightbox\" data-width=\"2428\" data-height=\"1060\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/4/8/23030683-15863591909983897.png\" width=\"470\" height=\"206\" data-width=\"640\" data-height=\"279\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em>Source: Created by author using data from SEC filings</em></p> <p class=\"paywall-full-content invisible\">Based on this earnings estimate, combined with anticipated P/E multiple appreciation to 20x, Hasbro merits a $106 price target. Also, Hasbro has commented that it is unlikely to reduce its dividend given stable cash flows. With dividends of $0.68 a share for the next 8 quarters, combined with a price target of $106, shareholders could achieve a total return of ~50% over the next two years.</p> <h2 class=\"paywall-full-content invisible\">Risks</h2> <p class=\"paywall-full-content invisible\">The largest risk for Hasbro is a shift away from traditional toys to digital toys. While traditional toys and board games may experience continued negative growth, Hasbro’s portfolio is positioned to succeed in the coming decade. In 2019, seven of the top 10 growing toy entities were content-affiliated brands, according to NPD. Children seek physical toys that are associated with a story that plays out in digital formats. The ability to use IP across both digital and physical platforms allows Hasbro to extend the lifecycle and maximize the franchise value of its brands. Hasbro is well diversified across physical and digital platforms since its eOne acquisition, limiting the risk of a shift away from physical toys (if it takes place).</p> <h2 class=\"paywall-full-content invisible\">Catalysts and Forward Looking Thoughts</h2> <p class=\"paywall-full-content invisible\">The catalyst for price appreciation will come when Hasbro reports much stronger than expected Q4 2021 earnings as its ability to integrate eOne into the overall company architecture becomes evident. The market should appreciate Hasbro as a more diversified entity encompassing digital gaming and movie &amp; television entertainment. In addition, the street will recognize Hasbro’s ability to repeat its Transformers playbook with GI Joe when the film is released this year.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Again, given that the share price has rebounded in the last three weeks, investors should wait till Q2 2020 earnings are reported before investing. Hasbro is likely to report earnings in line or below expectations for Q2 given the lack of in-store shopping. Even if e-commerce sales soar, this segment only accounts for ~20% of Hasbro sales. Hasbro is likely to face a sharper downside in the coming months than potential upside. Hasbro has only a 3% short interest, which speaks to rampant investor optimism. A tilt in the opposite direction may take place, leading to a greater investment opportunity.</p>", "twitContent": "$HAS - Hasbro Diversified For Future Success. https://seekingalpha.com/article/4336757-hasbro-diversified-for-future-success?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104918", "type": "author"}}, "sentiments": {"data": [{"id": "268273", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "86", "type": "tag"}]}, "otherTags": {"data": [{"id": "586260", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4336757-hasbro-diversified-for-future-success", "canonical": "https://seekingalpha.com/article/4336757-hasbro-diversified-for-future-success", "uriImage": "https://static.seekingalpha.com/uploads/2020/4/8/23030683-1586359188886316_origin.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2020/4/8/23030683-1586359188886316_origin.png"}}}, "included": [{"id": "104918", "type": "author", "attributes": {"company": null, "slug": "harrison-liftman", "userId": 23030683, "tagId": 586260, "bio": "Long term value investor<br>", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/023/030/683/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/023/030/683/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/023/030/683/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/023/030/683/extra_large_pic.png"}, "nick": "Harrison Liftman", "deactivated": null, "memberSince": 2014, "isRss": false, "contributorSince": 2018, "followersCount": 18}, "relationships": {"user": {"data": {"id": "23030683", "type": "user"}}, "userBioTags": {"data": [{"id": "951495", "type": "userBioTag"}, {"id": "951496", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/harrison-liftman", "profileUrl": "/author/harrison-liftman", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "86", "type": "tag", "attributes": {"slug": "dis", "name": "DIS", "company": "The Walt Disney Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/DIS"}}, {"id": "586260", "type": "tag", "attributes": {"slug": "harrison-liftman", "name": "Harrison Liftman", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/harrison-liftman"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "268273", "type": "sentiment", "attributes": {"articleId": 4336757, "type": "bullish", "createdAt": "2020-04-08T18:00:55.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4336757", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}