{"data": {"id": "4351131", "type": "fullArticle", "attributes": {"publishOn": "2020-05-31T10:58:09-04:00", "isLockedPro": false, "commentCount": 13, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"steven-mallas": {"id": 490846, "slug": "steven-mallas", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro: Potential Buy On Dips Before Holidays", "summary": ["Hasbro remains in the game, even in the face of the CoV-2 crisis: it is carefully evaluating supply chains and maintaining liquidity. It is also delivering cash flow.\n        ", "eOne may be negatively affecting the numbers at the moment, but if management exploits the asset properly, it will add value over time and will help Hasbro expand into Hollywood.\n        ", "I anticipate the company will see increased demand for its products as consumers look forward to the fall holiday season to balance out the negative aspects of the CoV-2 situation.\n        ", "The stock seems to be expensive right now, so long-term investors should buy opportunistically.\n        "], "structuredInsights": null, "isPaywalled": false, "lastModified": "2022-06-12T08:58:57-04:00", "isModerated": false, "closestTradingDate": "2020-06-01", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 1, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long DIS, LGF.A, LGF.B.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I may initiate a long position in HAS over the next 72 hours.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Here's the thing about Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>): it released its quarterly results recently, and as one might expect, the numbers aren't so important, considering that the SARS-CoV-2 crisis has thrown everything off-kilter. </p> <p>However, there is a story to Hasbro, a high-concept one: the company should bounce back not only over the long term but even on a shorter-term scale. When the holidays arrive in the fall/winter period, consumers and their children will be happily consuming the company's products as this will be the first Christmas season under the dark auspices of an infectious agent. </p> <p>That should translate to a rise in the stock, in theory at least. One would assume the company will do well in terms of earnings potential when it reports those upcoming holiday stats.</p> <p>I'll be taking a brief look at the quarter and will size up the current strategy (with Entertainment One a focus). In many ways, Hasbro is a supply-chain story right now, as evidenced by the press release for the first quarter. But it's also a collection of popular brands/IP, and a burgeoning media company. There's a lot to like here. </p> <h2>The First Quarter</h2> <p>The company reported these numbers a month ago, and management clearly wants to communicate its confidence as the global community continues to combat the Covid-19 curve. The first thing shareholders should know is that the company has $1.2 billion on the balance sheet (driven in large part by debt, but still, at this time, it's good to know it was there at the date of the report). Then there is the ability to use a significant line of credit of $1.5 billion, which is attached to a revolving facility.</p> <p>As for quarterly cash flow, Hasbro did pretty well. It generated a little over $290 million from operations against $265 million last year at this time. Capital<span class=\"paywall-full-content invisible\"> spending was $31 million versus $25 million, so the over $90 million paid out to shareholders for dividends was comfortably achieved. </span></p> <p class=\"paywall-full-content invisible\">Although the company increased its top line to $1.1 billion from over $730 million, it reported a net loss of $0.51 per diluted share against a profit of $0.21 per diluted share. Acquisition costs were to blame, as they came in at about $150 million. Adjusted income was $0.57 per diluted share versus $0.76 per diluted share. That's a significant drop, but it did best Wall Street's expectations by the proverbial penny. </p> <p class=\"paywall-full-content invisible\">I mentioned the supply chain in my introduction, and it is indeed a relevant point. Hasbro is a company that depends on efficiency to maintain as strong a margin as it can, because it both makes and distributes plastic as its core business. I believe the company will increasingly trend toward storytelling as a main driver of value, not unlike Disney's (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>) Marvel, the latter of which is mostly dependent on filmed-entertainment and not so much on its publishing side (publishing was obviously more important in the earlier stages of the comic-book concern's corporate existence). Until it reaches a critical mass with original content, management must still keep an eye on balancing toy budgets and supply-chain costs. Thus, the press release highlights how its distribution chain is faring during CoV-2. In China, the company seems to be doing reasonably well, judging by the summary of the current status quo; in the States, it's a different matter, as the company, by my read, seems to be playing catch-up because of all the safety restrictions. Shareholders will just have to ride that out, and it probably will be most noticeable if the company scores a hot-toy item for the holidays (odds are, it will have strong demand for a few items as is always the case during Christmas, if not the realization of a total all-out fad product). There is risk to the distribution physics, but for now, I'm going to assume management will work it out. </p> <p class=\"paywall-full-content invisible\">I'll move on to Entertainment One, as this recent purchase is the part of the company that should, over time, generate the most excitement (if the company plays its cards correctly). eOne certainly isn't generating much excitement at the moment. The segment experienced a loss of $33 million on a reported basis; on an adjusted basis, it yielded a profit of $70 million, which represented a 50% decline compared to the previous year's adjusted income. </p> <p class=\"paywall-full-content invisible\">As CEO Brian Goldner mentioned during the <a href=\"https://seekingalpha.com/article/4341046-hasbro-inc-ceo-brian-goldner-on-q1-2020-results-earnings-call-transcript\">conference call</a>, this is the initial three-month period with eOne attached. As such, everything is new, and it will take a while to ramp up the strategy. The first bit of business to take care of, which one might expect, was the issue of cost-synergy-identification. Goldner said $130 million in savings could be booked by 2022. He also highlighted some of the IP success that the acquisition brings to the table, such as <em>Peppa</em> <em>Pig</em> merchandise and the Netflix series based on <em>PJ Masks</em>. </p> <p class=\"paywall-full-content invisible\">Over the next several months, it will be difficult for the studio to complete content projects as Hollywood is now trying to figure out how to go about a new-normal production paradigm. The CEO was upfront about this during the question-and-answer session, and it became clear that delivery of filmed-entertainment will be delayed, thus likewise delaying eOne's short-term financial potential. He did say that the studio had over 100 projects in development, with 15% being dedicated to Hasbro-branded material. (I'd like to see that percentage upped as soon as possible.) The <a href=\"https://seekingalpha.com/article/4341019-hasbro-inc-2020-q1-results-earnings-call-presentation\">slide deck</a> mentioned that Hasbro's Allspark unit was integrated into eOne, which is what one would expect in terms of exploiting the new acquisition.</p> <p class=\"paywall-full-content invisible\">Hasbro will certainly lean on this new unit to continue its infiltration into the Hollywood business model. If it can ramp up quickly, it can then begin to look for more consolidation opportunities. Hasbro will need to prove to its board that it knows what it's doing with eOne; if successful, it can look to other prime assets for content. While I am bullish on the studio segment, I can also say it is regrettable that something like DreamWorks Animation and Lions Gate Entertainment (<a href=\"https://seekingalpha.com/symbol/LGF.A\" title=\"Lions Gate Entertainment Corp.\">LGF.A</a>) (<a href=\"https://seekingalpha.com/symbol/LGF.B\" title=\"Lions Gate Entertainment Corp.\">LGF.B</a>) <a href=\"https://variety.com/2017/film/news/hasbro-calls-off-talks-to-buy-lionsgate-1202514255/\" rel=\"nofollow\">got away</a>. </p> <p class=\"paywall-full-content invisible\">I suppose, too, that Hasbro could find itself being chased as an acquisition target itself. Back in October, Mike Berner proposed such <a href=\"https://seekingalpha.com/article/4297180-media-company-buy-hasbro-future-of-iconic-toymaker\">a thesis</a>. He mused on a couple of examples in the big-media space, such as Disney or Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a>) perhaps one day being interested in the toy giant. Normally I don't look to Hasbro as a good fit for either, but I concede that, as the digital/streaming era progresses, and as non-media companies look to be media companies and media companies look for scale in all kinds of business lines (including merchandising), I'm learning that anything is possible (as long as banks are willing to line up the debt and there are available investors for that debt). It's simply another bullet point to consider with Hasbro. </p> <p class=\"paywall-full-content invisible\">Beyond eOne, the company's brands, in an overall sense, are performing well given the target demos are staying home and in need of distraction via entertainment. The gaming segment was up 30% in revenue sales. Emerging brands did take a significant drop of 19%, while the filmed-entertainment segment declined 29%. In both cases, the addition of eOne helped to drive the poor performance, so don't focus on that too much right now, as the asset will hopefully be additive over time. </p> <h2 class=\"paywall-full-content invisible\">Hasbro: A Long-Term Buy</h2> <p class=\"paywall-full-content invisible\">Hasbro is definitely a long-term buy, but there is a lot of uncertainty in the closer term. Over the next year, the virus crisis is sure to cause volatility, and I would imagine there are better prices to be had in the near future than current levels (as of this writing, around $73). So buying on dips would be a good strategy. </p> <p class=\"paywall-full-content invisible\">But there's also the fall/Christmas season to consider. My feeling is that Hasbro shares will start to trend higher as people look to maximize celebration of the holidays after all of the disruption caused by CoV-2. Either way, Hasbro has the goods to create a long-term media business funded by cash flows derived from core merchandise models that can then act in synergy with each other. In other words, Hasbro is set to transform itself into a company that is ready to tackle the digital age and beyond. </p> <p class=\"paywall-full-content invisible\">The stock has a nice dividend yield of 3.7% (as I write this), but quite frankly, it's difficult to have confidence in many dividends right now. If the company needs to conserve cash quickly because of a bad turn in the pandemic (e.g., multiple waves of outbreaks), then today's yield may not mean much. Still, the yield is worth noting (management has stated confidence in the payout), and there are other ways for the company to conserve cash. On the other hand, the stock is considered expensive by the SA value system. These are considerations to take seriously, which is why opportunistic buying is a must, even if the stock suddenly grabs a momentum run.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Again, though, this iconic toy company is a buy for long-term portfolios. Just keep in mind the risks of current volatility trends. Hasbro will identify many opportunities for growth once an effective vaccine is easily obtainable, especially on the eOne side. This is a stock/company to watch, at the very least. </p>", "twitContent": "$HAS - Hasbro: Potential Buy On Dips Before Holidays. https://seekingalpha.com/article/4351131-hasbro-potential-buy-on-dips-holidays?source=tweet ", "innerMarketing": "", "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "82146", "type": "author"}}, "sentiments": {"data": [{"id": "277818", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "490846", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4351131-hasbro-potential-buy-on-dips-holidays", "canonical": "https://seekingalpha.com/article/4351131-hasbro-potential-buy-on-dips-holidays", "uriImage": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png", "schemaImage": null}}, "included": [{"id": "82146", "type": "author", "attributes": {"company": null, "slug": "steven-mallas", "userId": 393777, "tagId": 490846, "bio": "I have previously written articles for The Motley Fool, TheStreet, and AOLs BloggingStocks.I also write fiction. I have stories published at Nikki Finke's Hollywood Dementia site, including \"The Streaming Service,\" \"The Screenwriterman,\" \"Mygalomorph\" and \"Spielberg's Last Film.\"<p><br></p><p>Here is a link to my YA book, \"<a href=\"https://www.amazon.com/Abner-Wilcox-Thornberry-Witch-Street-ebook/dp/B0180MHEOE\">Abner Wilcox Thornberry and The Witch of Wall Street</a>.\"</p><p><br></p><p>This is a collection of short horror stories: <a href=\"https://www.amazon.com/Tales-Salem-Massachusetts-Steven-Mallas-ebook/dp/B016D29INI\">Tales From Salem, Mass.</a><br><br></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/000/393/777/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/000/393/777/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/000/393/777/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/000/393/777/extra_large_pic.png"}, "nick": "Steven Mallas", "deactivated": null, "memberSince": 2009, "isRss": false, "contributorSince": 2015, "followersCount": 1846}, "relationships": {"user": {"data": {"id": "393777", "type": "user"}}, "userBioTags": {"data": [{"id": "526126", "type": "userBioTag"}, {"id": "526136", "type": "userBioTag"}, {"id": "526146", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/steven-mallas", "profileUrl": "/author/steven-mallas", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "490846", "type": "tag", "attributes": {"slug": "steven-mallas", "name": "Steven Mallas", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/steven-mallas"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "277818", "type": "sentiment", "attributes": {"articleId": 4351131, "type": "bullish", "createdAt": "2020-05-31T10:58:09.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4351131", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}