{"data": {"id": "4355656", "type": "fullArticle", "attributes": {"publishOn": "2020-06-25T12:32:17-04:00", "isLockedPro": false, "commentCount": 10, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"patrick-doyle": {"id": 578431, "slug": "patrick-doyle", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro Inc. Is A Buy", "summary": ["I think Hasbro Inc. is a great company with a rock solid dividend. In spite of slight overvaluation, I'm buying because of the generous dividend yield.", "I think it's possible to lower the acquisition cost somewhat by selling fairly deep out of the money put options.", "This company has been a slow growth cash cow for years, but the Entertainment One acquisition may kick things up a notch."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2020-06-25T13:25:33-04:00", "isModerated": false, "closestTradingDate": "2020-06-25", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 2, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, but may initiate a long position in HAS over the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I&#39;ll be buying some shares and selling 10 of the puts described in this article today.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>I think it's a good idea to get somewhat embarrassing confessions out of the way up front. I started playing Dungeons and Dragons in the early 1980s and have played intermittently ever since. There. I said it. It's out there now. There's nothing embarrassing about being an \"adult\" man who plays this game. Nothing to be ashamed of. I'm fine with it. Really. I like the game, though I'll admit that there are problems with it. Why, for instance, can magic users cast spells perfectly every time, even in the heat of a combat encounter, when concentration might be compromised?! For those few of you out there who don't play this game, ask yourselves if you could recite a 15 line poem you've just recently memorized while being attacked by wolves? Didn't think so. Why then do magic users of all stripes cast spells perfectly every time in all circumstances? Don't even get me started on the problem of feats...</p> <p>Sorry to disappoint you, dear reader, but this isn't actually an article about the world's most popular role playing game. It's an article about the company that publishes that game, Hasbro Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>). In this article, I want to review the company for the first time, and try to determine whether some of the capital I've recently freed up should go to work in this name. I'll try to make that determination by looking at the company and the stock as a thing distinct from it. As is often the case, I'll also recommend a short put for those who may be nervous about buying at current levels.</p> <p>There may be some of you dear readers who worry that this article might have even more nerd references in it. To those people, I'll say definitively that it does. In order to save you<span class=\"paywall-full-content invisible\"> from a horrible fate of reading about my half elf wizard or the Drow infested UnderDark, I'll leap right to the conclusion here. I think these shares are slightly overpriced at the moment, and I think investors who buy in should do so knowing that they may experience some volatility. These people should be comforted somewhat by the dividend, which is very sustainable in my view. It's also possible to generate very decent premia by selling relatively deep out of the money put options. For my part, I'll be both buying shares and selling puts.</span></p> <h2 class=\"paywall-full-content invisible\">Financial Snapshot</h2> <p class=\"paywall-full-content invisible\">I think it's fair to suggest that Hasbro is a financial \"cash cow\", in that it's experienced quite modest growth over the past several years. In particular, since 2015 sales have grown at a CAGR of about 1.2%, while net income has grown at a CAGR of 3%, and EPS at a CAGR of about 2.6%. At the same time, the company has grown dividends per share at a CAGR of about 8% over the same time period. The first quarter of 2020 saw an increase in revenue of about 51% relative to the same period a year ago, and a swing from positive earnings of ~$27 million to a GAAP loss of about $70 million. This collapse in net income was caused by a $150 million expense associated with acquisition and related costs, which brings up the Entertainment One Ltd. (eOne) acquisition. At the end of December 2019. Hasbro paid $4.6 billion for this company, and financed it with $3.8 billion of cash. Fully $2.4 billion of this cash was generated by issuing unsecured notes, taking on ~$1 billion in term loans, and issuing an additional 10,952,106 shares at $95 each. More about eOne can be found on page 4 of Hasbro's latest 10-K. Some market participants reacted very favorably to this <a href=\"https://seekingalpha.com/news/3561327-hasbro-investors-get-film-studio-for-free-berenberg\">deal</a>, and I think it will be accretive given that eOne had annual revenues of about $1.16 billion in <a href=\"https://en.wikipedia.org/wiki/Entertainment_One\" rel=\"nofollow\">2019</a>.</p> <p class=\"paywall-full-content invisible\">It's not all magic rings guarded by low hit point orcs over at Hasbro, though. Long term debt has grown at an eye watering CAGR of 25% over the past five years. In fairness though, over the same time period, net interest expense has declined at a CAGR of about 5.25%. This is obviously a function of the fact that the weighted average interest on debt has declined. The debt level does give me pause, though, because of its potential impact on dividends. I think high debt levels, and dividend growth at 8% in the context of EPS growth of 2.6% is as unsustainable as a first level party fighting a Beholder in its lair (sorry...that was the last D&amp;D reference). At some point, either dividend growth must slow, or EPS growth must rise. I am interested to know if dividend growth is about to slow, as I think that has obvious implications for stock prices, and I'll try to answer that question by looking at dividend sustainability in general.</p> <h2 class=\"paywall-full-content invisible\">Dividend Sustainability</h2> <p class=\"paywall-full-content invisible\">I make a determination about the sustainability of a dividend by looking at the size and timing of future obligations against current and likely future cash resources. While I'm as much of a fan of accrual accounting as any fully human person can be, when it comes to dividends and their sustainability, it's all about cash. So, I'll first present the future obligations in the following table that I've compiled for your reading pleasure. Please note that the purpose of this exercise is not to work out what must be paid when to two decimal places of precision. I present the following table in order to understand which of the next few years will be the most onerous for the firm. I should also say that CAPEX is somewhat of a moving target. The company offered 2020 capex guidance of between $160 and $170 million on page 55 of the latest 10-K, and I chose the midpoint of this figure for my calculations. It's clear from the following that 2021 and 2024 will be most burdensome for the company. It should also be noted that most of the debt has long due dates.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/6/25/saupload_bHe8NDS9JLmuzMXDweStos_P1c16GEARjeHW7-F60_OwbJ83qjSlNF7fmFo3GGYn4oZhB73LOkEfAsiQZPLVqFYHhoTYZGQgAVZpXmF3Pn80m2lzUMbgp83j3qRSfJqoNADnJTsv.png\" rel=\"lightbox\" data-width=\"654\" data-height=\"153\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2020/6/25/saupload_bHe8NDS9JLmuzMXDweStos_P1c16GEARjeHW7-F60_OwbJ83qjSlNF7fmFo3GGYn4oZhB73LOkEfAsiQZPLVqFYHhoTYZGQgAVZpXmF3Pn80m2lzUMbgp83j3qRSfJqoNADnJTsv_thumb1.png\" data-width=\"640\" data-height=\"150\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\" fetchpriority=\"high\"></a></span></p> <p class=\"paywall-full-content invisible\">Source: Latest <a href=\"https://investor.hasbro.com/node/31781/html#s65F1D2C92348578CA163B3ABB0F14BC3\" rel=\"nofollow\">10-K</a></p> <p class=\"paywall-full-content invisible\">Against these upcoming obligations, the company has non-restricted cash on hand of ~$1.15 billion (it also has $86 million of restricted cash). In other words, the company has enough cash to cover the next two years of its outflows and still have $244 million left over. Also, the company has generated an average of $674 million cash from operations over the past three years. To sum up, I think this is a great cash cow with a well covered dividend. I don't like the fact that debt levels have ballooned, but I'm impressed by the fact that interest expense has actually declined. I think there's little risk of a dividend cut here anytime soon and thus, I'd certainly be happy to buy these future dividends at the right price.<span><a href=\"https://static.seekingalpha.com/uploads/2020/6/25/saupload_QWZxmJ6Ghny0ICBvo_Mr2KZKxOVErXUaSTpRwCEJ2MLJPJ-2ww72UgLE8gvavJ0-7tVDpEAhf3c986KTsPhlzOLDzXsDP4E7usrHqYOa-JTakUKDAeIXHAGz_rMsmF_PwZiIIHM_.png\" rel=\"lightbox\" data-width=\"752\" data-height=\"445\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/6/25/saupload_QWZxmJ6Ghny0ICBvo_Mr2KZKxOVErXUaSTpRwCEJ2MLJPJ-2ww72UgLE8gvavJ0-7tVDpEAhf3c986KTsPhlzOLDzXsDP4E7usrHqYOa-JTakUKDAeIXHAGz_rMsmF_PwZiIIHM__thumb1.png\" data-width=\"640\" data-height=\"379\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Source: Company filings</p> <h2 class=\"paywall-full-content invisible\">Four Very Important Words: At the Right Price</h2> <p class=\"paywall-full-content invisible\">Welcome to the portion of the article where I desperately try to cover up my inevitable repetition with a new twist on a very old idea. A great company can be a mediocre investment if the investor overpays for it. A mediocre company can be a great investment if the investor can buy it at a decent price. In other words, the stock is a thing distinct from the underlying company, and the price paid for the stock in large measure determines future returns on that stock. Thus, before deciding whether or not to buy these future dividends, we need to make sure we're not being asked to pay a ridiculous price. I judge whether the shares are reasonably (i.e. cheaply) priced in a couple of ways, ranging from the simple to the more complex. On the simple side, I look at the ratio of price to some measure of economic value like earnings, free cash flow and the like. In particular, I want to see the company trading at a ratio below both the overall market and its own history. On that basis, Hasbro seems to be trading near the lower end of its historical price to free cash flow per the following:</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\" data-id=\"null\" data-name=\"null\"><img src=\"https://static.seekingalpha.com/uploads/2020/6/25/saupload_bfbb63f410da1585d88aacceb31cafd0.png\" class=\"sa-ycharts-img\" alt=\"Chart\" data-width=\"635\" data-height=\"366\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></figure></p> <p class=\"paywall-full-content invisible\">Source: YCharts</p> <p class=\"paywall-full-content invisible\">In addition, I want to try to understand the assumptions that are currently embedded in price. In order to do this, I turn to the work described by Professor Stephen Penman in his book \"Accounting for Value.\" In this book, Penman walks investors through how they can isolate the \"g\" (growth) variable in a standard finance formula to work out what the market must be assuming about the future for a given company. Applying this methodology to Hasbro at the moment suggests that the market is forecasting a long term (i.e. perpetual) growth rate of ~5.7%. I consider this to be a somewhat optimistic forecast, given the history of more staid 3% growth, and for that reason, I consider the shares to be modestly overpriced at the moment.</p> <h2 class=\"paywall-full-content invisible\">Puts to the Rescue</h2> <p class=\"paywall-full-content invisible\">I think this is a very profitable business at the moment, and I think the dividend is very well covered. That said, I think the shares may be slightly overpriced. This puts me on the horns of a dilemma. On the one hand I can wait for shares to drop to a more reasonable price before buying. This approach has several problems associated with it. First, it's boring to wait, and now that you know that I play a game that involves trying to mimic a fantastical world using statistics, you know I can't tolerate boredom. Second, if the shares drop suddenly in price, I may not pull the trigger because the drop will likely be caused by some very bad news. This is the problem with the platitude that investors should \"buy low.\" It's easy to tell people that they should do that, and it's easy to abuse hindsight bias and point out that history tells us that it makes sense to buy when assets are depressed in price, because they subsequently mean revert upwards. This \"just buy low\" platitude does an injustice to people because it implies that people can wave away the very real concerns that correspond to rapid price drops. \"Just buy low\" suggests that people should just ignore those factors that drive the market lower, and buy at a time when most people would tell you that you're crazy for doing so.</p> <p class=\"paywall-full-content invisible\">Part of the reason that short put options are helpful is that they force the investor to determine a price that they would be willing to buy a given company. They force the investor to do this in a relatively \"cold\" state, where the investor's decision making processes aren't impacted by mania or panic. If the market swoons, the investor can take some solace in the knowledge that if they're obliged to buy, they'll be doing so at a price that they already determined is a good one.</p> <p class=\"paywall-full-content invisible\">With all of that in mind, I'd recommend selling the January 2021 put with a strike of $50. These are currently bid-asked at $3.10-$3.70. If the investor simply takes the bid on these puts, and is subsequently exercised, they will be obliged to buy at a price about 33% below the current level. Holding all else constant, at that price, the shares will be priced to yield about 5.7%. Given that I think the dividend is well covered, that is a reasonable proposition in my view. If the shares remain above $50 over the next six months, the investor simply pockets the premia, and that is never a hardship. This is why I refer to short put options as \"win-win\" trades.</p> <p class=\"paywall-full-content invisible\">It's that time again, dear reader, when I pour cold water all over the excitement resulting from thoughts of a well covered 5.7% dividend yield by talking about risk. Investing, like life, involves making choices among a host of imperfect trade-offs. There is no 'risk-free' option, and short puts are no different in this regard. We do our best to navigate the world by exchanging one pair of risk-reward trade-offs for another. For example, holding cash presents the risk of erosion of purchasing power via inflation and the reward of preserving capital at times of extreme volatility. Unless you are incredibly new to this, the risk-reward trade-off of buying shares is self-evident, especially in 2020.</p> <p class=\"paywall-full-content invisible\">I think the risks of put options are very similar to those associated with a long stock position. If the shares drop in price, the stockholder loses money, and the short put writer may be obliged to buy the stock. Thus, both long stock and short put investors typically want to see higher stock prices.</p> <p class=\"paywall-full-content invisible\">Puts are distinct from stocks in that some put writers don't want to actually buy the stock; they simply want to collect premia. Such investors care more about maximizing their income and will, therefore, be less discriminating about which stock they sell puts on. These people don't want to own the underlying security. I like my sleep far too much to play short puts in this way. I'm only willing to sell puts on companies I'm willing to buy at prices I'm willing to pay. For that reason, being exercised isn't the hardship for me that it might be for many other put writers. My advice is that if you are considering this strategy yourself, you would be wise to only ever write puts on companies you'd be happy to own.</p> <p class=\"paywall-full-content invisible\">In my view, put writers take on risk, but they take on less risk (sometimes significantly less risk) than stock buyers in a critical way. Short put writers generate income simply for taking on the obligation to buy a business that they like at a price that they find attractive. This circumstance is objectively better than simply taking the prevailing market price. This is why I consider the risks of selling puts on a given day to be far lower than the risks associated with simply buying the stock on that day.</p> <p class=\"paywall-full-content invisible\">I'll conclude this short discussion of risks by indulging my tendency to belabor a point. I'll use the trade I'm currently recommending as an example. An investor can choose to buy Hasbro today at a price of ~$70. Alternatively, they can generate a credit for their accounts immediately by selling put options that oblige them - under the worst possible circumstance - to buy the shares at a net price 33% below today's level. Buying the same asset for a one-third discount is the definition of lower risk, in my view.</p> <h2 class=\"paywall-full-content invisible\">Conclusion</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">I think Hasbro is a wonderful business with a sustainable dividend. In addition, I think the recent acquisition will be accretive and I think growth rates may start to pick up in future. I think the shares are anticipating some of this future growth and as a result are (only slightly) overpriced. Thankfully, the options market presents an alternative to outright buying at current levels. I think there are a few good ways forward for investors. If they buy the shares there may be some chop, but investors can feel confident that the generous yield will be maintained and may grow. If they sell the puts described above, they'll generate a \"win-win\" trade. If they do some combination of these, they can lower their average cost while generating decent premia immediately.</p>", "twitContent": "$HAS - Hasbro Inc. Is A Buy. https://seekingalpha.com/article/4355656-hasbro-inc-is-buy?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104099", "type": "author"}}, "sentiments": {"data": [{"id": "281460", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "578431", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4355656-hasbro-inc-is-buy", "canonical": "https://seekingalpha.com/article/4355656-hasbro-inc-is-buy", "uriImage": "https://static.seekingalpha.com/uploads/2020/6/25/saupload_bHe8NDS9JLmuzMXDweStos_P1c16GEARjeHW7-F60_OwbJ83qjSlNF7fmFo3GGYn4oZhB73LOkEfAsiQZPLVqFYHhoTYZGQgAVZpXmF3Pn80m2lzUMbgp83j3qRSfJqoNADnJTsv.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2020/6/25/saupload_bHe8NDS9JLmuzMXDweStos_P1c16GEARjeHW7-F60_OwbJ83qjSlNF7fmFo3GGYn4oZhB73LOkEfAsiQZPLVqFYHhoTYZGQgAVZpXmF3Pn80m2lzUMbgp83j3qRSfJqoNADnJTsv.png"}}}, "included": [{"id": "104099", "type": "author", "attributes": {"company": null, "slug": "patrick-doyle", "userId": 48515253, "tagId": 578431, "bio": "<p>I'm a quant investment newsletter writer who marries fundamental analysis with the latest research in momentum. Over the past few years, I’ve developed a piece of software that helps me track the level of optimism and pessimism embedded in stock price. I seek to challenge the assumptions embedded in price by profitably exploiting the disconnect between what the market thinks and what is a likely outcome. I invest in those companies that have a greater than average chance of giving us all a surprise in the next few months. </p><p><br></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/048/515/253/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/048/515/253/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/048/515/253/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/048/515/253/extra_large_pic.png"}, "nick": "Patrick Doyle", "deactivated": null, "memberSince": 2017, "isRss": false, "contributorSince": 2018, "followersCount": 7175}, "relationships": {"user": {"data": {"id": "48515253", "type": "user"}}, "userBioTags": {"data": [{"id": "927945", "type": "userBioTag"}, {"id": "927946", "type": "userBioTag"}, {"id": "927947", "type": "userBioTag"}, {"id": "927948", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/patrick-doyle", "profileUrl": "/author/patrick-doyle", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "578431", "type": "tag", "attributes": {"slug": "patrick-doyle", "name": "Patrick Doyle", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/patrick-doyle"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "281460", "type": "sentiment", "attributes": {"articleId": 4355656, "type": "bullish", "createdAt": "2020-06-25T12:32:17.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4355656", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}