{"data": {"id": "4249838", "type": "fullArticle", "attributes": {"publishOn": "2019-03-19T16:59:36-04:00", "isLockedPro": false, "commentCount": 4, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"dividend-diplomats": {"id": 458445, "slug": "dividend-diplomats", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro, Inc.: Why I'm Optimistic About The Company, But Still Not Buying Shares", "summary": ["Hasbro's revenues and earnings decreased in 2018 compared to previous years.", "The company's 2018 revenues/earnings were negatively impacted by two large items (Toys\"R\"Us liquidation and Backflip Impairment) that should not have as large of an impact on earnings going forward.", "The company expects a rebound 2019 and 2020 due to strategic shifts and a strong production lineup from licensing.", "The company has increased their dividend for 10 consecutive years and announced a 7.94% dividend increase in February 2019.", "The company is not trading at a discount to the market based on the calculated P/E ratio."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2019-03-19T16:59:36-04:00", "isModerated": false, "closestTradingDate": "2019-03-20", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 6, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Hasbro, Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) has touched all of our lives in some capacity over the years. Either as a child, parent, or grandparent, some child we love and ran around the house or become obsessed with one of the movies/shows that Hasbro licenses. Hasbro had a very interesting earnings release and investor presentation in February 2019, discussing the results after the closure of Toys 'R Us in 2018. Today, I wanted to take a look at the company's 2018 results and 2019 forecasts to determine if Hasbro is a fit for my portfolio.</p> <p>Of course, since I am a Dividend Growth Investor, I will also run Hasbro through our stock screener to determine if the company is a buy. Since our stock screener focuses on identifying undervalued dividend growth stocks, we will consider this in our final purchase decision as well. Hasbro appears to not be undervalued at the moment. But let's have the numbers tell the final picture. Time to dive in.</p> <p>The company's <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-reports-full-year-and-fourth-quarter-2018-financial\" rel=\"nofollow\">earnings release filed on February 8, 2019,</a> has great information inside of it. I will use a lot of the information within the earnings release in the following section, along with pulling other information in from the company's <a href=\"https://investor.hasbro.com/static-files/8dc080cb-70e3-4a4d-b351-658e9bafe783\" rel=\"nofollow\">Investor Fact sheet</a>, the <a href=\"https://investor.hasbro.com/static-files/9c0eec53-3887-49ed-a1d4-3f56b4257bd2\" rel=\"nofollow\">earnings release presentation slides</a>, and the <a href=\"https://investor.hasbro.com/static-files/391f0346-70d3-4be1-861f-826901fcc484\" rel=\"nofollow\">prepared remarks from management</a>.</p> <h2>2018 Earnings Review</h2> <p>Let's start with the 2018 results before looking ahead to 2019. 2018 revenues decreased 12% compared to the prior year. Further, diluted EPS decreased to $1.74/share compared to $2.33/share in the prior years. Those are the GAAP numbers, which are audited figures. This does not include \"adjustments\" made by management. Comparing adjusted numbers each year can be tricky, because the adjustments can be different each year. Management is required to show a reconciliation from diluted EPS to adjusted earnings, though. This reconciliation is very helpful in assessing what potential items impacted the company's earnings in the year.</p> <p class=\"paywall-full-content invisible\">Considering adjustments, Hasbro reported adjusted EPS of $3.85/share in 2018 and $5.46/share in 2017. Even with the adjustments, earnings per share decreased significantly between years. Management provided the attached reconciliation of diluted EPS to adjusted diluted EPS in the image below.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/3/18/27443183-15529223119491491_origin.png\" rel=\"lightbox\" data-width=\"1600\" data-height=\"384\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2019/3/18/27443183-15529223119491491.png\" data-width=\"640\" data-height=\"154\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\" fetchpriority=\"high\"></a></span></p> <p class=\"paywall-full-content invisible\">From this, there are two items I wanted to investigate further. The first is the impact of Toys\"R\"Us and the second is the asset impairments.</p> <p class=\"paywall-full-content invisible\">Prior to the bankruptcy, Toys\"R\"Us was Hasbro's third largest customer. According to management, Hasbro was hit with a \"1-2\" punch from Toys\"R\"Us. Not only did the company lose hundreds of millions of dollars of revenue as a result of the bankruptcy, but it was also impacted by the liquidation of the company's massive inventory. This liquidation resulted in cheaper goods and decreased revenue. To quote management,</p> <blockquote class=\"quote paywall-full-content invisible\"><p>\"was more impactful to 2018 than we, and industry experts, estimated. It is an unprecedented yet finite event.\"</p></blockquote> <p class=\"paywall-full-content invisible\">The impact was huge from a dollar perspective. There is no way around it. Overall, this had a $.42/share impact on the company's net earnings during the year (per the reconciliation above). Despite the fact that this was a one-time event per management, there will likely be some spill-over in 2019. The impact will not be a $.42/share impact, that's for sure. But I wouldn't be shocked to continue seeing this included in the company's adjusted earnings reconciliation each quarter as other retailers continue to sell liquidated merchandise.</p> <p class=\"paywall-full-content invisible\">The second item that jumped out at me was the asset impairment charges. The first question I always ask when I see an asset impairment is... why? The company recorded $96.3m of impairment charges, or $.76/share, as a result of the impairment of Backflip Studios and other intangible assets. The Backflip studio impairment charge was $86.3m, accounting for the majority of the charge recorded. In management's transcript, it was discussed how the company adjusted the long-term plan for Backflip, a mobile gaming platform. This included a change in the structure of the organization, the speed at which products are developed, and working with development partners.</p> <p class=\"paywall-full-content invisible\">The company identified this impairment during their annual goodwill impairment evaluation process. For those that are less familiar with this process, here is the definition of Goodwill per <a href=\"https://www.investopedia.com/terms/g/goodwill.asp\" rel=\"nofollow\">Investopedia</a>:</p> <blockquote class=\"quote paywall-full-content invisible\"><p>\"Goodwill is an intangible asset associated with the purchase of one company by another. Specifically, goodwill is recorded in a situation in which the purchase price is higher than the sum of the fair value of all identifiable tangible and intangible assets purchased in the acquisition and the liabilities assumed in the process.\"</p></blockquote> <p class=\"paywall-full-content invisible\">When a company records Goodwill, it is recorded as an asset. Since Goodwill represents the amount of value in excess of the company's tangible and intangible assets at the time of acquisition, management is required to perform an annual assessment of Goodwill to determine if the fair value of the assets today still exceed fair value at the time of the acquisition. If yes, nothing is done. If no, an impairment charge is recorded to reflect the updated fair value.</p> <p class=\"paywall-full-content invisible\">Clearly, with this restructuring, management does not deem the value of Backflip the same as it did at the time of the acquisition. I was curious though, how much Goodwill was recorded at the time of the acquisition. So, I looked back to the company's 2013 Form 10-K (disclosing the results of the company's 2013 operations). At the time of the acquisition, the company recorded $119.11m in Goodwill associated with the transaction. That $86.3m charge took a lot out of this amount recorded. The good news is that if the company's restructuring for the division does not work, and another impairment charge is deemed necessary, it won't be nearly as large as the charge taken in 2018. I guess there is a silver lining in this for going forward, right?</p> <h2 class=\"paywall-full-content invisible\">2019 Outlook</h2> <p class=\"paywall-full-content invisible\">Wow. I talked a lot more about the 2018 earnings than I was initially expecting. I wanted to focus a little bit in this article on 2019 and beyond due to the fact that management highlighted a strong forecast in 2019 and 2020. This section will briefly highlight some of the items.</p> <p class=\"paywall-full-content invisible\">First, the company acquired Power Rangers in 2018 from <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-closes-acquisition-saban-properties-power-rangers-and\" rel=\"nofollow\">Saban Properties'</a>. With the acquisition, the company is expected to increase production of products, television shows/films, and gaming for the popular brand. Personally, I was a huge fan of Power Rangers as a child of the 1990s!</p> <p class=\"paywall-full-content invisible\">Second, the company is set to launch a huge E-gaming venture. As a kid, I had Magic the Gathering cards along with many people in my school. Hasbro is using this brand to launch their E-gaming venture in 2019. The brand has a huge, loyal following. This is an interesting way to capitalize and differentiate themselves in a growing marketplace.</p> <p class=\"paywall-full-content invisible\">Lastly, the company highlighted the long list movies, shows, and theme parks that are opening in the coming years for products the company licenses. There will be a new Star Wars Movie and Star Wars based theme parks. On top of it, there will be a new slate of movies with marketable characters: Aladdin, Frozen, Trolls, and the new Marvel movies.</p> <p class=\"paywall-full-content invisible\">All three of the items have a chance to increase revenues greatly in 2019, offsetting the slow year in 2018 and the impact of Toys\"R\"Us. There is always execution risk with these items. But with the brand power, these initiatives should be positive to Hasbro's bottom line.</p> <h2 class=\"paywall-full-content invisible\">Dividend Diplomats Dividend Stock Screener</h2> <p class=\"paywall-full-content invisible\">Now, it is time to put the company through the <a href=\"https://www.dividenddiplomats.com/our-dividend-stock-screener/\" rel=\"nofollow\">Dividend Diplomats' Dividend Stock Screener</a>. This is our simple stock screener that we use to determine if the company we are analyzing currently passes our investment filters used to identify undervalued dividend growth stocks. If a company passes our screener and a few other metrics, we will consider purchasing. Our stock screener uses three simple screens to identify the stocks: P/E ratio (valuation), dividend payout ratio (ability to continue growing their dividend), and their dividend growth rate/history of increasing their dividend (as we focus on companies that have demonstrated their ability to increase their dividend over a long period of time). Let's see the results!</p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <colgroup> <col> <col> <col> <col> <col> <col> <col> <col> </colgroup> <tr> <td>Ticker</td> <td>Price - 3/15/19</td> <td>Forward EPS</td> <td>Annual Dividend</td> <td>Yield</td> <td>Payout Ratio</td> <td>5-Yr DGR</td> <td>P/E Ratio</td> </tr> <tr> <td>HAS</td> <td>$86.72</td> <td>$4.34</td> <td>$2.72</td> <td>3.14%</td> <td>62.67%</td> <td>9.53%</td> <td>19.98</td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p class=\"paywall-full-content invisible\">**Sources: Pricing information, forward EPS, and annual dividend were obtained from Yahoo Finance. The 5-year average dividend growth rate was obtained from <a href=\"https://www.dividendinvestor.com/dividend-quote/mdt/\" rel=\"nofollow\">Dividend Investing|Best Dividend Paying Stocks</a>. The remaining figures in the table above were calculated by the author.</p> <p class=\"paywall-full-content invisible\">1) Dividend Yield: Typically, I look to invest in companies with dividend yields exceeding the S&amp;P 500 yield of just under 2%. Otherwise, I would consider investing in a nice, diversified S&amp;P 500 mutual fund, or ETF. HAS's dividend yield is trading over 100 basis points greater than the broader market. I like what I am seeing here from a yield perspective.</p> <p class=\"paywall-full-content invisible\">2) Payout Ratio: We typically use a 60% threshold when reviewing a company's payout ratio, as we believe this percentage point allows a company to continue to grow their dividend going forward without sacrificing the safety of their dividend. HAS's dividend yield is right in line with our metric. I am happy the payout ratio is not higher. I mentioned earlier there is some execution risk with the company's 2019 initiatives. The payout ratio of 62.67% provides enough of a cushion in the event one or two of their new initiatives isn't as strong as projected (in my opinion).</p> <p class=\"paywall-full-content invisible\">3) Dividend History and Dividend Growth Rate: HAS is not a Dividend Aristocrat, but they have now increased their dividend for 10 consecutive years. In February, the company announced a 7.94% increase in their dividend in the earnings release. 10 years is a solid dividend increase streak, and the company appears committed to continuing this going forward. Further, the company's 5-year average dividend growth rate is 9.53%. Again, another very solid mark. Overall, I like what I am seeing from a dividend history and growth standpoint.</p> <p class=\"paywall-full-content invisible\">4) P/E Ratio: The final metric of our stock screener focuses on the current valuation of the company. I'm always looking for companies that are trading at a multiple below the broader market. Currently, the broader market has a historical P/E ratio in the mid-20x and a forward P/E ratio between 17x and 18x (<a href=\"https://www.wsj.com/mdc/public/page/2_3021-peyield.html\" rel=\"nofollow\">per The Wall Street Journal</a>). Right now, HAS's P/E ratio is 19.98X. The company is trading at a slight premium to the marketplace.</p> <h2 class=\"paywall-full-content invisible\">Summary</h2> <p class=\"paywall-full-content invisible\">Man, this is a tough one. I'm excited about the company's 2019 and 2020 prospects and the projects that are currently on Hasbro's plate. Further, the company's dividend growth has been very strong, and the company has now increased their dividend for 10 consecutive years. However, the company is not currently trading at a discount to the market. In fact, their P/E ratio is above the market. Further, there is some execution risk for the company's upcoming strategy. As excited as I am for the new initiatives, the company did just take an asset impairment charge for an earlier acquisition. What if the Power Rangers or E-gaming initiatives do not pan out or are not as popular as expected?</p> <p class=\"paywall-full-content invisible\">What does this mean for me? It means that I am in \"Wait and See\" mode at the moment. If Hasbro were trading at a discount to the market, I would be buying and rolling the dice on the successful implementation of the new strategies. That doesn't mean I am not interested in the company. But I want to see Q1 and Q2 results before investing in the company to see the results. Hasbro has a spot on my watch list for the next few months as a result of today's analysis.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">What are your thoughts about my analysis and conclusion? Are you a shareholder or are you planning to invest? Am I too concerned with the company's execution risk for these 2019 initiatives?</p>", "twitContent": "$HAS - Hasbro, Inc.: Why I'm Optimistic About The Company, But Still Not Buying Shares. https://seekingalpha.com/article/4249838-hasbro-inc-why-optimistic-company-still-not-buying-shares?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "73495", "type": "author"}}, "sentiments": {"data": [{"id": "24322", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "458445", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4249838-hasbro-inc-why-optimistic-company-still-not-buying-shares", "canonical": "https://seekingalpha.com/article/4249838-hasbro-inc-why-optimistic-company-still-not-buying-shares", "uriImage": "https://static.seekingalpha.com/uploads/2019/3/18/27443183-15529223119491491_origin.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2019/3/18/27443183-15529223119491491_origin.png"}}}, "included": [{"id": "73495", "type": "author", "attributes": {"company": null, "slug": "dividend-diplomats", "userId": 27443183, "tagId": 458445, "bio": "Two guys who love Investing, Dividends, Frugality, Passive Income & attempting to Reinvest Our Dividends to one day achieve Financial Freedom! Follow us on your journey towards a work-free life! <br><p><br></p><p>We share EVERY ASPECT of our journey on our blog, social media, and YouTube Channel. Make sure to follow us so you don't miss an update. Updates include the stocks we are watching, buying, selling, and our overall thoughts about the the market</p><p><br></p><p>Blog: https://www.dividenddiplomats.com</p><p>YouTube Channel: www.youtube.com/dividenddiplomats</p><p>Twitter: https://twitter.com/DvdndDiplomats</p>", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/027/443/183/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/027/443/183/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/027/443/183/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/027/443/183/extra_large_pic.png"}, "nick": "Dividend Diplomats", "deactivated": null, "memberSince": 2014, "isRss": true, "contributorSince": 2014, "followersCount": 15540}, "relationships": {"user": {"data": {"id": "27443183", "type": "user"}}, "userBioTags": {"data": [{"id": "387115", "type": "userBioTag"}, {"id": "387125", "type": "userBioTag"}, {"id": "387135", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/dividend-diplomats", "profileUrl": "/author/dividend-diplomats", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "458445", "type": "tag", "attributes": {"slug": "dividend-diplomats", "name": "Dividend Diplomats", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/dividend-diplomats"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "24322", "type": "sentiment", "attributes": {"articleId": 4249838, "type": "bullish", "createdAt": "2019-03-19T16:29:26.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4249838", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}