{"data": {"id": "4256435", "type": "fullArticle", "attributes": {"publishOn": "2019-04-24T17:09:00-04:00", "isLockedPro": false, "commentCount": 2, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"valuentum": {"id": 34650, "slug": "valuentum", "kind": "common", "non_theme": true}, "amzn": {"id": 562, "slug": "amzn", "kind": "common", "non_theme": true}, "dis": {"id": 86, "slug": "dis", "kind": "common", "non_theme": true}, "mat": {"id": 1748, "slug": "mat", "kind": "common", "non_theme": true}, "t": {"id": 685, "slug": "t", "kind": "common", "non_theme": true}, "tcehy": {"id": 16041, "slug": "tcehy", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "earnings": {"id": 10, "slug": "earnings", "kind": "breadcrumb", "path": "/earnings/earnings-analysis", "title": "Earnings Analysis", "sasource": "theme_breadcrumb"}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Reviewing Hasbro After A Tremendous Quarter", "summary": ["Hasbro Inc posted a surprise profit during the first quarter of 2019, sending shares sharply upwards.\n        ", "As of this writing, the company yields 2.7% and we see plenty of room for income-growth upside.\n        ", "Covering Hasbro's growth trajectory, financials, and potential hurdles going forward.\n        "], "structuredInsights": null, "isPaywalled": false, "lastModified": "2019-04-24T17:09:00-04:00", "isModerated": false, "closestTradingDate": "2019-04-25", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 4, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"><br /><br /><b>Business relationship disclosure:</b>  Callum Turcan works as an independent contractor for Valuentum Securities.</span><br /><br />This article or report and any links within are for information purposes only and should not be considered a solicitation to buy or sell any security. Valuentum is not responsible for any errors or omissions or for results obtained from the use of this article and accepts no liability for how readers may choose to utilize the content. Assumptions, opinions, and estimates are based on our judgment as of the date of the article and are subject to change without notice.\n\nSome of the companies mentioned above may be included in one of Valuentum&#39;s simulated newsletter portfolios.\n\nSome of the companies mentioned above don&#39;t trade on a major U.S. stock exchange, which come with their own unique sets of risks and rewards. Always do your own due diligence before investing.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><span><a href=\"https://static.seekingalpha.com/uploads/2019/4/23/933684-15560612455159674_origin.png\" rel=\"lightbox\" data-width=\"800\" data-height=\"446\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/4/23/933684-15560612455159674.png\" width=\"624\" height=\"348\" alt=\"\" data-width=\"640\" data-height=\"357\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></span></p> <p><em><strong>Image Source:</strong> Hasbro Inc - <a href=\"https://investor.hasbro.com/static-files/03d7deae-560e-4f2a-8710-ae23e22e439e\" rel=\"nofollow\">IR Presentation</a></em></p> <p>By Callum Turcan</p> <p>Toy maker Hasbro Inc (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) just reported earnings that pleasantly surprised the market, sending shares up around 14% on April 23. We like Hasbro’s promising dividend growth trajectory and the company yields 2.7% as of this writing, which we see as well protected. Hasbro <a href=\"https://seekingalpha.com/news/3452685-hasbro-beats-0_32-beats-on-revenue\">beat</a> consensus expectations by wide margins during its latest earnings report, which <a href=\"https://seekingalpha.com/news/3452781-toy-stocks-pop-after-hasbros-movie-bounce\">favorably impacted</a> Mattel Inc’s (<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a>) share price as investors recalibrated their expectations for the toy industry at-large. Investors were expecting Hasbro to post a net loss last quarter, in part due to foreign exchange headwinds. However, a combination of revenue growth and cost control measures enabled Hasbro to proudly post a profitable quarter. Stronger financial performance is a key reason why Hasbro was able to approve an <a href=\"https://www.nasdaq.com/symbol/has/dividend-history\" rel=\"nofollow\">8% increase</a> its quarterly payout this upcoming May. </p> <h2>Earnings Overview</h2> <p>Hasbro’s cost of sales as a percent of total revenue dropped by 10 basis points while its revenue was up over 2% year-over-year to $733 million (that growth rate would have been higher, at 6%, if not for foreign currency headwinds) during the <a href=\"https://investor.hasbro.com/investor-relations\" rel=\"nofollow\">first quarter of 2019</a>. Management attributed the sales growth and margin expansion to Hasbro’s efforts to grow its distribution network (by teaming up with additional retailers and discovering new distribution methods), major brand initiatives (several of which are launching this year), and by moving into less conventional marketing methods.</p> <p>That includes leveraging its Magic: The Gathering card game property (which also has a big digital element) by hosting tournaments and streaming professional game play on Amazon Inc’s (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>) Twitch service, which included a $1 million prize pool at the <a href=\"https://www.gameinformer.com/index.php/the-game-awards-2018/2018/12/06/wizards-of-the-coast-announces-10-million-dollar-prize-pool-for\" rel=\"nofollow\">PAX East invitational</a>. Note that Hasbro purchased Wizards of the Coast, the maker of Magic: The Gathering, back <a href=\"https://money.cnn.com/1999/09/09/deals/hasbro/\" rel=\"nofollow\">in 1999</a> for $0.3 billion<span class=\"paywall-full-content invisible\"> in an all-equity deal.</span></p> <p class=\"paywall-full-content invisible\">Revenue growth largely came from a 24% surge in Hasbro’s ‘Entertainment, Licensing and Digital’ sales last quarter on a year-over-year basis. Note that this segment includes “<em>Wizards of the Coast digital gaming revenues” </em>after the company reclassified that operation (which was previously lumped together with the performance of its U.S. and Canada division) last year. Strong Magic: The Gathering performance will now shine through Hasbro’s financial statements a bit better. Management had this to say during Hasbro’s <a href=\"https://seekingalpha.com/article/4255973-hasbro-inc-ceo-brian-goldner-on-q1-2019-results-earnings-call-transcript\">first quarter</a> conference call;</p> <blockquote class=\"paywall-full-content invisible\"> <p><em>“Our outlook is anchored in innovation and execution around higher margin growth opportunities and key brand initiatives, many of which launch later in the year. We are leveraging our expertise and brand portfolio to drive unique gaming experiences. This kicked off with great success at our premier MAGIC: THE GATHERING Mythic Invitational at PAX East in March. John, Deb and I were on hand to see the team lead a tremendous event, which generated 2.7 million viewer hours on Twitch and paid out $1 million price pool.</em></p> <p><em><strong>Engagement with MAGIC: THE GATHERING is growing in both digital gaming and analog tabletop. In-store player growth increased double digits and grew at an even higher rate for new players.</strong> The latest magic card set, War of the Spark, was unveiled at PAX East and drove over 10 million views of the trailer shattering the previous record.</em></p> <p><em>In-stores, in early May, War of the Spark is currently available for digital pre-order in Magic: The Gathering Arena and launches this week. Magic: The Gathering Arena is performing well with over 700 million games played to date during the Open Beta with the average player spending 8 hours per week in the game. We'll be further supporting the game with additional tournament and marketing support as the year progresses. As discussed at Toy Fair, we're also expanding the MAGIC: THE GATHERING franchise to reach a broader audience through an entirely new game designed for mobile. The team launched this game, Valor’s Reach, into test markets during the first quarter.”</em></p> </blockquote> <p class=\"paywall-full-content invisible\">Expect Hasbro to continue investing heavily in its Magic: The Gathering property. Note that Hasbro sells both physical and digital copies of these playing cards, and in the event its digital card game continues performing well, that could provide upward pressure on Hasbro’s gross margins in the long-run.</p> <p class=\"paywall-full-content invisible\">The toy maker’s ‘U.S. and Canada’ sales climbed by 1% while its international sales fell by 2% from the first quarter of 2018 to the first quarter of this year. As mentioned earlier, note that if it wasn’t for foreign currency headwinds, Hasbro’s revenue growth would have looked a lot more impressive. For instance, the firm posted 8% sales growth in Europe last quarter on a constant currency basis, which turned to a negative 1% growth rate due to the US dollar strengthening against the Euro.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/4/23/933684-15560612460498352_origin.png\" rel=\"lightbox\" data-width=\"798\" data-height=\"421\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/4/23/933684-15560612460498352.png\" alt=\"A picture containing screenshot Description automatically generated\" width=\"624\" height=\"329\" data-width=\"640\" data-height=\"338\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em><strong>Image Shown:</strong> Hasbro’s adjusted revenue growth by region during the first quarter of 2019. <strong>Image Source:</strong> Hasbro – <a href=\"https://investor.hasbro.com/static-files/03d7deae-560e-4f2a-8710-ae23e22e439e\" rel=\"nofollow\">IR Presentation</a></em></p> <p class=\"paywall-full-content invisible\">Cost control measures (keeping a lid on certain compensation expenses and realizing better economies of scale at its logistics operations) are expected to save Hasbro between $50 – 55 million on an annualized basis by the end of 2019. Management noted that those savings should be fully realized by 2020.</p> <p class=\"paywall-full-content invisible\">All of these factors combined enabled the toy maker to post an operating profit of $36 million <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-reports-revenue-operating-profit-and-earnings-share\" rel=\"nofollow\">last quarter</a> versus an operating loss of $80 million in the same period a year ago. That enabled Hasbro’s net income to flip from negative $112 million in the first quarter of 2018 to positive $27 million during the first quarter of 2019, resulting in Hasbro’s stock price surging upwards on April 23. Hasbro is now trading at the upper end of our range of fair value estimates, but we recognize that there is room for HAS to keep moving upwards. The company’s quarterly GAAP EPS rose to $0.21 last quarter from negative $0.90 in the same quarter a year ago.</p> <h2 class=\"paywall-full-content invisible\">How We View Hasbro</h2> <p class=\"paywall-full-content invisible\">Below is a concise summary of our thoughts on Hasbro as it relates to its key strengths;</p> <blockquote class=\"paywall-full-content invisible\"><p><em>“Hasbro's dividend history is a strong one, having paid a dividend since 1977 and raised its payout at a 13% CAGR over the last 10 years. The firm expects to continue to benefit from global expansion, which includes industry growth in markets in which it is already established around the world. We like the recent performance of its franchise brands, where operating profit margins are greater than the company average, and the ongoing focus on its higher margin 'Entertainment &amp; Licensing' segment should continue to push overall margins higher. Continual investment (~5% of total revenue) in product development is expected to continue to drive demand for innovative products. We like Hasbro's dividend growth prospects.”</em></p></blockquote> <p class=\"paywall-full-content invisible\">No analysis is complete without also looking at a firm’s downside risks. Here are our thoughts on Hasbro’s key weaknesses;</p> <blockquote class=\"paywall-full-content invisible\"><p><em>“While we are [optimistic] on Hasbro's dividend potential, its payout [and operations in general] are not without risks. It operates in a competitive industry, and 'the next big thing' is constantly being hunted by developers across the group. We like what the firm's strategic merchandizing relationship with Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>) does for its product offerings in the coming years, but the promise of such a relationship is tied to big-name movie releases, which has the potential to result in inconsistent results. We're keeping an eye on the firm's ~$1.7 billion total debt load at the end of the third quarter of 2018, as its cash balance has shrunk to $907 million from ~$1.6 billion through three quarters of 2018. Its solid free cash flow generation should be able to handle the load, however.”</em></p></blockquote> <p class=\"paywall-full-content invisible\">At the end of the first quarter of this year, Hasbro’s cash &amp; cash equivalents balance stood at $1.2 billion while its total debt load (almost all of which is long-term debt) came in at $1.7 billion, giving Hasbro a net debt position of $0.5 billion. Considering Hasbro is firmly free cash flow positive (defined as net operating cash flow less capital expenditures), with its free cash flow coming in at $240 million during the first quarter of 2019, the company can easily handle that burden as previously stated. Hasbro paid out $79 million in dividends last quarter, on top of $47 million in share repurchases, both of which were fully covered by free cash flow.</p> <h2 class=\"paywall-full-content invisible\">Keeping Current</h2> <p class=\"paywall-full-content invisible\">Hasbro recently launched ‘Monopoly Game of Thrones Board Game for Adults’ which retails on its website for <a href=\"https://monopoly.hasbro.com/en-us/product/monopoly-game-of-thrones-board-game-for-adults:56DDAE13-280A-4EB5-B864-555D74FDDDED\" rel=\"nofollow\">$29.99</a>. AT&amp;T Inc (<a href=\"https://seekingalpha.com/symbol/T\" title=\"AT&amp;T Inc.\">T</a>) owns HBO which in turn produces the very popular Game of Thrones TV show, a series that’s particularly popular amongst groups that would likely play board games (millennials, families with older children). What this type of upgrade and marketing scheme indicates is that Hasbro is fully capable of adapting old properties to modern times, keeping sales up and maintaining brand power. During Hasbro’s <a href=\"https://seekingalpha.com/article/4255973-hasbro-inc-ceo-brian-goldner-on-q1-2019-results-earnings-call-transcript\">latest</a> quarterly conference call with investors, management had this to say about the firm’s storied Monopoly property;</p> <blockquote class=\"paywall-full-content invisible\"><p><em>“In our face-to-face gaming portfolio, MONOPOLY is coming off a record year and continued to deliver growth based on insight-driven innovation and on-trend additions. MONOPOLY Cheaters Edition and MONOPOLY: Fortnite are performing well. MONOPOLY for millennials is rolling out globally building off its success in the U.S. <strong>And we recently launched our Game of Thrones Edition, which is off to a good start as the hit HBO show enters its final season.</strong>”</em></p></blockquote> <p class=\"paywall-full-content invisible\">Readers should keep in mind that Game of Thrones is currently airing its eighth and final season, making this launch particularly relevant. Ratings for the TV show have been <a href=\"https://variety.com/2019/tv/news/game-of-thrones-season-8-episode-2-ratings-1203195348/\" rel=\"nofollow\">stunning</a>, with over 17 million people reportedly watching the first episode of the final season a couple of weeks ago.</p> <p class=\"paywall-full-content invisible\">Hasbro has done a tremendous job generating shareholder value over the past few years. Another example of Hasbro adapting to the modern times is launching a Fortnite edition of Monopoly. Fortnite is the popular cartoon-ish battle royale game made by EPIC Games, which is owned by a <a href=\"https://www.investopedia.com/news/how-tencent-changed-fortnite-creator-epic-games-fortunes/\" rel=\"nofollow\">consortium</a> that includes China’s Tencent Holdings Limited (<a href=\"https://seekingalpha.com/symbol/TCEHY\" title=\"Tencent Holdings Limited\">OTCPK:TCEHY</a>) and Walt Disney Company. As Fortnite is popular amongst a wide range of demographic groups, leveraging that videogame’s popularity to drive sales of Monopoly isn’t a bad strategy.</p> <h2 class=\"paywall-full-content invisible\">Concluding Thoughts</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">There is a lot to like about Hasbro as the firm yields 2.7%, sports an impressive dividend growth track-record, has good dividend coverage, historically has exhibited an ability to consistently generate real shareholder value, and its long-term growth prospects look quite promising. Hasbro’s biggest concerns going forward include maintaining profitability, following through with its cost control measures, managing its net debt load, and contending with foreign currency headwinds. We are still on the sidelines after Hasbro’s latest report but will be keeping an eye on the firm as we get deeper into 2019.</p>", "twitContent": "$HAS - Reviewing Hasbro After A Tremendous Quarter. https://seekingalpha.com/article/4256435-reviewing-hasbro-after-tremendous-quarter?source=tweet ", "innerMarketing": "", "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "24491", "type": "author"}}, "sentiments": {"data": [{"id": "33032", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "562", "type": "tag"}, {"id": "86", "type": "tag"}, {"id": "1748", "type": "tag"}, {"id": "685", "type": "tag"}, {"id": "16041", "type": "tag"}]}, "otherTags": {"data": [{"id": "34650", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "10", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4256435-reviewing-hasbro-after-tremendous-quarter", "canonical": "https://seekingalpha.com/article/4256435-reviewing-hasbro-after-tremendous-quarter", "uriImage": "https://static.seekingalpha.com/uploads/2019/4/23/933684-15560612455159674_origin.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2019/4/23/933684-15560612455159674_origin.png"}}}, "included": [{"id": "24491", "type": "author", "attributes": {"company": null, "slug": "valuentum", "userId": 933684, "tagId": 34650, "bio": "<p>We offer subscriptions and exclusive newsletters. Visit our website at www.valuentum.com for more information. Valuentum is an independent investment research publisher, offering premium equity reports and dividend reports, as well as commentary across all sectors/companies, a Best Ideas Newsletter (spanning market caps, asset classes), a Dividend Growth Newsletter, modeling tools/products, and more. Valuentum is based in the Chicagoland area. Valuentum is not a money manager, broker, or financial advisor. Valuentum is a publisher of financial information. Please read our Disclaimer that applies to all articles published on Seeking Alpha: https://www.valuentum.com/categories/20110613. Follow us on Twitter: @Valuentum</p>", "image": {"small": "https://static.seekingalpha.com/images/users_profile/000/933/684/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/000/933/684/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/000/933/684/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/000/933/684/extra_large_pic.png"}, "nick": "Valuentum", "deactivated": null, "memberSince": 2011, "isRss": false, "contributorSince": 2011, "followersCount": 17929}, "relationships": {"user": {"data": {"id": "933684", "type": "user"}}, "userBioTags": {"data": [{"id": "956533", "type": "userBioTag"}, {"id": "956534", "type": "userBioTag"}, {"id": "956535", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/valuentum", "profileUrl": "/author/valuentum", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "562", "type": "tag", "attributes": {"slug": "amzn", "name": "AMZN", "company": "Amazon.com, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/AMZN"}}, {"id": "86", "type": "tag", "attributes": {"slug": "dis", "name": "DIS", "company": "The Walt Disney Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/DIS"}}, {"id": "1748", "type": "tag", "attributes": {"slug": "mat", "name": "MAT", "company": "Mattel, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MAT"}}, {"id": "685", "type": "tag", "attributes": {"slug": "t", "name": "T", "company": "AT&T Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/T"}}, {"id": "16041", "type": "tag", "attributes": {"slug": "tcehy", "name": "TCEHY", "company": "Tencent Holdings Limited", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "OTCMKTS", "fundTypeId": 8, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/TCEHY"}}, {"id": "34650", "type": "tag", "attributes": {"slug": "valuentum", "name": "Valuentum", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/valuentum"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "10", "type": "tag", "attributes": {"slug": "earnings", "name": "Earnings", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/earnings"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "33032", "type": "sentiment", "attributes": {"articleId": 4256435, "type": "neutral", "createdAt": "2019-04-24T17:09:00.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4256435", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}