{"data": {"id": "4288426", "type": "fullArticle", "attributes": {"publishOn": "2019-08-28T11:41:29-04:00", "isLockedPro": false, "commentCount": 2, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"valuentum": {"id": 34650, "slug": "valuentum", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "entmf-defunct-24018": {"id": 24018, "slug": "entmf-defunct-24018", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro Makes Big Push Into Video Production, But We Are Still On The Sidelines", "summary": ["Hasbro is acquiring Entertainment One for roughly USD$4.0 billion in cash.", "While we like Hasbro's push into the video production universe given its quality IP portfolio, we are still staying on the sidelines.", "Shares of Hasbro appeared fully valued as of this writing, in our view.", "Upcoming tariffs on Chinese exports of toys to the US and Hasbro's growing net debt load are concerns management needs to deal with head-on.", "Deleveraging efforts are expected over the next few years once the deal closes, which we appreciate."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2019-08-28T11:41:29-04:00", "isModerated": false, "closestTradingDate": "2019-08-28", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />This article or report and any links within are for information purposes only and should not be considered a solicitation to buy or sell any security. Valuentum is not responsible for any errors or omissions or for results obtained from the use of this article and accepts no liability for how readers may choose to utilize the content. Assumptions, opinions, and estimates are based on our judgment as of the date of the article and are subject to change without notice. Some of the companies mentioned above don&#39;t trade on a major US stock exchange, which come with their own unique sets of risks and rewards. Always do your own due diligence before investing.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/26/933684-15668398796507106_origin.png\" rel=\"lightbox\" data-width=\"1415\" data-height=\"795\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/26/933684-15668398796507106.png\" alt=\"A screenshot of a cell phone Description automatically generated\" width=\"625\" height=\"352\" data-width=\"640\" data-height=\"360\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></span></p> <p>Image Source: Hasbro Inc – <a href=\"https://investor.hasbro.com/static-files/01544fa9-681d-4f8a-a699-5b031224516f\" rel=\"nofollow\">IR Presentation</a></p> <p><em>By Callum Turcan</em></p> <p>On <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-acquire-entertainment-one-adding-brands-and-expanding\" rel=\"nofollow\">August 22</a>, Hasbro Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) announced it was acquiring Entertainment One Ltd. (<a href=\"https://seekingalpha.com/symbol/ENTMF\">ENTMF</a>) through an all-cash deal worth approximately USD$4.0 billion. Hasbro will gain access to popular properties like Peppa Pig and Ricky Zoom, along with substantial TV production capabilities. Peppa Pig is very popular in the UK, China, and elsewhere while Ricky Zoom is steadily gaining traction worldwide. We see this deal as Hasbro’s way of finally being able to produce its own live-action and animated TV shows and movies in-house, versus being forced to license out its intellectual property (such as Transformers) to studios.</p> <p>Hasbro sees its long-term future resting in large part on the ability to make video-streaming content and video games (with an eye towards mobile apps) based on properties that already have substantial fan bases. As HAS trades at the upper end of our fair value range (derived through our rigorous <a href=\"https://www.valuentum.com/categories/20110615\" rel=\"nofollow\">discounted free cash flow analysis</a>), we aren’t interested in shares, especially as <a href=\"https://www.reuters.com/article/us-usa-trade-china-tariffs/trump-delays-tariffs-on-chinese-cellphones-laptops-toys-markets-jump-idUSKCN1V31CX\" rel=\"nofollow\">additional US tariffs</a> on Chinese toy imports are set to kick in this December. While that’s after the main spending period of the 2019 holiday shopping season, the fear is that those tariffs will still be on pace for 2020, 2021, etc., which negatively impacts Hasbro’s longer-term outlook. Shares of HAS yield 2.5% as of this writing.</p> <p>The toymaker has had <a href=\"https://investor.hasbro.com/static-files/cee88521-71dc-4b58-89bd-7adb7bb04b84\" rel=\"nofollow\">plenty of success</a> leveraging its Transformers property, largely through licensing agreements. Its 2018 movie Bumblebee grossed over $460 million at the box office, including over $170 million in China. That's on top of ~$30 million in DVD and Blue-ray sales, versus a production budget <a href=\"https://www.the-numbers.com/movie/Bumblebee#tab=more\" rel=\"nofollow\">estimated</a> around $100 million keeping marketing expenses in mind. In partnership with Paramount, owned by Viacom Inc. (<a href=\"https://seekingalpha.com/symbol/VIAB\">VIAB</a>) and <a href=\"https://www.nbcnews.com/business/business-news/cbs-viacom-have-different-streaming-strategies-can-they-combine-win-n1042701\" rel=\"nofollow\">soon</a> CBS Corporation (<a href=\"https://seekingalpha.com/symbol/PARA\" class=\"paywall-full-content invisible\">CBS</a><span class=\"paywall-full-content invisible\">), Hasbro plans to continue making blockbuster Transformers movies. It's key to note that these movies create interest in Hasbro's toy products and other video offerings (such as animated TV shows), enhancing its revenue generation elsewhere.</span></p> <p class=\"paywall-full-content invisible\">Hasbro is investing in additional Transformers content, including producing a new animated TV show for the Chinese market (in conjunction with a local partner) which will be supported by a new line of Transformers toys and related products. Hasbro is also rolling out new content for preschoolers and pre-adolescent children in Western markets, including Transformers: Rescue Bots Academy (first launched late-2018/early-2019) and Transformers: Cyberverse (first season launched in 2018, second season planned for later in 2019).</p> <p class=\"paywall-full-content invisible\">Looking ahead, Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a>) and Hasbro are working together on a new animated series, Transformers: The War for Cybertron Trilogy, that is guided for a 2020 launch. The purchase of Entertainment One isn’t a shift in a new direction, it’s a continuation of what Hasbro has been steadily building towards for a while now.</p> <h2 class=\"paywall-full-content invisible\">Deal Overview</h2> <p class=\"paywall-full-content invisible\">Hasbro is suspending its share buyback program as part of this deal in order to deleverage the balance sheet while maintaining its dividend policy. A combination of debt and a $1.0-$1.25 billion equity issuance are expected to help finance the deal, keeping in mind Hasbro was sitting on $1.15 billion in cash and $1.7 billion in total debt at the <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-reports-revenue-and-operating-profit-growth-second\" rel=\"nofollow\">end</a> of June 2019. The lower interest rate environment the world now faces makes it much easier for Hasbro to raise meaningful amounts of funds from capital markets at reasonable rates. Down below is a key excerpt from Hasbro’s <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-acquire-entertainment-one-adding-brands-and-expanding\" rel=\"nofollow\">press release</a>;</p> <blockquote class=\"paywall-full-content invisible\"> <p> </p> <p>The cash purchase price of £5.60 per share represents a 31% premium to eOne’s 30-day volume-weighted average price [VWAP] as of August 22, 2019. Hasbro expects to finance the transaction with the proceeds of debt financing and approximately US$1.0 billion to US$1.25 billion in cash from equity financing. Hasbro has entered into a debt commitment letter with Bank of America Merrill Lynch (<a href=\"https://seekingalpha.com/symbol/BAC\" title=\"Bank of America Corporation\">BAC</a>) to provide a 364-day senior unsecured bridge loan facility to secure funding of the purchase price.</p> <p>Hasbro is committed to maintaining an investment grade rating. Hasbro’s long-term leverage target remains unchanged at 2.00 to 2.50X gross Debt to EBITDA and expects to return to this range in three to four years. Hasbro expects to maintain its quarterly dividend and suspend its current share repurchase program while it prioritizes achieving its leverage target.</p> </blockquote> <p class=\"paywall-full-content invisible\">We caution Hasbro’s net debt position will be growing materially after the deal closes. Considering Hasbro’s strong free cash flows and plans to deleverage, management should be able to bring down the toy maker’s leverage considerably within a few years. Future dividend increases will need to contend with debt reduction efforts that also consume free cash flows, which will likely depress payout growth in the medium term. Hasbro expects the deal to close by the end of 2019.</p> <p class=\"paywall-full-content invisible\">Management has their eyes set on ~$130 million in cost and in-sourcing synergies by 2022, with room for upside via revenue synergies. While this deal is largely to grow Hasbro’s IP portfolio and ability to produce video content (TV, movies, short-clips, etc.), synergies are a nice cherry on top and modestly enhance expected future free cash flows (on an absolute basis).</p> <h2 class=\"paywall-full-content invisible\">What We Think</h2> <p class=\"paywall-full-content invisible\">Over the past three fiscal years (FY2016–FY2018), Hasbro generated ~$0.7 billion in net operating cash flow per year on average. As its business model is light on capital expenditures relatively speaking, which we appreciate, Hasbro’s free cash flows averaged ~$0.6 billion per year during this period. That easily covered ~$0.3 billion in average annual dividend payouts. With share repurchases halted (averaged ~$0.2 billion per year from FY2016–FY2018), the remainder of Hasbro’s free cash flows can now be allocated to paying down debt. Here’s a quick summary of our thoughts on the leisure industry, from our 16-page Stock Report covering Hasbro:</p> <blockquote class=\"paywall-full-content invisible\"><p>The leisure industry is composed of firms that span the cruise line business to those that make toys and children’s products. Competition among toy companies is intensifying due to recent trends toward shorter toy life cycles, the increasing use of technology in toys, and the proliferation of electronic consumer products and video games. All industry participants compete for consumer discretionary income. We’re neutral on the structure of the group.</p></blockquote> <p class=\"paywall-full-content invisible\">Additionally, please note that Hasbro has a history of generating strong returns for shareholders, seen through the firm’s return on invested capital (excluding goodwill) exceeding its estimated weighted-average cost of capital over the past three full fiscal years. That’s highlighted in the graphic below, which is also from our 16-page Stock Report covering Hasbro:</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/26/933684-15668646889095476_origin.png\" rel=\"lightbox\" data-width=\"920\" data-height=\"802\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/26/933684-15668646889095476.png\" data-width=\"640\" data-height=\"558\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span>Image Shown: Hasbro’s ROIC ex-goodwill has consistently exceeded its estimated WACC over the past three full fiscal years, and we expect that to continue going forward (based on our rigorous pro forma financial analysis). Image Source: From our 16-page Stock Report covering Hasbro.</p> <p class=\"paywall-full-content invisible\">We see Hasbro’s net operating cash flows steadily increasing over the next five years and beyond, allowing for meaningful free cash flow growth. The company’s push deeper into the TV and movie production space over the next few years will play a key role in determining the trajectory of Hasbro’s free cash flows, as will management's ability to properly leverage Hasbro's new top tier IP (with an eye on Peppa Pig and Ricky Zoom). In the graphic down below we highlight how we view the trajectory of Hasbro’s net operating cash flows and free cash flows, which is also from our 16-page Stock Report covering Hasbro.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/26/933684-15668647668989024_origin.png\" rel=\"lightbox\" data-width=\"1110\" data-height=\"698\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/26/933684-15668647668989024.png\" data-width=\"640\" data-height=\"402\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/26/933684-15668647925639389_origin.png\" rel=\"lightbox\" data-width=\"1110\" data-height=\"701\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/26/933684-15668647925639389.png\" data-width=\"640\" data-height=\"404\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Images Shown: We expect Hasbro to post meaningful cash flow growth over the next five fiscal years and beyond. Image Source: From our 16-page Stock Report covering Hasbro</p> <h2 class=\"paywall-full-content invisible\">Concluding Thoughts</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">We are still staying on the sidelines as we see Hasbro facing some significant exogenous shocks in the near term, namely US tariffs on Chinese toy imports (which are <a href=\"https://www.cnn.com/2018/10/07/business/china-tariffs-toys/index.html\" rel=\"nofollow\">especially onerous</a> in light of America receiving ~85% of its toy imports from China), while shares of HAS are already fully valued in our view. Hasbro’s foray into the TV and movie production business makes perfect sense as the company’s IP is in high demand. Acquiring the Peppa Pig and to a lesser extent the Ricky Zoom properties substantially enhances Hasbro’s international growth trajectory, if the company plays its cards right.</p>", "twitContent": "$HAS $ENTMF-DEFUNCT-24018 - Hasbro Makes Big Push Into Video Production, But We Are Still On The Sidelines. https://seekingalpha.com/article/4288426-hasbro-makes-big-push-video-production-are-still-on-sidelines?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "24491", "type": "author"}}, "sentiments": {"data": [{"id": "62858", "type": "sentiment"}, {"id": "62857", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}, {"id": "24018", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "34650", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "16549", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4288426-hasbro-makes-big-push-video-production-are-still-on-sidelines", "canonical": "https://seekingalpha.com/article/4288426-hasbro-makes-big-push-video-production-are-still-on-sidelines", "uriImage": "https://static.seekingalpha.com/uploads/2019/8/26/933684-15668398796507106_origin.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2019/8/26/933684-15668398796507106_origin.png"}}}, "included": [{"id": "24491", "type": "author", "attributes": {"company": null, "slug": "valuentum", "userId": 933684, "tagId": 34650, "bio": "<p>We offer subscriptions and exclusive newsletters. Visit our website at www.valuentum.com for more information. Valuentum is an independent investment research publisher, offering premium equity reports and dividend reports, as well as commentary across all sectors/companies, a Best Ideas Newsletter (spanning market caps, asset classes), a Dividend Growth Newsletter, modeling tools/products, and more. Valuentum is based in the Chicagoland area. Valuentum is not a money manager, broker, or financial advisor. Valuentum is a publisher of financial information. Please read our Disclaimer that applies to all articles published on Seeking Alpha: https://www.valuentum.com/categories/20110613. Follow us on Twitter: @Valuentum</p>", "image": {"small": "https://static.seekingalpha.com/images/users_profile/000/933/684/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/000/933/684/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/000/933/684/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/000/933/684/extra_large_pic.png"}, "nick": "Valuentum", "deactivated": null, "memberSince": 2011, "isRss": false, "contributorSince": 2011, "followersCount": 17929}, "relationships": {"user": {"data": {"id": "933684", "type": "user"}}, "userBioTags": {"data": [{"id": "956533", "type": "userBioTag"}, {"id": "956534", "type": "userBioTag"}, {"id": "956535", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/valuentum", "profileUrl": "/author/valuentum", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "24018", "type": "tag", "attributes": {"slug": "entmf-defunct-24018", "name": "ENTMF", "company": "Entertainment One Ltd.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "OTCMKTS", "fundTypeId": 0, "isDefunct": true, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/ENTMF-DEFUNCT-24018"}}, {"id": "34650", "type": "tag", "attributes": {"slug": "valuentum", "name": "Valuentum", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/valuentum"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "62858", "type": "sentiment", "attributes": {"articleId": 4288426, "type": "neutral", "createdAt": "2019-08-28T11:41:29.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4288426", "type": "article"}}, "tag": {"data": {"id": "24018", "type": "tag"}}}}, {"id": "62857", "type": "sentiment", "attributes": {"articleId": 4288426, "type": "neutral", "createdAt": "2019-08-28T11:41:29.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4288426", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}