{"data": {"id": "4410972", "type": "fullArticle", "attributes": {"publishOn": "2021-03-03T06:34:42-05:00", "isLockedPro": false, "commentCount": 47, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"confounded-interest": {"id": 578082, "slug": "confounded-interest", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "utilities": {"id": 55, "slug": "utilities", "kind": "sector", "path": "/stock-ideas/utilities", "title": "Utilities ", "non_theme": true, "sasource": "theme_breadcrumb"}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "electric-utilities": {"id": 18029, "slug": "electric-utilities", "kind": "common", "non_theme": true}}, "title": "Dominion Energy: Buying Back In After A 6-Month Mental Health Break", "summary": ["Dominion is a pure play utility operating within historically favorable jurisdictions. The profile of the company is now much more predictable after the asset sale to Berkshire Hathaway.", "Valuation levels have reached reasonability once again during a flash sale in utilities, and I have initiated a full position, completing a rather lucky round trip in my portfolio.", "With the company anticipating 6.5% EPS growth going forward along with a 3.6% dividend, 10%+ compounding returns at the current valuation seem achievable."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2021-05-02T13:28:23-04:00", "isModerated": false, "closestTradingDate": "2021-03-03", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 22, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long D, BRK.B, SO.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />&quot;I am not a licensed financial advisor. This is not a solicitation to buy or sell a specific security nor is it to be construed as investment advice, please contact your licensed financial and tax advisor for advice to your specific situation&quot;</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-w750\" alt='Warren Buffett\"s Berkshire Hathaway To Buy Dominion Energy' data-id=\"1224912060\" data-type=\"getty-image\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-w240 240w\" width=\"4606px\" height=\"3071px\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption>Photo by Zach Gibson/Getty Images News via Getty Images</figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>In this article, I would like to discuss Dominion Energy (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>) and the round trip I have completed in my portfolio with this name during the last 6 months. Also<span class=\"paywall-full-content invisible\"> I would like to discuss why I believe this is a solid long-term holding going forward, given the company's push to embrace not only a regulated structure but also the green energy revolution.</span></p> <h2 class=\"paywall-full-content invisible\">Overview and Asset Sale</h2> <p class=\"paywall-full-content invisible\">Dominion Energy can trace its roots all the way back to 1795 as the Upper Appomattox Company formed to build dams along the river for industrial use. In its current form, Dominion Energy provides electricity and natural gas to more than seven million customers primarily in five states, Virginia, North Carolina, South Carolina, Ohio &amp; Utah. It also owns certain natural gas pipelines and storage, power generation plants and 50% ownership of a liquid natural gas export facility. The company is headquartered in Richmond, Va.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2021/3/2/20926831-1614735951314055_origin.png\" rel=\"lightbox\" data-width=\"822\" data-height=\"475\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2021/3/2/20926831-1614735951314055.png\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Approximately 90% of the company's earnings are now generated in state regulated operations after the company's asset sale, which included what is considered a cardinal sin for a utility company, a dividend cut! In this case, by 33%.</p> <p class=\"paywall-full-content invisible\">In early July 2020, Dominion announced that it had reached an agreement to sell its midstream Gas Transmission and Storage segment to Berkshire Hathaway (<a href=\"https://seekingalpha.com/symbol/BRK.B\" title=\"Berkshire Hathaway Inc.\">BRK.B</a>), (<a href=\"https://seekingalpha.com/symbol/BRK.A\" title=\"Berkshire Hathaway Inc.\">BRK.A</a>). Berkshire assumed $5.7 billion in debt and paid another $4 billion in cash to Dominion upon the deal's closing November 2, 2020.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2021/3/2/20926831-16147361372838776_origin.png\" rel=\"lightbox\" data-width=\"1031\" data-height=\"588\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2021/3/2/20926831-16147361372838776.png\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">This transaction completed a quest by Dominion to restructure its business firmly around the regulated utility sector.</p> <p class=\"paywall-full-content invisible\">Dominion's Cove Point LNG export facility, in which the company retains 50% non-controlling ownership interest following the midstream asset sale, enjoys returns on invested capital that are in the low teens and appear to be well above Dominion's cost of capital, making it a potential source of upside or a candidate for raising funds in the future.</p> <h2 class=\"paywall-full-content invisible\">The Green Explosion</h2> <p class=\"paywall-full-content invisible\">Dominion, in its new form, is now 100% all in towards a greener future, not simply for the environment, but also for increasing profits.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2021/3/2/20926831-16147405229808779_origin.png\" rel=\"lightbox\" data-width=\"824\" data-height=\"461\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2021/3/2/20926831-16147405229808779.png\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Dominion has identified and planned for a whopping $72 billion dollar investment in green energy between 2020-2035, with $26 billion to be spent over the next 5 years alone. This commitment was reaffirmed with the filing in December 2020 of plans to build the biggest offshore wind farm in American history off the coast of Virginia. Construction is slated to start in 2024.</p> <p class=\"paywall-full-content invisible\">If you are not familiar with exactly how regulated utilities operate, you may be immediately turned off by the prospect of a simply enormous plan to spend tens of billions of dollars on windmills and solar farms. This may be a good time for a quick refresher on how utilities actually make money. </p> <p class=\"paywall-full-content invisible\">The below quote from an article by the Sightline Institute <a href=\"https://www.sightline.org/2020/05/18/playing-monopoly-or-how-utilities-make-money/\" rel=\"nofollow\">how utilities make money</a> describes it best.</p> <blockquote class=\"paywall-full-content invisible\"><p>Utilities’ profit doesn’t come from the natural gas or water or electricity they provide to customers. That’s right, utilities do not earn profits on the products they sell—gas, water, and power are provided “at cost” to consumers—but rather from the investment in the assets (the pipes, substations, transmission lines, etc.) that are used to provide the service. In short, the more infrastructure that a utility builds, the higher the profits it can generate.</p></blockquote> <p class=\"paywall-full-content invisible\">This is why the green revolution is such a potential boon to utilities in green minded jurisdictions, of which Dominion can claim unequivocally to reside in. With Virginia appearing dead set on becoming a trendsetter, the set up for Dominion could literally not be better, and they seem to have a massive plan to take advantage with a combination of wind, solar, energy storage, nuclear, grid modernization and gas modernization projects keyed up.</p> <p class=\"paywall-full-content invisible\">A word of warning, however; these profit margins are not guaranteed to investors, utilities bear some risk of actual costs exceeding forecasted costs, as was and still is to some extent on display with Southern Company's (<a href=\"https://seekingalpha.com/symbol/SO\" title=\"The Southern Company\">SO</a>) botched Vogtle nuclear plant. Utilities must effectively manage their business to achieve this stated rate of return on equity.</p> <p class=\"paywall-full-content invisible\">Political risks abound for utilities; however, Virginia recently has been and looks to continue to be a democratic stronghold in the governor's mansion (with a vocal, business friendly and powerful Republican minority) which gives the green profit wave a strong likelihood of actual realization, potentially without the threat of increased claw backs or groundswell protests over said profits.</p> <h2 class=\"paywall-full-content invisible\">Valuation</h2> <p class=\"paywall-full-content invisible\">Dominion currently trades at a forward PE ratio of 18.04, which is almost dead on with the industry average of 18.2. I feel that shares are currently undervalued as Dominion has stated it sees a clear path to 6.5% EPS growth through at least 2025 along with a sustainable, growing dividend which is currently 3.6%.</p> <p class=\"paywall-full-content invisible\">This gives the company a PEGY ratio (PE/(Growth+Yield)) of 1.78, which is quite respectable given the low rate environment for a utility. In the current climate, most utilities are targeting 3.5-5% EPS growth and sport comparable dividends with PEGY ratios above 2.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2021/3/2/20926831-1614736143105142.png\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">The compound annual return that the company is striving for in the future is of course predicated on the valuation given to the equity by the market. The current 18 PE ratio may or may not be sustainable if you believe we are heading for a sustained period of higher rates, leading to lower valuations for Dominion and utility companies in general.</p> <p class=\"paywall-full-content invisible\">The historical median PE ratio over the last 13 years for Dominion is 22.85, indicating that if rates do stay in a lower band, the stock represents quite a good value currently if the company is able to achieve its growth targets.</p> <h2 class=\"paywall-full-content invisible\">Bottom Line</h2> <p class=\"paywall-full-content invisible\">I began my first trip investing in Dominion near the end of 2014 and it became one of my favorite investments due to the favorable jurisdictions in which it operated, the comparatively high dividend yield it paid and what I viewed as solid management that nearly always hit their targets.</p> <p class=\"paywall-full-content invisible\">In July 2020, all of that built up good will went flying out the window when I glossed over the highlights of the \"business update\" the company provided, with my eyes only registering the massive EPS drop and the 33% dividend cut. I felt myself lucky to be able to sell the shares I held faithfully for so long at $82 as the market did not seem to react initially to the news.</p> <p class=\"paywall-full-content invisible\">As I stepped back and viewed the transaction with fresh eyes, I was able to process and appreciate the thinking and strategy behind the move and the merits of the asset sale. I am now able to see and appreciate the company for what it has become. They have become strictly (90%) a regulated utility with a fantastic growth profile, a solid balance sheet, a secure and (now) growing dividend and a company trading at a solid discount to its peers on a PEGY ratio basis.</p> <p class=\"paywall-full-content invisible\">With the recent, in my view, unwarranted sell-off in the utility sector, I took the opportunity to rebuild my position in Dominion at $70, which I view as a fantastic long term entry point.</p> <p class=\"paywall-full-content invisible\">The irony is that I was able to avoid almost the entire sell-off from this transition and in the market by hastily selling my shares upon learning of the transformation and was able to re-enter the name with 17% more shares than I began with.</p> <p class=\"paywall-full-content invisible\">Sometimes it is better to be lucky than good!</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Thank you for reading and good luck!</p>", "twitContent": "$D - Dominion Energy: Buying Back In After A 6-Month Mental Health Break. https://seekingalpha.com/article/4410972-dominion-energy-buying-back-in-after-6-month-mental-health-break?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104051", "type": "author"}}, "sentiments": {"data": [{"id": "315703", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "578082", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "18027", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "18029", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4410972-dominion-energy-buying-back-in-after-6-month-mental-health-break", "canonical": "https://seekingalpha.com/article/4410972-dominion-energy-buying-back-in-after-6-month-mental-health-break", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912060/image_1224912060.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "104051", "type": "author", "attributes": {"company": null, "slug": "confounded-interest", "userId": 20926831, "tagId": 578082, "bio": "<p>I work in the financial and property management industry for a well known, publicly traded \"mini Berkshire\" Insurance company. I focus on portfolio structure, value, reasonably priced growth, tech and biotech spaces. I passed the series 6 and 7 exams at age 18 but do not at this time have active licenses.</p><p>My passion for investing and personal finance education began at a very early age. I opened my first brokerage account at the age of 12 and have invested through crashes, crises, recessions and bubbles. I have made many mistakes in both my personal and investing lives, however, each mistake I have made has taught me valuable lessons on my journey, both in life and towards financial independence. </p><p>As of March 2023, my total portfolio has compounded at 10.2% per year since 1993, beating the S&P 500's return of 9.87% over the same time period. </p><p>I do not currently hold active licenses and I am not a financial advisor and do not give out or publish investment advice. Articles I write are my opinion only and are not solicitations, please seek guidance from a licensed financial advisor before investing in any security. </p><p>Opinions expressed in my articles are my own and do not reflect or indicate any positions or opinions held of my primary employer. </p>", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/020/926/831/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/020/926/831/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/020/926/831/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/020/926/831/extra_large_pic.png"}, "nick": "Confoundedinterest", "deactivated": null, "memberSince": 2014, "isRss": false, "contributorSince": 2017, "followersCount": 7939}, "relationships": {"user": {"data": {"id": "20926831", "type": "user"}}, "userBioTags": {"data": [{"id": "936517", "type": "userBioTag"}, {"id": "936518", "type": "userBioTag"}, {"id": "936519", "type": "userBioTag"}, {"id": "936520", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/confounded-interest", "profileUrl": "/author/confounded-interest", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "55", "type": "sector"}}}, "links": {"self": "/symbol/D"}}, {"id": "578082", "type": "tag", "attributes": {"slug": "confounded-interest", "name": "Confounded Interest", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/confounded-interest"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "18027", "type": "tag", "attributes": {"slug": "utilities", "name": "Utilities", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/utilities"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "18029", "type": "tag", "attributes": {"slug": "electric-utilities", "name": "Electric Utilities", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/electric-utilities"}}, {"id": "315703", "type": "sentiment", "attributes": {"articleId": 4410972, "type": "very_bullish", "createdAt": "2021-03-03T06:34:42.000-05:00", "typeId": 0}, "relationships": {"article": {"data": {"id": "4410972", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}