{"data": {"id": "4575537", "type": "fullArticle", "attributes": {"publishOn": "2023-02-06T05:54:10-05:00", "isLockedPro": false, "commentCount": 8, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"daan-rijnberk": {"id": 644134, "slug": "daan-rijnberk", "kind": "common", "non_theme": true}, "qcom": {"id": 1168, "slug": "qcom", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "earnings": {"id": 10, "slug": "earnings", "kind": "breadcrumb", "path": "/earnings/earnings-analysis", "title": "Earnings Analysis", "sasource": "theme_breadcrumb"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "information-technology": {"id": 45, "slug": "information-technology", "kind": "sector", "path": "/stock-ideas/technology", "title": "Tech ", "sasource": "theme_breadcrumb"}}, "title": "Qualcomm: Facing Headwinds, But Still Looking Strong (Rating Maintained)", "summary": ["Qualcomm delivered financial results in line with analyst estimates as the business was hit by inventory corrections by customers.", "While Qualcomm will see near-term pressure from economic headwinds and inventory corrections, the long-term growth drivers remain strong.", "Qualcomm is exposed to several high growth industries like IoT, 5G, and Automotive.", "Qualcomm looks undervalued as I calculate a target price of $190 based on FY24 EPS estimates translating to over 40% upside potential."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-02-06T05:54:10-05:00", "isModerated": false, "closestTradingDate": "2023-02-06", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 5, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of QCOM either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w750\" alt=\"Qualcomm Office Building in San Diego, California\" data-id=\"1390379868\" data-type=\"getty-image\" width=\"1536px\" height=\"1017px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">AutumnSkyPhotography</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Introduction</h2> <p>On the 2nd of February 2023, Qualcomm (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/QCOM\" title=\"QUALCOMM Incorporated\">QCOM</a></span>) released its 1Q23 financial results. Expectations were rather low before the earnings release due to Qualcomm’s significant exposure to the mobile handset market as this industry is seeing significant<span class=\"paywall-full-content invisible\"> weakness as the result of lower consumer spending. This is what I concluded back in my November article regarding the business outlook from Qualcomm:</span></p> <blockquote class=\"paywall-full-content invisible\"><p>Qualcomm has guided for 1Q23 revenue of $9.2 - $10 billion and EPS of $1.72 - $1.92. Both are below last quarter’s revenue and EPS and below analyst estimates. Analysts guided for revenue of $12.05 billion and EPS of $3.34. It should not really come as any surprise as there is a global slowdown in consumer spending and an increase in inventory in many categories. Qualcomm was never going to be immune to this and I just think analysts were still being way too optimistic about the outlook for Qualcomm. A slowdown was inevitable and here it is.</p></blockquote> <p class=\"paywall-full-content invisible\">At first glance, results looked decent but in no way particularly good. Despite this, the first reaction in aftermarket trading was a 3% increase in share price. Qualcomm managed to beat the EPS <a href=\"https://seekingalpha.com/news/3931507-qualcomm-fq1-results-mixed-cos-fq2-2023-guidance-in-line-with-estimates\">consensus</a> by a meager $0.02 and missed ever so slightly on revenue by $110 million. Overall, results were very much in line with the low expectations from Wall Street and Qualcomm seems to, indeed, be struggling with lower consumer spending and inventory corrections.</p> <p class=\"paywall-full-content invisible\">The outlook for the current quarter coming from Qualcomm management wasn’t especially good either with the analyst outlook sitting at the high end of the outlook given off by Qualcomm. Eventually, the stock price finished the next trading day flat after losing about 2% at the opening.</p> <p class=\"paywall-full-content invisible\">I wrote my initial thesis on the company back in October and back then I called the company <a href=\"https://seekingalpha.com/article/4553407-qualcomm-a-bear-market-opportunity\">a bear market opportunity</a> as the stock looked extremely undervalued back then. I rated the company a buy as a result. I concluded that Qualcomm had excellent exposure to high-growth industries like IoT, 5G, and automotive. Qualcomm has an excellent position in all its main markets and its Snapdragon product line are some of the best in the industry.</p> <p class=\"paywall-full-content invisible\">Still, besides the excellent exposure to high-growth industries, I also concluded that the handset industry remained to be the most important one for Qualcomm as its handset segment accounted for the largest part of revenue. This did expose the company to a significant drop in handset sales due to high inflation and a deteriorating economy as seen in its 4Q22 results and now again in its 1Q23 results.</p> <p class=\"paywall-full-content invisible\">Qualcomm was a very clear buy back in November, but the stock price has increased by 26% since then and outperformed the SP500 performance (9%) over the same period. In addition to this, the latest financial results show weakness in some of the business segments of Qualcomm resulting in lower earnings growth.</p> <p class=\"paywall-full-content invisible\">My buy rating from November was based on the company’s share price and long-term prospects and so I believe investors should try looking through near-term weakness and focus on the long-term growth potential. Still, it is important to consider whether now is still a good time to buy the company after its recent outperformance and financial results, or whether it is better to stay on the sidelines for now.</p> <p class=\"paywall-full-content invisible\">Within this article I will review my investment thesis and buy rating for Qualcomm by going through its latest earnings results, valuation, balance sheet, and check in on both the near-term and long-term outlook.</p> <h2 class=\"paywall-full-content invisible\">Quarterly review</h2> <p class=\"paywall-full-content invisible\">Qualcomm <a href=\"https://d1io3yog0oux5.cloudfront.net/_2a1750e0d11abb574f35a916c289a20c/qualcomm/db/773/7221/file/FY+2023+1st+Quarter+Earnings+Release.pdf\" rel=\"nofollow\">reported</a> a drop in revenue of 12% YoY to $9.5 billion which was primarily due to the drop in its handset segment for which revenue fell by 18% YoY and to only $5.8 billion. This might look very bad when you first look at it, but this result was largely as expected. Handset demand fell drastically as consumers postpone large unnecessary purchases due to high inflation and the threat of a potential recession. With handsets accounting for the largest part of the revenue from Qualcomm, this seriously impacted the growth rate and it will continue to do so for at least the first half of 2023 with <a href=\"https://seekingalpha.com/news/3930463-device-shipments-take-a-hit-in-2022-44-downfall-expected-in-2023\">smartphone shipments</a> expected to be 4% lower compared to 2022. In the end, the business simply continues to be cyclical which does not have to hurt long term returns, but offers good buying opportunities.</p> <p class=\"paywall-full-content invisible\">It should be said that the current downturn in handset demand is really only temporary and should not pose to be a long-term drag on revenue growth for Qualcomm. As a shareholder, I personally really appreciate their exposure to this incredibly strong, but cyclical, industry. Qualcomm is one of the largest players in the growing smartphone semiconductor market with a 31% market share worldwide as of the third quarter of 2022 according to Counterpoint Research. The only one with a larger share is MediaTek with 35% while Apple (<a href=\"https://seekingalpha.com/symbol/AAPL\" title=\"Apple Inc.\">AAPL</a>) only has a <a href=\"https://www.counterpointresearch.com/global-smartphone-ap-market-share/%20\" rel=\"nofollow\">16% market share</a>. With the smartphone industry still expected to grow at a <a href=\"https://www.globenewswire.com/en/news-release/2022/11/03/2547502/0/en/Smartphone-Market-Size-2022-2029-Exhibits-7-3-CAGR-to-Reach-USD-792-51-Billion-in-2029.html#:~:text=As%20per%20the%20report%2C%20the,forecast%20period%2C%202022%2D2029.%20\" rel=\"nofollow\">7.3% CAGR</a> until 2029, there are really not many worries for Qualcomm, which has kept its market share relatively stable over the past 5 years as illustrated below. What I am trying to point out here is that while the near-term pressure on the handset segment might be pushing down on growth for Qualcomm, the long-term effects of its exposure to the industry will be going in the opposite way and so any long-term investor really should not be worried. Fundamentally the handset segment for Qualcomm remains strong.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-16754574359702406_origin.png\" rel=\"lightbox\" data-width=\"1389\" data-height=\"691\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-16754574359702406.png\" alt=\"Smartphone semiconductor market share\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Smartphone semiconductor market share <span>(Counterpoint)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">The QCT business segment overall (Qualcomm CDMA Technologies), which involves the automotive, handset, and IoT product revenues, saw revenue fall by 11% YoY which was, again, due to the fall in handset sales. Still, this was partially offset by strength in both automotive and IoT which grew revenue by 58% and 7%, respectively. Both of these segments remain relatively small for Qualcomm, but the growth for both segments must be seen as encouraging for investors. Automotive revenue was $456 million, and growth was driven by a continued unprecedented growth rate (to steal the <a href=\"https://seekingalpha.com/article/4574897-qualcomm-incorporated-qcom-q1-2023-earnings-call-transcript\">words from CEO Amon</a>) of the automotive industry due to the continued adoption of digital technologies.</p> <blockquote class=\"paywall-full-content invisible\"><p>The software-defined vehicle is at the core of this transformation offering automakers a significant opportunity to deliver enhanced connectivity, improve safety and security features, increased levels of autonomy, as well as new business models and revenue streams. We believe the Snapdragon Digital Chassis is the industry's preferred purpose-built platform to help drive this innovation for the next generation of vehicles.</p></blockquote> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-1675457436685631_origin.png\" rel=\"lightbox\" data-width=\"1536\" data-height=\"908\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-1675457436685631.png\" alt=\"1Q23 performance\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">1Q23 performance <span>(Qualcomm)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Qualcomm remains focused on expanding its automotive offering resulting in an increasingly large backlog. Qualcomm already offers a large stack software solution for car software systems, connectivity, and self-driving functionalities. This is what I wrote back in November, and it very well illustrates the potential for the automotive segment and the moat Qualcomm already has:</p> <blockquote class=\"paywall-full-content invisible\"><p>The autonomous driving industry is a very challenging one with a lot of competition from the likes of Mobileye (<a href=\"https://seekingalpha.com/symbol/MBLY\" title=\"Mobileye Global Inc.\">MBLY</a>), Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>), Tesla (<a href=\"https://seekingalpha.com/symbol/TSLA\" title=\"Tesla, Inc.\">TSLA</a>), and Waymo (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>) (<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a>), for example. According to a recent report, the global market for autonomous driving chipsets alone is expected to reach $7.77 billion by 2025, from $1.83 billion in 2019. This is a very strong 38% CAGR. Qualcomm currently already dominates the automotive connectivity chipset market with an 80% market share and is therefore well positioned to expand this offering into the autonomous driving space.</p></blockquote> <p class=\"paywall-full-content invisible\">We should expect the automotive segment to see continued growth and become a larger piece of total revenue for Qualcomm over the next several years.</p> <p class=\"paywall-full-content invisible\">The IoT product segment revenue came in at $1.7 billion and represented 21% of QCT revenue. For FY22 IoT revenue grew by 37% YoY, so we are seeing a slowdown for this segment as well. Yet, during the earnings call, CEO Amon once again confirmed that he believes that the IoT segment will become the largest addressable market for Qualcomm with revenue streams spanning across three categories: Consumer, Edge Networking and Industrial. According to Fortune Business Insights, the IoT industry is expected to grow at a <a href=\"https://www.fortunebusinessinsights.com/industry-reports/internet-of-things-iot-market-100307\" rel=\"nofollow\">26.4% CAGR</a> until 2029 and reach a massive market size of $2.5 trillion. The IoT industry is massive and includes many different applications, but all these applications have one thing in common – semiconductors and key connectivity. Qualcomm also holds a strong position in this industry through its technology leadership and key partnerships with Microsoft (<a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a>), Amazon (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>), Zoom (<a href=\"https://seekingalpha.com/symbol/ZM\" title=\"Zoom Communications Inc.\">ZM</a>), VMware (<a href=\"https://seekingalpha.com/symbol/VMW\" class=\"ticker-link\">VMW</a>), Cisco (<a href=\"https://seekingalpha.com/symbol/CSCO\" title=\"Cisco Systems, Inc.\">CSCO</a>), and CrowdStrike (<a href=\"https://seekingalpha.com/symbol/CRWD\" title=\"CrowdStrike Holdings, Inc.\">CRWD</a>). CEO Amon confirmed the technological leadership of Qualcomm during the latest earnings call as Qualcomm keeps gaining market share across key industries:</p> <blockquote class=\"paywall-full-content invisible\"><p>In Edge Networking IoT, our Wi-Fi infrastructure and networking products continue to gain share, led by strength and enterprise Wi-Fi access points in carrier gateways. We see several trends that are favorable to our Wi-Fi solutions. Wi-Fi mesh networking continues to grow in popularity worldwide increasing the number of Wi-Fi chipsets installed per home. The hybrid work trend appears to have had lasting impacts on enterprise networking with workers relying on real-time collaboration tools regardless of whether they are in the office or remote.</p></blockquote> <p class=\"paywall-full-content invisible\">For the QTL segment (Qualcomm technology licensing) Qualcomm recorded revenue of $1.52 billion which was a decrease of 16% YoY. The QTL segment has seen very slow growth for a number of years, and I do not expect it to be a significant factor for an investment in Qualcomm.</p> <p class=\"paywall-full-content invisible\">Margins for Qualcomm were hit even harder than revenue by the slowing economy as Qualcomm had kept increasing its R&amp;D spent to increase market share and technological advantage. Net income for the quarter was $2.7 billion and decreased by 27% resulting in EPS of $2.37 which fell by the same 27%.</p> <p class=\"paywall-full-content invisible\">Overall, it was a decent quarter for Qualcomm, performing roughly in line with downbeat analyst estimates. While the business is hit by near-term headwinds regarding economic weakness, which causes a drop in revenue, I believe the company is still extremely well positioned for future growth and fundamentally still very strong. I recommend looking through the near-term weakness as the long-term growth drivers are obvious. Qualcomm continues to diversify the business making sure it is less dependent on revenue from handsets as it continues to have a very strong product portfolio overall.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-16754574363679206_origin.png\" rel=\"lightbox\" data-width=\"1382\" data-height=\"908\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-16754574363679206.png\" alt=\"Qualcomm 1Q23 performance\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Qualcomm 1Q23 performance <span>(Qualcomm)</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">Balance sheet &amp; dividend</h2> <p class=\"paywall-full-content invisible\">Qualcomm has a strong balance sheet with a solid <a href=\"https://d1io3yog0oux5.cloudfront.net/_2a1750e0d11abb574f35a916c289a20c/qualcomm/db/773/7222/file/FY2023+1st+Quarter+Earnings+Presentation.pdf\" rel=\"nofollow\">$8.2 billion</a> in cash which leaves it with plenty of room to keep investing in the business and technologies when the economy deteriorates further. Still, Qualcomm has seen its balance sheet deteriorate over the last year with cash coming down significantly and debt rising slightly as shown below. While this trend is not going in the right direction, I am not immediately worried. I hope Qualcomm can avoid increasing debt over the next year with current interest rates and use its cash balance to compensate for lower revenue and profits.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-16754574357378747_origin.png\" rel=\"lightbox\" data-width=\"1385\" data-height=\"195\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-16754574357378747.png\" alt=\"Afbeelding met buiten Automatisch gegenereerde beschrijving\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Qualcomm balance sheet <span>(Qualcomm)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Despite the worsening of the economy and balance sheet deterioration, Qualcomm continues to return cash to shareholders. During the latest quarter, Qualcomm returned $2.1 billion to shareholders through both dividends ($842 million) and share repurchases ($1.3 billion).</p> <p class=\"paywall-full-content invisible\">Shares currently yield 2.21% which is very decent, especially for a growing semiconductor company. The dividend growth rate over the last 5 years is “only” 5.5% which is not that great, but with a payout ratio of only 23%, it does offer a lot of upside potential and dividend safety even if profits continue to fall. Qualcomm has been growing its dividend for 19 straight years and so has a strong track record to hold up. Qualcomm receives strong ratings from Seeking Alpha for all aspects of its dividend confirming the solid payout, yield, and safety.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-16754574363640766_origin.png\" rel=\"lightbox\" data-width=\"1570\" data-height=\"336\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-16754574363640766.png\" alt=\"graph\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Qualcomm dividend grades <span>(Seeking Alpha)</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">Outlook &amp; Valuation</h2> <p class=\"paywall-full-content invisible\">Most important to investors right now might be the outlook given off by management considering the uncertain economic outlook and the continued threat of a recession.</p> <p class=\"paywall-full-content invisible\">The most significant headwind for the near-term outlook is the negative outlook for smartphone sales which is, as discussed, the most important product category for Qualcomm. Qualcomm currently expects the smartphone volumes for calendar 2023 to come in lower than 2022 despite the reopening of China functioning as a tailwind. This is primarily due to supply chain issues easing which results in elevated inventory for Qualcomm customers. Qualcomm expects customers for QCT segment products to continue lowering their inventories which according to Qualcomm will take at least another two quarters to normalize. By the second half of 2023, Qualcomm expects the situation to improve and says it is ready to act when the normalization and renewed demand kicks in.</p> <p class=\"paywall-full-content invisible\">Qualcomm expects that it will continue investing in the business mainly focusing on IoT and automotive development, while it will reduce spending on handsets and SG&amp;A to save costs.</p> <p class=\"paywall-full-content invisible\">As a result of the above-discussed headwinds, Qualcomm guides for 2Q23 revenue of between $8.7 and $9.5 billion with EPS of $2.05 to $2.25. These estimates reflect the seasonal drop in handset sales. Qualcomm overall expects automotive and handsets to be flat sequentially while IoT is expected to decline due to the above-discussed headwinds.</p> <p class=\"paywall-full-content invisible\">According to Seeking Alpha, current analyst estimates guide for next quarter's revenue of $9.16 billion, revised down slightly following the earnings results. In addition to this, analysts expect an EPS of $2.15. Both are around the midpoint of guidance by management.</p> <p class=\"paywall-full-content invisible\">For the FY23 analysts now guide for revenue of $38.67 billion or a YoY decrease of 12.44% with EPS of $9.33, decreasing by 25.56%. Wall Street analysts also expect a slight recovery in revenue and EPS by Qualcomm’s 4Q23 and a further recovery in the following quarters.</p> <p class=\"paywall-full-content invisible\">I tend to largely agree with analyst estimates for FY23 as revenue and EPS will clearly be impacted, yet I believe analysts remain to be overly negative on the long-term growth prospects of Qualcomm as they guide for FY24 revenue growth of 14% and FY25 revenue growth of 0%. To me, these estimates are way too low and we should see Qualcomm recover at a more rapid pace for FY24 to continue its growth by FY25 driven by the multiple secular trends Qualcomm is exposed to like its strong presence in automotive and IoT.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-1675457435907492_origin.png\" rel=\"lightbox\" data-width=\"1385\" data-height=\"178\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-1675457435907492.png\" alt=\"graph\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Revenue estimate <span>(Seeking Alpha)</span></p></figcaption></figure><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-16754574358224595_origin.png\" rel=\"lightbox\" data-width=\"1385\" data-height=\"178\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/3/55767760-16754574358224595.png\" alt=\"graph\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">EPS estimates <span>(Seeking Alpha)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Based on current FY23 EPS estimates from analysts, Qualcomm is valued at a forward P/E of just 13.31 which is 24% below its 5-year average P/E of 17.53 and over 38% below the sector median. I believe that Qualcomm deserves P/E of at least 16, but probably closer to 18.</p> <p class=\"paywall-full-content invisible\">For now, I will stay conservative and assume a 16x P/E ratio. Based on current FY24 EPS estimates from analysts, I calculate a price target of $190.72, representing close to 41% upside potential from current levels.</p> <h2 class=\"paywall-full-content invisible\">Risks</h2> <p class=\"paywall-full-content invisible\">Alongside the risk of a further deterioration of the economy resulting in a recession, which would impact the near-term outlook for Qualcomm and its target price, there are two other risks to take into account. I discussed both of these in my previous article on the company and nothing really changed since. Back then I said the following:</p> <blockquote class=\"paywall-full-content invisible\"> <p> </p> <p>Where the global phone market is expected to drop, Apple reported another increase in iPhone sales during their latest quarter. Apple uses the 5G modem chip from Qualcomm to power its iPhone 5G connection. Apple has been working on building its own modem chip for a couple of years now. Last June a report came out that Apple once again failed to build its own chip and was forced to keep using the 5G modem chip from Qualcomm. In 2019, Apple bought the modem division from Intel, and ever since there has been the threat of Apple being able to make its own 5G modem. Since Apple is the largest customer of Qualcomm, losing Apple as a customer would have a significant impact on revenue. Since Apple failed so far, it was forced to sign a new agreement with Qualcomm to keep using its modems until 2026 (in 2019 after multiple lawsuits). Apple does keep challenging Qualcomm and the threat of losing Apple as a customer will remain, as explained in this report.</p> <p>The final risk I would like to discuss is the lawsuit ARM launched against Qualcomm about using its patents. The suit threatens Qualcomm’s expansion plans as it was trying to use Nuvia to compete more directly with Apple chips and to possibly crack the server chip market, which is a huge growth industry. Qualcomm acquired Nuvia at a price of $1.4 billion in 2021. The ARM licenses are crucial if it wants to expand into the data center market, where Intel and AMD are currently the most dominant. The acquisition would enable Qualcomm to produce chips competitive to the M-series in the Mac computers from Apple. To produce these products, it used the ARM licenses which Nuvia owned. ARM says the license didn’t transfer to Qualcomm when it bought Nuvia. ARM says Qualcomm needed its consent to use Nuvia’s custom core designs and terminated the Nuvia license in March 2022. The lawsuit won’t have an incremental impact on revenue for Qualcomm, but it will be crucial to its future growth plans and expansion plans into the CPU business for laptops and data centers. We will have to wait and see how this works out, but I left these growth opportunities out of this report, as these were still too much of a guess for now.</p> </blockquote> <h2 class=\"paywall-full-content invisible\">Conclusion</h2> <p class=\"paywall-full-content invisible\">CEO Amon <a href=\"https://seekingalpha.com/news/3925104-qualcomm-ceo-chip-industry-will-resume-growth-could-double-production-in-a-decade\">recently stated</a> that we are currently living in a very interesting time for semiconductors and the technology industry. In an interview with CNBC, the CEO said that he believes that the production of semiconductors will need to double over the next decade due to the acceleration in digital transformation across every single industry. The future of the economy is digital, and we will see strong continued growth for the semiconductor industry. The same prediction was made by ASML (<a href=\"https://seekingalpha.com/symbol/ASML\" title=\"ASML Holding N.V.\">ASML</a>) back in its investor day in November 2022 as it saw significant demand for its products from customers.</p> <p class=\"paywall-full-content invisible\">While the long-term outlook is indeed strong, Qualcomm will continue to be impacted by near-term economic weakness which will be a drag on share price growth for the next 6 months and it might cause for lower price levels, and therefore better entry points. Also, a potential recession would significantly impact consumer spending and keep smartphone shipments suppressed for a longer time period. I do believe a lot of this potential downside is priced into the stock price already. This also includes the risk carried by the revenue exposure to Apple which has also been a drag on its valuation. Apple does not seem to be able to produce a chip before 2025 to replace the 5G chips from Qualcomm and the exposure to Apple has been decreasing, offsetting the risk. Also, Qualcomm recently <a href=\"https://www.fosspatents.com/2022/07/qualcomm-samsung-sign-seven-year.html\" rel=\"nofollow\">announced</a> a promising licensing deal with Samsung until 2030 which could also reduce the Apple risk.</p> <p class=\"paywall-full-content invisible\">Overall, I remain ultra-bullish on the semiconductor industry and Qualcomm is one of my top long-term growth picks due to its business strength, strong market share across its product lines, and excellent exposure to high-growth industries such as connectivity, 5G, IoT, and automotive. Qualcomm will have a couple of tough quarters ahead, but the company is in an excellent position to benefit from semiconductor demand over the year to come.</p> <p class=\"paywall-full-content invisible\">Back in November, I rated Qualcomm a buy for the exact same reasons, and with the earnings report not surprising in any way, it also did not change one thing about my thesis. Despite the 26% increase in share price since my previous article, I still believe Qualcomm is undervalued and offers plenty of upside to warrant another buy rating.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">I calculate a target price of $190 based on FY24 EPS estimates by analysts and believe the company is a buy at any price below $150 as this still leaves enough upside potential. Of course, I know the near-term outlook is not great and the stock could definitely see some weakness over the next several months. Still, the long-term outlook outweighs near-term weakness.</p>", "twitContent": "$QCOM - Qualcomm: Facing Headwinds, But Still Looking Strong (Rating Maintained). https://seekingalpha.com/article/4575537-qualcomm-q1-earnings-headwinds-still-strong-rating-maintained?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "106771", "type": "author"}}, "sentiments": {"data": [{"id": "435674", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "1168", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "644134", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "10", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4575537-qualcomm-q1-earnings-headwinds-still-strong-rating-maintained", "canonical": "https://seekingalpha.com/article/4575537-qualcomm-q1-earnings-headwinds-still-strong-rating-maintained", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "106771", "type": "author", "attributes": {"company": null, "slug": "daan-rijnberk", "userId": 55767760, "tagId": 644134, "bio": "<p>Daan Rijnberk is an independent investor and author who focuses on finding businesses with a strong moat, healthy financials, and a promising growth outlook to deliver investors stable and above-average long-term profits. This includes a combination of both value and growth opportunities across industries to help readers build well-diversified portfolios. </p><p>The articles aim not to make quick gains but to achieve long-term sustainable growth by identifying the most promising opportunities in the markets at a fair price. The leading strategy is to buy and hold for as long as the investment thesis is intact. Therefore, an update on most of the covered equities will be provided<span> every 3-6 (In some cases 12) months to keep the rating and thesis up-to-date. </span></p><p>Built upon professional experience and personal interests, Daan has specific expertise in semiconductors and fintech. <br></p><p>Articles and analyses are published exclusively on Seeking Alpha. <br></p>", "image": {"small": "https://static.seekingalpha.com/images/users_profile/055/767/760/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/055/767/760/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/055/767/760/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/055/767/760/extra_large_pic.png"}, "nick": "Daan Rijnberk", "deactivated": null, "memberSince": 2022, "isRss": false, "contributorSince": 2022, "followersCount": 1707}, "relationships": {"user": {"data": {"id": "55767760", "type": "user"}}, "userBioTags": {"data": [{"id": "1005383", "type": "userBioTag"}, {"id": "1005384", "type": "userBioTag"}, {"id": "1005385", "type": "userBioTag"}, {"id": "1005386", "type": "userBioTag"}, {"id": "1005387", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/daan-rijnberk", "profileUrl": "/author/daan-rijnberk", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "1168", "type": "tag", "attributes": {"slug": "qcom", "name": "QCOM", "company": "QUALCOMM Incorporated", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "45", "type": "sector"}}}, "links": {"self": "/symbol/QCOM"}}, {"id": "644134", "type": "tag", "attributes": {"slug": "daan-rijnberk", "name": "Daan Rijnberk", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/daan-rijnberk"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "10", "type": "tag", "attributes": {"slug": "earnings", "name": "Earnings", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/earnings"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "435674", "type": "sentiment", "attributes": {"articleId": 4575537, "type": "bullish", "createdAt": "2023-02-06T05:54:10.000-05:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4575537", "type": "article"}}, "tag": {"data": {"id": "1168", "type": "tag"}}}}]}