{"data": {"id": "4577887", "type": "fullArticle", "attributes": {"publishOn": "2023-02-13T15:37:06-05:00", "isLockedPro": false, "commentCount": 25, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"joe-albano": {"id": 464145, "slug": "joe-albano", "kind": "common", "non_theme": true}, "garp-theme": {"id": 143031, "slug": "garp-theme", "kind": "common", "non_theme": true}, "changing-market": {"id": 142771, "slug": "changing-market", "kind": "common", "non_theme": true}, "cyclical-swing": {"id": 142781, "slug": "cyclical-swing", "kind": "common", "non_theme": true}, "industry-leader": {"id": 548926, "slug": "industry-leader", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "qcom": {"id": 1168, "slug": "qcom", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "article-outreach": {"id": 615773, "slug": "article-outreach", "kind": "general"}, "article-outreach-reward": {"id": 681760, "slug": "article-outreach-reward", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "alpha-rich-opportunity": {"id": 114692, "slug": "alpha-rich-opportunity", "kind": "general"}, "alpha-rich-investment-style": {"id": 114682, "slug": "alpha-rich-investment-style", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "information-technology": {"id": 45, "slug": "information-technology", "kind": "sector", "path": "/stock-ideas/technology", "title": "Tech ", "sasource": "theme_breadcrumb"}}, "title": "Qualcomm: Focus On The Diversity Strategy While Enjoying Strong Free Cash Flow", "summary": ["Qualcomm is in the middle of a weak industry-wide mobile handset environment, but it continues to see strength in its top-tier chipsets.", "Its diversification strategy continues to move forward and will continue to further offset handset weakness.", "While the company deals with a broad market mobile demand correction, its free cash flow and ability to service debt have been exceptional.", "The company remains undervalued despite this weak demand environment through diverse revenue streams and prudent capital allocation."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-02-13T15:38:12-05:00", "isModerated": false, "closestTradingDate": "2023-02-13", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 8, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of QCOM either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-w750\" alt=\"Las Vegas Hosts Annual CES Trade Show\" data-id=\"1362782272\" data-type=\"getty-image\" width=\"4415px\" height=\"3380px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Ethan Miller</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <p>It's no secret there's a weak smartphone and mobile market, and we're in the thick of it. It's also no secret semiconductor companies serving the mobile market are seeing weakness in their business as reflected in ailing or negative revenue growth. Qualcomm (<span class=\"ticker-hover-wrapper paywall-full-content invisible\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/QCOM\" title=\"QUALCOMM Incorporated\">QCOM</a></span><span class=\"paywall-full-content invisible\">) isn't excluded from this weakness, which can turn off investors. But it's essential to focus on the advantages Qualcomm has in its leading handset products but, more importantly, its diversification strategy away from the economically cyclical industry of mobile while maintaining strong free cash flow. Its recent earnings report maintains progress is being made toward this goal.</span></p> <h2 class=\"paywall-full-content invisible\">Diversification Remains On Track</h2> <p class=\"paywall-full-content invisible\">This quarter proved the diversification strategy away from a relatively touchy mobile market is the key to Qualcomm growing over the next 10 years. Qualcomm's major product remains mobile chips, and has a natural, though nuanced, correlation with the mobile handset market. This quarter was no different, with a drop in handset revenues. But I continue to like the growth Qualcomm is seeing outside of handsets.</p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2023/2/11/15511982-16761698028986948.png\" alt=\"Qualcomm's QCT revenue FQ1 '23\" contenteditable=\"false\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\"><span>Qualcomm's FQ1 '23 Earnings Release</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">Automotive saw a 58% increase year-over-year, while IoT saw a 7% increase. Handsets, as expected, saw a drop of 18% from the year-ago period. To be clear, in FQ4 '22, the company began consolidating RF front-end (RFFE) revenues into each of the three segments above.</p> <blockquote class=\"paywall-full-content invisible\"> <p> </p> <p><em>...starting in fiscal '23, we will consolidate RF front-end revenues within handsets, automotive and IoT revenue streams.</em></p> <p>- Akash Palkhiwala, CFO, FQ4 '22 Earnings Call</p> </blockquote> <p class=\"paywall-full-content invisible\">However, the FQ1 FY22 numbers shown in the FQ1 FY23 revenue stream breakdown have been restated by the company to align the year-over-year numbers for one-to-one comparisons. The FQ1 report, as it showed last year, had Handsets with revenue of $5,983M. Therefore, using the restated revenue as shown above, 89% of RFFE's revenue was factored into Handsets. Just under 3% went toward automotive, while the remaining ~8% went toward IoT.</p> <p class=\"paywall-full-content invisible\">Therefore, it's safe to make growth calculations and assumptions using the current report, and Automotive, for example, truly grew 58%.</p> <p class=\"paywall-full-content invisible\">This is important because it emphasizes the strategy of moving toward other areas of growth and away from stagnating areas like mobile handsets.</p> <p class=\"paywall-full-content invisible\">Of course, ignoring Handsets wouldn't be prudent while discussing diversification away from it, as 73% of QCT revenues are still derived from the segment. Moreover, ignoring the segment also would throw the baby out with the bathwater as the company continues to see strength in the higher-tier chipsets.</p> <blockquote class=\"paywall-full-content invisible\"> <p> </p> <p><em>...lower handsets revenues, primarily driven by $1.5 billion in lower chipset shipments to certain major OEMs...partially offset by <strong>$344 million in higher revenues per chipset from favorable mix toward higher-tier 5G products</strong> <strong>and increases in average selling prices...</strong></em></p> <p>- Qualcomm's <a href=\"https://investor.qualcomm.com/financial-information/sec-filings/content/0000804328-23-000006/0000804328-23-000006.pdf\" rel=\"nofollow\" title=\"https://investor.qualcomm.com/financial-information/sec-filings/content/0000804328-23-000006/0000804328-23-000006.pdf\" target=\"_blank\">FQ1 '23 10-K</a></p> </blockquote> <p class=\"paywall-full-content invisible\">This strength in Handsets amid the weakening backdrop is why Qualcomm remains the leader. Its leading chipsets allow it to sell higher-tier in-demand products while lower tiers see sharply weaker demand.</p> <p class=\"paywall-full-content invisible\">But the actions taken to limit mobile weakness can affect the entire company and its diversification strategy. And due to the expectation Handsets will remain pressured throughout the first half of 2023 - a theme becoming more common as this earning season rolls on - management is reducing operating expenses by 5% from the exit rate of FY22.</p> <blockquote class=\"paywall-full-content invisible\"> <p> </p> <p><em>As the handset industry continues to experience reduced demand, we are now expecting elevated channel inventory levels to persist at least through the first half of calendar ‘23.</em></p> <p><em>...</em></p> <p><em>Given the current macroeconomic and demand environment, we’re implementing further spending reductions..<span id=\"jS$589\" class=\"j3\">. we</span> expect to reduce non-GAAP operating expenses by approximately 5% relative to a run rate exiting fiscal ‘22.</em></p> <p>- Cristiano Amon, CEO, <a href=\"https://seekingalpha.com/article/4574897-qualcomm-incorporated-qcom-q1-2023-earnings-call-transcript\" title=\"https://seekingalpha.com/article/4574897-qualcomm-incorporated-qcom-q1-2023-earnings-call-transcript\" target=\"_blank\">FQ1 '23 Earnings Call</a></p> </blockquote> <p class=\"paywall-full-content invisible\">This begs the question on visibility and how well the company can see into the latter half of the year. Of course, this has been a burning question among semiconductor investors as it has been a difficult season to predict the next quarter, let alone the next six-to-nine months. But the CFO sounded confident in his assessment of the rest of the year, and the company is positioning to be ready when demand turns around.</p> <blockquote class=\"paywall-full-content invisible\"> <p> </p> <p><em>At this point, we’re optimistic that the demand and channel inventory may normalize during the second half of the calendar year, and we remain in a strong position to take advantage of the opportunity when it occurs.</em></p> <p>- Akash Palkhiwala, CFO, FQ1 '23 Earnings Call</p> </blockquote> <p class=\"paywall-full-content invisible\">This shows me the company is prudently walking through the weakened mobile market with caution but not pulling back on its diversification plans with automotive or IoT. It's also steadying itself to meet a turnaround in demand later in the calendar year so it can have the right amount of supply ramped for mobile OEMs.</p> <p class=\"paywall-full-content invisible\">This is not to say there's no risk to management's outlook, because there is. If a domino falls later, then it could portend a larger degree adjustment to the company's outlook for demand and inventory. The current second half of the year outlook could easily change by next quarter. But the adjustments are being made to rein in expenses and possibly worse conditions now, mitigating the risk of a change to the outlook later.</p> <h2 class=\"paywall-full-content invisible\">What About In The Meantime?</h2> <p class=\"paywall-full-content invisible\">So while diversification continues, is Qualcomm a safe place to invest?</p> <p class=\"paywall-full-content invisible\">For this, I look at how the company is dealing with the challenging market and economic uncertainty by its ability to maintain or grow free cash flow. And surprising to some, the company has been able to maintain strong positive free cash flow thus far.</p> <figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/13/saupload_88f814088a4dbcf489d857782585e3fe.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\" title=\"https://ycharts.com\" target=\"_blank\">YCharts</a></figcaption></figure><p class=\"paywall-full-content invisible\">This level of free cash flow in the recent quarter is promising, even with the first negative revenue growth quarter since the pandemic quarter. Free cash flow grew 83% over last year's quarter, mostly due to some changes in assets and liabilities in the year-ago quarter, but seeing the final number is still a positive development during this challenging time.</p> <p class=\"paywall-full-content invisible\">The company has two main obligations with respect to free cash flow: The dividend and servicing near-term debt. Its dividend currently requires $842M per quarter, which the company is easily covering thus far. There's no concern the dividend is at risk, now or in the coming year.</p> <p class=\"paywall-full-content invisible\">Short-term debt is being serviced through a combination of cash flow and new long-term debt exchanges. The company has taken out short-term and long-term debt to pay back short-term debt.</p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2023/2/13/15511982-16763053062374845_origin.png\" rel=\"lightbox\" data-width=\"685\" data-height=\"107\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/13/15511982-16763053062374845.png\" alt=\"Qualcomm's FQ1 '23 financing activities\" contenteditable=\"false\" loading=\"lazy\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Qualcomm's FQ1 '23 10-K</span></p></figcaption></figure><blockquote class=\"paywall-full-content invisible\"> <p> </p> <p><em>In November 2022, we issued unsecured fixed-rate notes, consisting of $700 million of fixed-rate 5.40% notes and $1.2 billion of fixed-rate 6.00% notes (collectively, November 2022 Notes) that mature on May 20, 2033 and May 20, 2053, respectively. The net proceeds from the November 2022 Notes were used to repay $946 million of fixed-rate notes and $500 million of floating-rate notes that matured in January 2023 and the excess will be used for general corporate purposes.</em></p> <p>- Qualcomm's FQ1 '23 10-K</p> </blockquote> <p class=\"paywall-full-content invisible\">It's clear the company is being pre-emptive on its debt obligations as it paid back January-maturing debt with much longer-term debt maturing in 2033 and 2053. This pushes out obligations beyond this near and medium-term weakness. The company clearly has financial flexibility in the debt markets. It also has a $1.5B payment waiting in the wings for the sale of its Active Safety business to Magna. This continues to place the balance sheet in favorable light for 2023.</p> <h2 class=\"paywall-full-content invisible\">Continuing The Story</h2> <p class=\"paywall-full-content invisible\">The diversification strategy is continuing as planned and is the leading story for the bullish thesis for the time being. But I won't throw out the Handset business yet due to its still strong market structure toward higher-end handsets and its ability to see higher ASPs (average selling prices) during the thick of the market weakness. While overall weakness weighs on the segment, there's still a strong undercurrent for its top chipsets, as shown by its ability to fetch higher ASPs.</p> <p class=\"paywall-full-content invisible\">Even with the weaker overall revenue and demand landscape, the company is seeing strong free cash flow. This allows it to maintain its dividend, service debt and continue its share repurchase program, which can be scaled back if cash requirements become priority.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">But for now, Qualcomm remains undervalued if the industry is set to bottom in the first half of the year, as management has outlined. In the meantime, the company's strong cash-generation profile is withstanding the test.</p>", "twitContent": "$QCOM - Qualcomm: Focus On The Diversity Strategy While Enjoying Strong Free Cash Flow. https://seekingalpha.com/article/4577887-qualcomm-focus-on-the-diversity-strategy-while-enjoying-strong-free-cash-flow?source=tweet ", "innerMarketing": "<h2>Decrypt The Cash In Tech With Tech Cache</h2><p>Do two things to further your tech portfolio. First, click the 'Follow' button below next to my name. Second, become <a href=\"https://seekingalpha.com/author/joe-albano/research\"><strong>one of my subscribers risk-free</strong></a> with a free trial, where you'll be able to hear my thoughts as events unfold instead of reading my public articles weeks later only containing a subset of information. In fact, I provide <strong>four times more content</strong> (earnings, best ideas, etc.) each month than what you read for free here. Plus, you'll get ongoing discussions among intelligent investors and traders in my chat room.</p><p><img src=\"https://static.seekingalpha.com/uploads/2022/6/21/15511982-16558567629170895.png\"></p><p><strong><a href=\"https://seekingalpha.com/author/joe-albano/research\">Join now</a>!</strong></p>", "marketingBullet": "Looking for more investing ideas like this one? Get them exclusively at Tech Cache. <a href='/checkout?service_id=mp_1133&source=mp_marketing_text_top' sasource='mp_marketing_text_top'>Learn More »</a>", "isReit": false, "videoData": null, "marketingBulletVariant": "I am Joe Albano, a tech insider. I lead the investing group <a href=\"/checkout?service_id=mp_1133&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A15511982%7Csection_asset%3Aauthor_bullets%3A-tech-cache\" data-test-id=\"author-custom-template-link\">Tech Cache</a> which delivers my industry insider expertise to those looking for the best long-term picks, trades, and chart analysis of tech stocks.", "marketingBio": "Joe Albano is a tech insider with a background and education in electrical and software engineering. He has a unique understanding of current technology and innovation trends as well as what companies are best positioned for future growth across all areas of tech.\n\nJoe leads the investing group <a href=\"/checkout?service_id=mp_1133&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A15511982%7Csection_asset%3Aauthor_root%3A-tech-cache\" data-test-id=\"author-custom-template-link\">Tech Cache</a> where he delivers industry insider expertise to those looking for the best long-term picks, trades, and technical analysis of tech and growth stocks. Features of the group include: access to Joe’s personal portfolio, 2-3 weekly investment ideas, a weekly summary and preview newsletter, watchlist stocks, an automated stock rating system, and live chat. Get a feel for Tech Cache by signing up for its Free Tier, no strings attached. <a href=\"/checkout?service_id=mp_1133&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A15511982%7Csection_asset%3Aauthor_root%3A-tech-cache\" data-test-id=\"author-custom-template-link\">Learn more</a>.", "audioDuration": null}, "relationships": {"author": {"data": {"id": "76115", "type": "author"}}, "sentiments": {"data": [{"id": "437692", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "1168", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "464145", "type": "tag"}, {"id": "143031", "type": "tag"}, {"id": "142771", "type": "tag"}, {"id": "142781", "type": "tag"}, {"id": "548926", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "615773", "type": "tag"}, {"id": "681760", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "114692", "type": "tag"}, {"id": "114682", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4577887-qualcomm-focus-on-the-diversity-strategy-while-enjoying-strong-free-cash-flow", "canonical": "https://seekingalpha.com/article/4577887-qualcomm-focus-on-the-diversity-strategy-while-enjoying-strong-free-cash-flow", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1362782272/image_1362782272.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "1133", "type": "authorResearch", "attributes": {"createdAt": "2017-04-26T14:13:57-04:00", "title": "Tech Cache", "rating": "5.0", "reviewCount": 24, "shortPitch": "The best tech and AI ideas from a technology insider", "categories": ["Growth", "Tech"], "serviceAssistantIds": [], "inAppPurchasesAllowedInIos": true, "inAppPurchasesAllowedInAndroid": true, "activeSubscriptionsCount": 10446, "androidIapPlan": "semi_annual", "iosIapPlan": "annual", "description": "Tech Cache is led by Joe Albano, an industry insider delivering ideas on tech, AI, and crypto. Tech Cache helps investors navigate the ever shifting landscape of the fundamentals and volatility of the charts. Generate the highest returns by buckling into the tech sector before the breakout and know when to get out of a technology investment to preserve gains before a potential breakdown.", "landingPageColor": "dark-green", "adUnits": ["direct_access", "trading_alert", "exclusive_idea", "weekly_news", "access_all", "wildcard"], "tempData": {}, "price": 60.0, "wildcardText": "Bi-weekly Live Webinars", "slug": "tech-cache", "annualPriceWithDiscount": 479.0, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": true}, "relationships": {"author": {"data": {"id": "76115", "type": "author"}}}}, {"id": "76115", "type": "author", "attributes": {"company": null, "slug": "joe-albano", "userId": 15511982, "tagId": 464145, "bio": "<p>Joe Albano is a tech insider with a background and education in electrical and software engineering. He has a unique understanding of current technology and innovation trends as well as what companies are best positioned for future growth across all areas of tech, including AI, as he has called it accurately over the last several years.</p><p> Joe leads the investing group<a href=\"https://seekingalpha.com/checkout?service_id=mp_1133\"> Tech Cache </a>where he delivers industry insider expertise to those looking for the best long-term picks, trades, and technical analysis of tech and growth stocks. Features of the group include: access to Joe’s personal portfolio, 2-3 weekly investment ideas, a weekly summary and preview newsletter, watchlist stocks, an automated stock rating system, and live chat. </p><p><a href=\"https://seekingalpha.com/checkout?service_id=mp_1133\">Learn more</a></p><p>.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/015/511/982/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/015/511/982/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/015/511/982/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/015/511/982/extra_large_pic.png"}, "nick": "Joe Albano", "deactivated": null, "memberSince": 2013, "isRss": false, "contributorSince": 2014, "followersCount": 16369}, "relationships": {"user": {"data": {"id": "15511982", "type": "user"}}, "userBioTags": {"data": [{"id": "1038033", "type": "userBioTag"}, {"id": "1038034", "type": "userBioTag"}, {"id": "1038035", "type": "userBioTag"}, {"id": "1038036", "type": "userBioTag"}, {"id": "1038037", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1133", "type": "authorResearch"}}}, "links": {"self": "/author/joe-albano", "profileUrl": "/author/joe-albano", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "1168", "type": "tag", "attributes": {"slug": "qcom", "name": "QCOM", "company": "QUALCOMM Incorporated", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "45", "type": "sector"}}}, "links": {"self": "/symbol/QCOM"}}, {"id": "464145", "type": "tag", "attributes": {"slug": "joe-albano", "name": "Joe Albano", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/joe-albano"}}, {"id": "143031", "type": "tag", "attributes": {"slug": "garp-theme", "name": "GARP-THEME", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=garp-theme"}}, {"id": "142771", "type": "tag", "attributes": {"slug": "changing-market", "name": "Changing Market", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=changing-market"}}, {"id": "142781", "type": "tag", "attributes": {"slug": "cyclical-swing", "name": "Cyclical Swing", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=cyclical-swing"}}, {"id": "548926", "type": "tag", "attributes": {"slug": "industry-leader", "name": "Industry Leader", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=industry-leader"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "615773", "type": "tag", "attributes": {"slug": "article-outreach", "name": "Article outreach", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/article-outreach"}}, {"id": "681760", "type": "tag", "attributes": {"slug": "article-outreach-reward", "name": "Article Outreach Reward", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/article-outreach-reward"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "114692", "type": "tag", "attributes": {"slug": "alpha-rich-opportunity", "name": "Alpha-Rich Opportunity", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/alpha-rich-opportunity"}}, {"id": "114682", "type": "tag", "attributes": {"slug": "alpha-rich-investment-style", "name": "Alpha-Rich Investment Style", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/alpha-rich-investment-style"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "437692", "type": "sentiment", "attributes": {"articleId": 4577887, "type": "bullish", "createdAt": "2023-02-13T15:37:06.000-05:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4577887", "type": "article"}}, "tag": {"data": {"id": "1168", "type": "tag"}}}}]}