{"data": {"id": "4586912", "type": "fullArticle", "attributes": {"publishOn": "2023-03-13T04:31:24-04:00", "isLockedPro": false, "commentCount": 6, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"douglas-mckenny": {"id": 679074, "slug": "douglas-mckenny", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "qcom": {"id": 1168, "slug": "qcom", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "information-technology": {"id": 45, "slug": "information-technology", "kind": "sector", "path": "/stock-ideas/technology", "title": "Tech ", "sasource": "theme_breadcrumb"}}, "title": "Qualcomm Remains An Attractive Prospect", "summary": ["Qualcomm's share price has outperformed the market in the last five years.", "The business’ profitability has dramatically improved and gives it a huge option on innovation.", "Despite having an internal dilemma in its business model, this profitability seems to resolve this dilemma.", "The business is more profitable than its peers and trading at a more attractive level than them."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-03-13T04:31:24-04:00", "isModerated": false, "closestTradingDate": "2023-03-13", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 8, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-w750\" alt=\"Newest Innovations In Consumer Technology On Display At 2014 International CES\" data-id=\"460993663\" data-type=\"getty-image\" width=\"3000px\" height=\"2030px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"></picture><figcaption><p class=\"item-credits\">Justin Sullivan</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Qualcomm Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/QCOM\" title=\"QUALCOMM Incorporated\">QCOM</a></span>) has had an incredible post-pandemic period, with the share price taking off and optimism in the business greater than at any point in the last decade. Management's compensation has been tied to shareholder interests, investments in innovation<span class=\"paywall-full-content invisible\"> have continued at a high level, and the company's profitability leads its peers. The company retains numerous attractions and is an excellent long-term investment.</span></p> <h2 class=\"paywall-full-content invisible\">Stock Market Success in the Era of Semiconductors</h2> <p class=\"paywall-full-content invisible\">In the last five years, Qualcomm's share price rose by over 80%, while its total shareholder return (TSR) was more than 106%. This compares favorably to the NASDAQ 100, which had TSR of 75%, and the S&amp;P 500, which had a TSR of more than 44%. However, the company's TSR is lower than the 126/3% equally-weighted average TSR of the company's main competitors -as defined by the company- during that time, Apple (<a href=\"https://seekingalpha.com/symbol/AAPL\" title=\"Apple Inc.\">AAPL</a>), Broadcom (<a href=\"https://seekingalpha.com/symbol/AVGO\" title=\"Broadcom Inc.\">AVGO</a>), MediaTek (MDTKF), Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>), NXP Semiconductors (<a href=\"https://seekingalpha.com/symbol/NXPI\" title=\"NXP Semiconductors N.V.\">NXPI</a>), Qorvo (<a href=\"https://seekingalpha.com/symbol/QRVO\" title=\"Qorvo, Inc.\">QRVO</a>), Samsung Electronics (<a href=\"https://seekingalpha.com/symbol/SSNLF\" title=\"Samsung Electronics Co., Ltd.\" target=\"_blank\">OTCPK:SSNLF</a>), Skyworks (<a href=\"https://seekingalpha.com/symbol/SWKS\" title=\"Skyworks Solutions, Inc.\">SWKS</a>), and Texas Instruments (<a href=\"https://seekingalpha.com/symbol/TXN\" title=\"Texas Instruments Incorporated\">TXN</a>). (The company's other main competitor, UNISOC, is a privately held firm).</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><img src=\"https://static.seekingalpha.com/uploads/2023/3/12/saupload_GSMzMvoSCQC1EHeLAwlkv4DObmw3spQ8yrN6lJaj4DSQL40VKcFo98-n069lP_7xT2-mzIK-5865c-SozF4uxKd6rgTGlEmEq0dULKGxL0L_hBzI7GnxYDYCRkCOnOxK8XuiImuTuNMSzlD56RdyVAQ.png\" alt=\"Source: Morningstar\" contenteditable=\"false\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Source: Morningstar</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">The company's strong showing against the broad market is part of a broader underlying trend in which semiconductors have performed strongly. In the last five years, the <a href=\"https://www.msci.com/documents/10199/43fbeb9e-05ce-4b94-8d98-4ab50d9b5409\" rel=\"nofollow\" title=\"https://www.msci.com/documents/10199/43fbeb9e-05ce-4b94-8d98-4ab50d9b5409\" target=\"_blank\">MSCI World Semiconductors and Semiconductor Equipment Index</a> has delivered 16.22% net returns per year, compared to 6.88% per year for the MSCI World. In that five year period, the MSCI World has only beaten the MSCI World Semiconductors and Semiconductor Equipment Index on two occasions. We can extend our analysis to the post-Great Recession period, and the semiconductor index has beaten the world index in nine out of the last 14 years. This has been the era of semiconductors.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><img src=\"https://static.seekingalpha.com/uploads/2023/3/12/saupload_YVNQ-HwTGpKyprkAar7R7PbG3vpa_AdZh1dlRowZVynwoDG5TF9-pHpTekP3Xo04gUZapVrLIgjt5A0DHfKEbNzWBkWSV2T6qP4sfgGJuR_gtIBm0UUKCIsDHby3IzQLENNO0Th9UNVCccc2Q-7mBSs.png\" alt=\"Source: MSCI World Semiconductors and Semiconductor Equipment Index\" contenteditable=\"false\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Source: MSCI World Semiconductors and Semiconductor Equipment Index</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Qualcomm's financial results have been impressive, and they are an important reason for the company's success on the stock market.</p> <h2 class=\"paywall-full-content invisible\">Overview of the Business</h2> <p class=\"paywall-full-content invisible\">Qualcomm is a global leader in developing and commercializing foundational technologies for the wireless industry, including 3G, 4G, and 5G wireless technologies, as well as processor technologies for high-performance, low-power computing and on-device AI. Their technologies and products are used in mobile devices and other wireless products, helping to power the growth in smartphones and other cellular enabled devices. Qualcomm is scaling their innovations using one technology roadmap to enable the connected intelligent edge across industries and applications beyond handsets, including automotive and the internet of things (IOT).</p> <p class=\"paywall-full-content invisible\">Qualcomm derives revenues from sales of integrated circuit products, including their Snapdragon family of highly-integrated, system-based solutions, and licensing of their intellectual property, including patents and other rights. They share their inventions broadly through licensing programs, enabling wide ecosystem access to technologies at the core of mobile innovation, and through the sale of their wireless integrated circuit platforms and other products. They collaborate across the ecosystem to enable a global environment of continued progress and growth.</p> <p class=\"paywall-full-content invisible\">In 2022, equipment and services were responsible for about 84% of total revenues. Although their systems-on-a-chip are their most famous chip, it's their communications chips which earn the bulk of their equipment and services revenue.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><img src=\"https://static.seekingalpha.com/uploads/2023/3/12/saupload_obNk_5qkUCIYUsJ33kwSUAU0-wV97zXskrD7yLBzrVI1qef-M2o2N-CTAudHC4sV915n8_HARjt1o_HAcMMDpIrq3K8vcmryCKr7g1c0U3UAKIs3R56nc8qytcWS8avxHt0Up8acyqry8QeGAzhuBYA.png\" alt=\"Source: Qualcomm Inc. 2022 Annual Report\" contenteditable=\"false\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Source: Qualcomm Inc. 2022 Annual Report</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Qualcomm has a long history of driving innovation and has played a leading role in developing system-level inventions that serve as the foundation for 3G, 4G, and 5G wireless technologies. They own significant intellectual property, including patents, patent applications, and trade secrets, applicable to products that implement any version of CDMA and/or OFDMA technologies. The mobile industry generally recognizes that any company seeking to develop, manufacture, and/or sell devices or infrastructure equipment that use CDMA-based and/or OFDMA-based technologies requires a license or other rights to use Qualcomm's patents.</p> <p class=\"paywall-full-content invisible\">Qualcomm is organized on the basis of products and services and has three reportable segments: QCT, QTL, and QSI. QCT develops and supplies integrated circuits and system software based on 3G/4G/5G and other technologies, including RFFE, for use in mobile devices, automotive systems, IoT, and edge networking products. In 2022, the QCT segment was responsible for over 85% of the company's revenues.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><img src=\"https://static.seekingalpha.com/uploads/2023/3/12/saupload_-clxPFy_qFMS2QZjoKPoVDnv9hHVCVlBtjRnVbEU2Wy9bJLeLl4ZV5IXd-KjzdTFgIq6zBGFmZ_R-lZBXAc-tXE-TQOO0rtL-oasBFQW9uiunqAc1oRDHgSfmhFXJY0yPvgQNZ5OqtHYGvfGM_wH1as.png\" alt=\"Source: Qualcomm Inc. 2022 Annual Report\" contenteditable=\"false\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Source: Qualcomm Inc. 2022 Annual Report</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">QTL grants licenses or otherwise provides rights to use portions of Qualcomm's intellectual property portfolio, which includes certain patent rights essential to and/or useful in the manufacture and sale of certain wireless products. The QTL segment was responsible for over 14% of revenues.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><img src=\"https://static.seekingalpha.com/uploads/2023/3/12/saupload_Qa075QW31i2EHYlnfvc1vc6VDh9orKg_uWE47Kf0dQPlwqd29ZQss0p7cmU76_FonCeJ6qkfFwdXlBTq24mNNlIs-ShUaChQCaiVPApM02mV2LB09uxUw11cgCsv6EIChcXfr3rieCvFdaHK6EVxjmM.png\" alt=\"Source: Qualcomm Inc. 2022 Annual Report\" contenteditable=\"false\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Source: Qualcomm Inc. 2022 Annual Report</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">QSI makes strategic investments. They also have non-reportable segments, including QGOV and their cloud AI inference processing initiative. The segment is responsible for a small residual of revenues, and, in 2022, made a $279 million loss.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><img src=\"https://static.seekingalpha.com/uploads/2023/3/12/saupload_ZTMvEM6_GtKFTz9aAjkWMW6VrBLQ-X3Vpag3QsnBiTa95EcFS2y1qovzljQ5PFr9zg3Gj6joYDSy8mGXw_gqLz3ugAP-wWvrM0UjKeOKqi8l7laxdBJQEx0-IGM9OW_11TKwYqf-wQ3KBoWf-kHIRuQ.png\" alt=\"Source: Qualcomm Inc. 2022 Annual Report\" contenteditable=\"false\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Source: Qualcomm Inc. 2022 Annual Report</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Although chips drive revenues, their margins are thinner than licenses, because the high price of chips are eroded by the high cost of producing those chips, whereas licenses are very profitable because all the costs are amortized. As the charts above show, the QCT segment is responsible for just 34% of earnings before tax (EBT) despite being responsible for 85% of revenues. The QTL segment, on the other hand, is responsible for 73% of EBT despite being responsible for only 14% of revenues.</p> <h2 class=\"paywall-full-content invisible\">Qualcomm's Dilemma</h2> <p class=\"paywall-full-content invisible\">Qualcomm's chip business, especially its service-on-a-chip business, is threatened by declining prices. Furthermore, as Apple develops its own chips, Samsung and Qualcomm's addressable market is shrinking. Additionally, MediaTek and other service-on-a-chip companies are eating into margins in the low-end market.</p> <p class=\"paywall-full-content invisible\">Despite the growing competition that is affecting the company, the company benefits from its dual model because, even when it cannot supply its chips, it will still often earn revenues from that same mobile phone from its licensing business. So, bizarrely, Qualcomm can become more profitable even if its major source of revenue is in secular decline.</p> <p class=\"paywall-full-content invisible\">However, the licensing business carries regulatory risks which make the revenues more uncertain, whereas the equipment and licensing business is much more straightforward. Going forward, investors will have to weigh the merits of a more profitable but riskier Qualcomm emerging from a less profitable, but less risky business model. In fact, this has led to many calls for Qualcomm to be split into two businesses, an idea which is attractive for activist investors who believe that they can uncover value in the equipment and services segment. <a href=\"https://www.reuters.com/article/us-qualcomm-m-a-broadcom/broadcom-offers-to-buy-mobile-chipmaker-qualcomm-for-103-billion-idUSKBN1D61EO\" rel=\"nofollow\" title=\"https://www.reuters.com/article/us-qualcomm-m-a-broadcom/broadcom-offers-to-buy-mobile-chipmaker-qualcomm-for-103-billion-idUSKBN1D61EO\" target=\"_blank\">Broadcom's failed $103 billion bid</a> to acquire Qualcomm in 2016 came at a time when the equipment and services business was stronger, but Broadcom recognised that the company was not maximizing shareholder value and that more focus on the licensing segment was the most important task for management.</p> <p class=\"paywall-full-content invisible\">The problem for Qualcomm though, and why the business has not done the thing that seems rational in terms of the maximization of shareholder value, is that the equipment and services segment generates the patents that drive the licensing business, so disentangling the two segments would not necessarily lead to a better business. The business has already faced regulatory challenges, such as the <a href=\"https://fortune.com/2016/10/27/qualcomm-nxp-deal/\" rel=\"nofollow\" title=\"https://fortune.com/2016/10/27/qualcomm-nxp-deal/\" target=\"_blank\">failed bid for NXP Semiconductors</a> in 2014, which was blocked despite the company excluding standard-essential patents from the proposed deal. So, any split of the business would find it hard to maximize the licensing segment, given regulatory challenges. The current sub-optimal situation in which the licensing business's profits are partially directed to the equipment and services segment, may actually be the optimal scenario. If that is the case, then management has an even harder job on its hands, because the solution to the deterioration of the equipment and services business does not have an easy solution.</p> <p class=\"paywall-full-content invisible\">In addition to the above, many investors find how management has dealt with the licensing segment to be sub-optimal. This is because they would like management to simply enjoy the profits that accrue from the business, rather than to reinvest them to drive future, uncertain innovations. This points to a strategic question: should management do more to improve short-term shareholder value, as many investors would like, or is Qualcomm's present structure unchangeable and optimum, and so, investors must accept short-term maximization underperformance for long-term maximization. Axiomatically, innovation has the biggest impact on returns on invested capital (ROIC), so the solution may be that management should use an even greater proportion of its licensing segment profits to fund innovation. As we will see from analyzing the financial results, not only is the company in a position to drive innovation, it has in fact invested heavily in doing so.</p> <h2 class=\"paywall-full-content invisible\">Strong Financial Performance</h2> <p class=\"paywall-full-content invisible\">Qualcomm has grown revenue from $22.73 billion in 2018 to $44.2 billion in 2022, at a 5-year compound annual growth rate (CAGR) of 14.23%. In terms of segments, the equipment and services segment has grown revenues from $17.4 billion to $37.17 billion, at a 5-year CAGR of 16.39%, while the licensing segment grew revenues from $5.3 billion to $7 billion, at a 5-year CAGR of 5.72%. Although this seems to fly in the face of what we have spent so much talking about, we should assume that the growth in revenues has been strengthened by the <a href=\"https://www.reuters.com/article/us-chip-shortage-qualcomm-idUSKBN2B32OO\" rel=\"nofollow\" title=\"https://www.reuters.com/article/us-chip-shortage-qualcomm-idUSKBN2B32OO\" target=\"_blank\">post-pandemic chip shortage</a>. Consider that between 2013 and 2020, revenues actually declined from $24.87 billion to $23.35 billion, at an 8-year CAGR of -0.79%. Equipment and services $16.99 billion in 2013 to $16.3 billion in 2020, while licensing declined from $7.88 billion in 2013 to $7 billion in 2022.</p> <p class=\"paywall-full-content invisible\">What this suggests is that the structural issues impacting the business have been bailed out by the post-pandemic chip shortage. If that shortage is resolved, does the business' return to its underlying dilemma?</p> <p class=\"paywall-full-content invisible\">It must be said that the firm's revenue in this 5-year period looks good. Credit Suisse' <a href=\"https://research-doc.credit-suisse.com/docView?document_id=1065113751&amp;format=PDF&amp;language=ENG&amp;serialid=Z1zrAAt3OJhElh4iwIYc9JHmliTCIARGu75f0b5s4bc%3D&amp;source_id=csplusresearchcpi\" rel=\"nofollow\" title=\"https://research-doc.credit-suisse.com/docView?document_id=1065113751&amp;format=PDF&amp;language=ENG&amp;serialid=Z1zrAAt3OJhElh4iwIYc9JHmliTCIARGu75f0b5s4bc%3D&amp;source_id=csplusresearchcpi\" target=\"_blank\">\"The Base Rate Book\"</a>, which analyzes data between 1950 and 2015, shows that 12.6% of firms in that reference period enjoyed a similar rate of growth over a 5-year period. The mean 5-year revenue CAGR was 6.9% and the median 5-year revenue CAGR was 5.2%. In the <a href=\"https://d1io3yog0oux5.cloudfront.net/_3c5c3aaeb35824004878126dba972b59/qualcomm/db/773/7221/file/FY+2023+1st+Quarter+Earnings+Release.pdf\" rel=\"nofollow\" title=\"https://d1io3yog0oux5.cloudfront.net/_3c5c3aaeb35824004878126dba972b59/qualcomm/db/773/7221/file/FY+2023+1st+Quarter+Earnings+Release.pdf\" target=\"_blank\">first quarter of 2023</a>, the firm reported revenues of $9.46 billion, compared to $10.7 billion for the same period in the year prior.</p> <p class=\"paywall-full-content invisible\">Gross profitability, which is gross profits scaled to total assets, rose from 0.38 in 2018 to 0.52 in 2022. The threshold for attractiveness of a stock is a gross profitability of 0.33, according to <a href=\"https://rnm.simon.rochester.edu/research/OSoV.pdf\" rel=\"nofollow\" title=\"https://rnm.simon.rochester.edu/research/OSoV.pdf\" target=\"_blank\">Robert Novy-Marx' research</a>.</p> <p class=\"paywall-full-content invisible\">Operating income rose from $742 million in 2018 to $15.86 billion in 2022, at a 5-year CAGR of 84.49%. Meanwhile, operating margin rose from 3.26% to 35.88%. Qualcomm's current operating margin is higher than the mean operating margin in our reference period, which was 8.1%, and the median operating margin was 8.5%, and is in the top quintile of operating margins.</p> <p class=\"paywall-full-content invisible\">Earnings have risen from -$4.86 billion in 2018 to $12.94 billion in 2022. With a negative value, in the beginning period, we cannot calculate a CAGR value, but as a placeholder, let's say that the company's earnings growth was at the highest level, with just 0.5% of firms having a similar rate of growth. The mean 5-year earnings CAGR was 7.3% and the median 5-year earnings CAGR was 5.9%.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><img src=\"https://static.seekingalpha.com/uploads/2023/3/12/saupload_tB3Qm4EaiL-UOhJ0XnSB6yiTCu8HqiZXal3zyHV7MEPjpDFoH5_X53FjDKLjnh2e_CL7T2KbcfZUYpUF0dL2jabX3TaB6D7uDVYp426Tag16e0KoSQC1UhShil2zNVGuZZQ0lxVJwACVELbbIYtT2FY.png\" alt=\"Source: Credit Suisse\" contenteditable=\"false\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Source: Credit Suisse</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">In the first quarter of 2023, earnings were $2.24 billion, compared to $3.4 billion for the same period in the year prior.</p> <p class=\"paywall-full-content invisible\">Operating cash rose from $3.9 billion in 2018 to $9.1 billion in 2022, at a 5-year CAGR of 18.47%. In the first quarter of 2023, operating cash was $3.1 billion compared to $2.1 billion in the same period in the year prior.</p> <p class=\"paywall-full-content invisible\">Qualcomm's free cash flow (FCF) rose from $3.12 billion in 2018 to $6.83 billion in 2022, at a 5-year CAGR of 16.96%. In that 5-year period, the firm generated $29.4 billion in FCF, or about 23% of its market capitalization. Return on invested capital rose from 4.8% in 2018, to 45.8% in 2022.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><img src=\"https://static.seekingalpha.com/uploads/2023/3/12/saupload_RTQ7gxvuFLAThxE7u4ImgLcMBU9AK290DHQ1a_NR9hMsRAjCs86-iYqwhGod6EZEirEEHbFKQWpaaFbanDxsVJeIQfABkImMMYEpBm9LHkmnljNqCATcYUioVb04_iEDJgDXuyXKZaECPlYYy6I91b8.png\" alt=\"Source: Qualcomm Inc. Filings and Author Calculations\" contenteditable=\"false\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Source: Qualcomm Inc. Filings and Author Calculations</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Qualcomm's recent success has allowed it to achieve a degree of profitability greater than that of its peers, and whose FCF yield is very attractive and higher than all but Skyworks and Qorvo.</p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <colgroup> <col> <col> <col> <col> </colgroup> <tr> <td> </td> <td><p>ROIC</p></td> <td><p>FCF Yield</p></td> <td><p>P/E</p></td> </tr> <tr> <td><p>Qualcomm</p></td> <td><p>45.80%</p></td> <td><p>6.58%</p></td> <td><p>11.11</p></td> </tr> <tr> <td><p>Apple</p></td> <td><p>39.70%</p></td> <td><p>4.15%</p></td> <td><p>25.21</p></td> </tr> <tr> <td><p>Broadcom</p></td> <td><p>33.40%</p></td> <td><p>6.58%</p></td> <td><p>20.69</p></td> </tr> <tr> <td><p>Nvidia</p></td> <td><p>11.70%</p></td> <td><p>0.67%</p></td> <td><p>131.98</p></td> </tr> <tr> <td><p>NXP Semiconductors</p></td> <td><p>23.90%</p></td> <td><p>6.23%</p></td> <td><p>17.05</p></td> </tr> <tr> <td><p>Qorvo</p></td> <td><p>14.60%</p></td> <td><p>9.96%</p></td> <td><p>22.33</p></td> </tr> <tr> <td><p>Skyworks</p></td> <td><p>25.30%</p></td> <td><p>6.60%</p></td> <td><p>15.18</p></td> </tr> <tr> <td><p>Texas Instruments</p></td> <td><p>44.20%</p></td> <td><p>3.81%</p></td> <td><p>18.24</p></td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p class=\"paywall-full-content invisible\">Source: Qualcomm Inc. Filings and Author Calculations</p> <p class=\"paywall-full-content invisible\">Qualcomm may have problems and management may face a long-term dilemma, but its greater profitability allows it to pour in more money to drive innovation, and build long-term value at a higher rate than its peers. In 2022, the company invested 19% of its revenues into R&amp;D spending, and in 2021, 21%. That ability to pour a large proportion of its revenues into innovation will allow the firm to resolve some of its internal dilemmas.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><img src=\"https://static.seekingalpha.com/uploads/2023/3/12/saupload_5jzD5n-HbrG8dKSFq2hUbGIpzrAPY6YUF0nJGfFn9QNPn0mI_5XhtIuEfP8NwyNbIwD-6thC5zbTR7q7-uipV_PZzd_9k3hdK0mEyf823sDcI70SK7UaFCiYcb1PexQinjkrKJvoafAuJ2UjW79-9Jo.png\" alt=\"Source: Qualcomm Inc. 2022 Annual Report\" contenteditable=\"false\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Source: Qualcomm Inc. 2022 Annual Report</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">While R&amp;D spending does not necessarily lead to value-creating innovations, it does create that option and make it more likely. Spending on R&amp;D is an option on innovation. You have to buy the ticket to play the game and Qualcomm is able to buy tickets at a higher rate than its peers. What investors often forget, because they are tied to older models of how tech operates, is that firms like Qualcomm can be easily disrupted. Even if Qualcomm's dilemma is real, we have seen how events can conspire to increase demand and boost prices of products that are supposedly in trouble.</p> <h2 class=\"paywall-full-content invisible\">Management and Shareholder Interests are Aligned</h2> <p class=\"paywall-full-content invisible\">Incentives are powerful ways to resolve the agent-principal problem in which there is no link between shareholder interests and those of management. According to the company's <a href=\"https://investor.qualcomm.com/financial-information/proxy-statements/content/0001104659-23-005003/0001104659-23-005003.pdf\" rel=\"nofollow\" title=\"https://investor.qualcomm.com/financial-information/proxy-statements/content/0001104659-23-005003/0001104659-23-005003.pdf\" target=\"_blank\">2023 Proxy Statement</a>, half of the performance stock units (PSUs) issued in 2019 for the 2020-2022 period were tied to a target 3-year ROIC.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><img src=\"https://static.seekingalpha.com/uploads/2023/3/12/saupload_foV6TsERzGk7GLwA22ChevE-rhjm8O9an2W35e5ft8LICkBcwMP9tsmlx_pmERo33iGM1zpChbplKt03zOJuHqCnPfXtXKPGOMlKHL9Dq3nfWuI5mlqRhJl9jUAJKYvXj8G_h1q8LBYKQczCMs0V7BE.png\" alt=\"Source: Qualcomm Inc. 2023 Proxy Statement\" contenteditable=\"false\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Source: Qualcomm Inc. 2023 Proxy Statement</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">By having executive compensation tied to improvements in ROIC, there is a clear way to properly assess management's decisions, and managers are paid to think like owner-operators.</p> <h2 class=\"paywall-full-content invisible\">Cheaper and More Profitable Than Its Peers</h2> <p class=\"paywall-full-content invisible\">Qualcomm's P/E multiple of 11.11 is lower than that of the MSCI World Semiconductors and Semiconductor Equipment Index, which is 24.39. The P/E multiple is also higher than that of the S&amp;P 500, at <a href=\"https://www.multpl.com/s-p-500-pe-ratio\" rel=\"nofollow\" title=\"https://www.multpl.com/s-p-500-pe-ratio\" target=\"_blank\">20.64</a>. The company also has the lowest P/E multiple of its peers. With an FCF yield of 6.58%, just Skyworks and Qorvo have a higher FCF yield among Qualcomm's direct peers. In addition, we have seen, the company has a higher ROIC than its peers, which will help drive innovation, and therefore, future value creation. This makes the company highly attractive.</p> <p class=\"paywall-full-content invisible\">In addition, the company has a dividend yield of 2.6% and a buyback yield of 0.96%, giving investors a yield of 3.56%.</p> <h2 class=\"paywall-full-content invisible\">Conclusion</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Qualcomm's share price has easily outperformed that of the stock market, although it has not outperformed its peers. Over the post-Great Recession period, semiconductors have outperformed the market, and Qualcomm's success should be seen as part of that industry-wide trend. The business does have a peculiar dilemma that is likely to lead to periods of short-term slumps with investors worrying about future corporate valuation. In the long run, the company's success depends on its ability to drive innovation, and its profitability and R&amp;D spending give it an option on innovation and make higher future corporate valuation more likely. Investors should consider Qualcomm as a long-term bet, but should also be prepared for periods where the market tears its hair at Qualcomm's results.</p>", "twitContent": "$QCOM - Qualcomm Remains An Attractive Prospect. https://seekingalpha.com/article/4586912-qualcomm-remains-attractive?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "106897", "type": "author"}}, "sentiments": {"data": [{"id": "443397", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "1168", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "679074", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4586912-qualcomm-remains-attractive", "canonical": "https://seekingalpha.com/article/4586912-qualcomm-remains-attractive", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/460993663/image_460993663.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "106897", "type": "author", "attributes": {"company": null, "slug": "douglas-mckenny", "userId": 57460347, "tagId": 679074, "bio": "An economics graduate with a passion for financial history; I apply my knowledge to markets in an effort to hopelessly predict trends and spot value. All opinions are my own and should not be taken seriously.", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/057/460/347/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/057/460/347/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/057/460/347/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/057/460/347/extra_large_pic.png"}, "nick": "Douglas McKenny", "deactivated": null, "memberSince": 2022, "isRss": false, "contributorSince": 2023, "followersCount": 696}, "relationships": {"user": {"data": {"id": "57460347", "type": "user"}}, "userBioTags": {"data": [{"id": "1009671", "type": "userBioTag"}, {"id": "1009672", "type": "userBioTag"}, {"id": "1009673", "type": "userBioTag"}, {"id": "1009674", "type": "userBioTag"}, {"id": "1009675", "type": "userBioTag"}, {"id": "1009676", "type": "userBioTag"}, {"id": "1009677", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/douglas-mckenny", "profileUrl": "/author/douglas-mckenny", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "1168", "type": "tag", "attributes": {"slug": "qcom", "name": "QCOM", "company": "QUALCOMM Incorporated", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "45", "type": "sector"}}}, "links": {"self": "/symbol/QCOM"}}, {"id": "679074", "type": "tag", "attributes": {"slug": "douglas-mckenny", "name": "Douglas McKenny", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/douglas-mckenny"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "443397", "type": "sentiment", "attributes": {"articleId": 4586912, "type": "bullish", "createdAt": "2023-03-13T04:31:24.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4586912", "type": "article"}}, "tag": {"data": {"id": "1168", "type": "tag"}}}}]}