{"data": {"id": "4613344", "type": "fullArticle", "attributes": {"publishOn": "2023-06-26T09:00:00-04:00", "isLockedPro": false, "commentCount": 66, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"joe-albano": {"id": 464145, "slug": "joe-albano", "kind": "common", "non_theme": true}, "aapl": {"id": 146, "slug": "aapl", "kind": "common", "non_theme": true}, "qcom": {"id": 1168, "slug": "qcom", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "tier-1": {"id": 603709, "slug": "tier-1", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "information-technology": {"id": 45, "slug": "information-technology", "kind": "sector", "path": "/stock-ideas/technology", "title": "Tech ", "sasource": "theme_breadcrumb"}}, "title": "Qualcomm Lacks A Near-Term Catalyst But Keep Holding", "summary": ["Qualcomm is in the middle of the trough of a Handset cycle with little-to-no confidence in an improved outlook for the remainder of its fiscal year.", "Unless its Automotive or IoT segments have an Nvidia-like AI moment, there's no near-term catalyst evolving there, either, though growth is more constructive.", "But the chart has seen its sentiment reach a bearish exhaustion, and even though there's no catalyst right now, any bullish inclination could prove pivotal for the stock."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-06-26T09:00:00-04:00", "isModerated": false, "closestTradingDate": "2023-06-26", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 14, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of QCOM, NVDA either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-w750\" alt=\"2019 Consumer Electronics Show Highlights New Products And Technology\" data-id=\"1091860622\" data-type=\"getty-image\" width=\"5319px\" height=\"3599px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Justin Sullivan</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <p>Excellent management is one of my pillars in finding the best investment for my capital. A solid business is another one. But the third is sentiment, closely linked to the idea of a catalyst to get a stock moving. QUALCOMM (<span class=\"ticker-hover-wrapper paywall-full-content invisible\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/QCOM\" title=\"QUALCOMM Incorporated\">QCOM</a></span><span class=\"paywall-full-content invisible\">) rates high on my management list - especially since Cristiano Amon took over mahogany row - while its business vision is undoubtedly headed in the right direction. But with weakness expected to loom over its largest revenue segment for the remainder of the year, Qualcomm lacks a catalyst to get the stock moving.</span></p> <p class=\"paywall-full-content invisible\">This isn't a call to sell the stock; no, in fact, the company has a bright future in driving growth outside of the cyclical Handset business. Automotive and IoT are no small potatoes for the rest of this decade. Sure, the company has to overcome a potential headwind in Handsets if Apple (<a href=\"https://seekingalpha.com/symbol/AAPL\" title=\"Apple Inc.\">AAPL</a>) <a href=\"https://seekingalpha.com/article/4524687-qualcomm-growth-catapulted-apple-affirms-5g-modem-king\" title=\"https://seekingalpha.com/article/4524687-qualcomm-growth-catapulted-apple-affirms-5g-modem-king\" target=\"_blank\">ever completes its 5G modem</a>. But the company pushed off the starting blocks of diversification long before the theoretical headwind could manifest.</p> <p class=\"paywall-full-content invisible\">The problem for the stock today is there's no catalyst set to light a fire under the stock. But it's also not teetering on the next leg down.</p> <h2 class=\"paywall-full-content invisible\">Handsets Will Continue To Hinder Performance</h2> <p class=\"paywall-full-content invisible\">Since the Handset business is the company's largest, making up 77% of QCT revenues and 66% of overall revenues, any cyclicality in the mobile industry will be pronounced. And the company is in the heat of finding the bottom of the segment as mobile remains weak and is not likely to see demand return over the next several months.</p> <p class=\"paywall-full-content invisible\">Because the seasonality of mobile components and retail sell-in are out of sync, as smartphones sold in the fall and holiday period see their components shipped quarters earlier, it's already possible to see the mobile holiday demand profile. On the company's FQ2 '23 call, management guided for this seasonally-important quarter. And with guidance coming in at $8.5B in revenue versus consensus of $9.14B with EPS of $1.80 versus consensus of $2.16, it doesn't bode well for the mobile handset market recovery.</p> <p class=\"paywall-full-content invisible\">And this is not lost on Qualcomm's management, as its opening statement on the earnings call was about as gloomy as it could be in the face of hopes for recovery:</p> <blockquote class=\"paywall-full-content invisible\"> <p> </p> <p><em>The evolving macroeconomic backdrop has resulted in <strong>further demand deterioration</strong> particularly<strong> in handsets at a magnitude greater than we previously forecasted.</strong> As a result, we're operating under the assumption that <strong>inventory drawdown dynamics remain a significant factor for at least the next couple quarters.</strong> Additionally, while expectations are for a rebound in China demand in the second half of the calendar year, <strong>we have not seen evidence of meaningful recovery</strong> and are not incorporating improvements into our planning assumptions.</em></p> <p>- Cristiano Amon, CEO, <a href=\"https://seekingalpha.com/article/4599640-qualcomm-incorporated-qcom-q2-2023-earnings-call-transcript\" title=\"https://seekingalpha.com/article/4599640-qualcomm-incorporated-qcom-q2-2023-earnings-call-transcript\" target=\"_blank\">FQ2 '23 Earnings Call</a></p> </blockquote> <p class=\"paywall-full-content invisible\">So what the company has been working through for the last few quarters - inventory drawdowns at customers - is set to continue for the next few quarters. It confirmed as much by giving some high-level guidance for FQ4:</p> <blockquote class=\"paywall-full-content invisible\"> <p> </p> <p><em>As we look ahead, we expect <strong>the dynamics impacting the third fiscal quarter to extend to the fourth quarter</strong>, including the timing of purchases by a modem-only handset customer resulting in muted seasonality in QCT revenues.</em></p> <p>- Akash Palkhiwala, CFO, FQ2 '23 Earnings Call</p> </blockquote> <p class=\"paywall-full-content invisible\">So Handset revenue will continue to suffer and will see flat-to-down sequential revenue after the current FQ2 sequential decline. The Handset division has little to no ability to conjure up a catalyst to propel the stock higher for the rest of the year. It would take a change in visibility or a sudden shift in end-user demand to speed up inventory drawdowns, and this doesn't look probable based on the continued push-out of recovery throughout 2023, notably contrasted by Amon from prior forecasts.</p> <h2 class=\"paywall-full-content invisible\">In Search Of A Catalyst Elsewhere</h2> <p class=\"paywall-full-content invisible\">But an intangible catalyst is already underway because of the potential loss of Apple as a major customer and the general cyclical nature of mobile handsets. I know, sounds counter-intuitive, right? But the undercurrent of this catalyst is the reason for diversification into Automotive and IoT. If Handsets weren't this weak, there likely wouldn't be a huge push to optimize the segment, for one, but also would not have been a meaningful push into diversification efforts to become less reliant on Handsets and one customer.</p> <p class=\"paywall-full-content invisible\">This has led to a thriving Automotive segment, albeit small, but growing fast.</p> <p class=\"paywall-full-content invisible\">On the call, management outlined several wins and technology advancements for its Automotive division. And while the segment is still small relative to the entire business, it's been one of the most consistent growth segments over the last two years, growing revenue by over 86% in those two years as of Q2. Automotive was also the only segment in the company to grow in FQ2, recorded as 20% year-over-year.</p> <p class=\"paywall-full-content invisible\">While it's the smallest of all segments, it has the most potential as new vehicles continually add driver-enhancing features like collision avoidance, lane departure, active cruise control, and many others. These all require more advanced systems and chips to operate. But, of course, the all-coveted autonomous driving segment is growing at bleeding edge speeds, requiring more enhanced 5G for external input as well as onboard systems to interface among the different sensors, vehicle control mechanisms, and driver-facing visual systems.</p> <p class=\"paywall-full-content invisible\">The continual advancement in vehicle driving and communication systems pushes the company forward with new wins each quarter. And in FQ2 alone, it saw 12 wins across its platforms.</p> <blockquote class=\"paywall-full-content invisible\"> <p> </p> <p><em>We are very pleased to be partnering with Mercedes-Benz on our next-generation Snapdragon Digital Cockpit platforms.</em></p> <p><em>...</em></p> <p><em>...during the quarter, we won 12 new designs across our Snapdragon Cockpit and Snapdragon Connectivity 5G platforms with automakers across the globe. We remain on track to execute on the milestones outlined during Automotive Investor Day.</em></p> <p>- Cristiano Amon, CEO, FQ2 '23 Earnings Call</p> </blockquote> <p class=\"paywall-full-content invisible\">If Automotive, or even IoT, has an \"AI moment\" much like ChatGPT and LLMs (large language models) have had for NVIDIA (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>), Qualcomm could see a massive acceleration in wins, orders, and revenue.</p> <p class=\"paywall-full-content invisible\">However, I don't see this happening in the next two quarters, barring some technology breakthrough announcement. Currently, the company is seeing consistent and meaningful wins, but nothing more than building the backlog at a respectable pace. If Qualcomm is to see a head-turning catalyst here, it's going to need a customer to break through the paradigm and endure an influx of customer demand.</p> <h2 class=\"paywall-full-content invisible\">Does The Chart Show Sentiment Shifting?</h2> <p class=\"paywall-full-content invisible\">So, with a lack of catalysts, my next tool is the chart to determine if the stock can find a meaningful bounce after a year-and-a-half decline.</p> <p class=\"paywall-full-content invisible\">In May, the stock completed a second recent test of the $100 support level, a level dating back two-and-a-half years, with a large gap looming below. With a double bottom in place, the stock attempted to re-enter the ascending channel (shown in green) but failed to capitalize on the first attempt.</p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2023/6/22/15511982-1687469070167692_origin.png\" rel=\"lightbox\" data-width=\"699\" data-height=\"531\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/6/22/15511982-1687469070167692.png\" alt=\"Qualcomm stock chart\" contenteditable=\"false\" loading=\"lazy\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>stockcharts.com, annotations mine</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">And backing up a bit, the upward green channel was a sign the stock wasn't ready to end its downtrend but merely consolidate the previous move from $190 to $103. Should the $100 level fail to hold, $95.28 is the level at the top of the large gap that ends at $88.58. This would be a prime accumulation area, should the opportunity present itself.</p> <p class=\"paywall-full-content invisible\">Overall, however, the chart looks less bearish and more constructive as the stock consolidates sideways. The price action over the last eight months, specifically the last two, shows bearish sentiment bottoming as it's unable to break support and is starting to turn neutral.</p> <h2 class=\"paywall-full-content invisible\">Why Continue To Hold?</h2> <p class=\"paywall-full-content invisible\">While the company doesn't have any near-term catalysts ahead of it, there isn't much to light a fire under the stock. However, because the chart shows bearish sentiment peaking and beginning to wane, even a small catalyst could send the stock back to the mid-$100s. This could be in the form of better Handset demand, faster-than-expected inventory drawdowns, a significant win in the Automotive or IoT segment, or a general outperformance in any of the quarters remaining in the fiscal year.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">While the stock has taken a beating over the last year-and-a-half, sentiment is beginning to shift. And this shift in sentiment is what sets the stock up to move higher on the next catalyst. Of course, demand and visibility could deteriorate further, but there are signs of bottoming across the semiconductor industry. While holding isn't a sexy recommendation, Qualcomm's stock is primed to move on any bullish catalyst, as the chart has been exhausted.</p>", "twitContent": "$QCOM - Qualcomm Lacks A Near-Term Catalyst But Keep Holding. https://seekingalpha.com/article/4613344-qualcomm-lacks-a-near-term-catalyst-but-keep-holding?source=tweet ", "innerMarketing": "<h2>Decrypt The Cash In Tech With Tech Cache</h2><p>Do two things to further your tech portfolio. First, click the 'Follow' button below next to my name. Second, become <a href=\"https://seekingalpha.com/author/joe-albano/research\"><strong>one of my subscribers risk-free</strong></a> with a free trial, where you'll be able to hear my thoughts as events unfold instead of reading my public articles weeks later only containing a subset of information. In fact, I provide <strong>four times more content</strong> (earnings, best ideas, trades, etc.) each month than what you read for free here. Plus, you'll get ongoing discussions among intelligent investors and traders in my chat room.</p><p><img src=\"https://static.seekingalpha.com/uploads/2022/6/21/15511982-16558567629170895.png\"></p><p><strong><a href=\"https://seekingalpha.com/author/joe-albano/research\">Join now</a>!</strong></p>", "marketingBullet": "Looking for more investing ideas like this one? Get them exclusively at Tech Cache. <a href='/checkout?service_id=mp_1133&source=mp_marketing_text_top' sasource='mp_marketing_text_top'>Learn More »</a>", "isReit": false, "videoData": null, "marketingBulletVariant": "I am Joe Albano, a tech insider. I lead the investing group <a href=\"/checkout?service_id=mp_1133&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A15511982%7Csection_asset%3Aauthor_bullets%3A-tech-cache\" data-test-id=\"author-custom-template-link\">Tech Cache</a> which delivers my industry insider expertise to those looking for the best long-term picks, trades, and chart analysis of tech stocks.", "marketingBio": "Joe Albano is a tech insider with a background and education in electrical and software engineering. He has a unique understanding of current technology and innovation trends as well as what companies are best positioned for future growth across all areas of tech.\n\nJoe leads the investing group <a href=\"/checkout?service_id=mp_1133&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A15511982%7Csection_asset%3Aauthor_root%3A-tech-cache\" data-test-id=\"author-custom-template-link\">Tech Cache</a> where he delivers industry insider expertise to those looking for the best long-term picks, trades, and technical analysis of tech and growth stocks. Features of the group include: access to Joe’s personal portfolio, 2-3 weekly investment ideas, a weekly summary and preview newsletter, watchlist stocks, an automated stock rating system, and live chat. Get a feel for Tech Cache by signing up for its Free Tier, no strings attached. <a href=\"/checkout?service_id=mp_1133&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A15511982%7Csection_asset%3Aauthor_root%3A-tech-cache\" data-test-id=\"author-custom-template-link\">Learn more</a>.", "audioDuration": null}, "relationships": {"author": {"data": {"id": "76115", "type": "author"}}, "sentiments": {"data": [{"id": "465858", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "1168", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "146", "type": "tag"}]}, "otherTags": {"data": [{"id": "464145", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "603709", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4613344-qualcomm-lacks-a-near-term-catalyst-but-keep-holding", "canonical": "https://seekingalpha.com/article/4613344-qualcomm-lacks-a-near-term-catalyst-but-keep-holding", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1091860622/image_1091860622.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "1133", "type": "authorResearch", "attributes": {"createdAt": "2017-04-26T14:13:57-04:00", "title": "Tech Cache", "rating": "5.0", "reviewCount": 24, "shortPitch": "The best tech and AI ideas from a technology insider", "categories": ["Growth", "Tech"], "serviceAssistantIds": [], "inAppPurchasesAllowedInIos": true, "inAppPurchasesAllowedInAndroid": true, "activeSubscriptionsCount": 10446, "androidIapPlan": "semi_annual", "iosIapPlan": "annual", "description": "Tech Cache is led by Joe Albano, an industry insider delivering ideas on tech, AI, and crypto. Tech Cache helps investors navigate the ever shifting landscape of the fundamentals and volatility of the charts. Generate the highest returns by buckling into the tech sector before the breakout and know when to get out of a technology investment to preserve gains before a potential breakdown.", "landingPageColor": "dark-green", "adUnits": ["direct_access", "trading_alert", "exclusive_idea", "weekly_news", "access_all", "wildcard"], "tempData": {}, "price": 60.0, "wildcardText": "Bi-weekly Live Webinars", "slug": "tech-cache", "annualPriceWithDiscount": 479.0, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": true}, "relationships": {"author": {"data": {"id": "76115", "type": "author"}}}}, {"id": "76115", "type": "author", "attributes": {"company": null, "slug": "joe-albano", "userId": 15511982, "tagId": 464145, "bio": "<p>Joe Albano is a tech insider with a background and education in electrical and software engineering. He has a unique understanding of current technology and innovation trends as well as what companies are best positioned for future growth across all areas of tech, including AI, as he has called it accurately over the last several years.</p><p> Joe leads the investing group<a href=\"https://seekingalpha.com/checkout?service_id=mp_1133\"> Tech Cache </a>where he delivers industry insider expertise to those looking for the best long-term picks, trades, and technical analysis of tech and growth stocks. Features of the group include: access to Joe’s personal portfolio, 2-3 weekly investment ideas, a weekly summary and preview newsletter, watchlist stocks, an automated stock rating system, and live chat. </p><p><a href=\"https://seekingalpha.com/checkout?service_id=mp_1133\">Learn more</a></p><p>.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/015/511/982/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/015/511/982/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/015/511/982/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/015/511/982/extra_large_pic.png"}, "nick": "Joe Albano", "deactivated": null, "memberSince": 2013, "isRss": false, "contributorSince": 2014, "followersCount": 16369}, "relationships": {"user": {"data": {"id": "15511982", "type": "user"}}, "userBioTags": {"data": [{"id": "1038033", "type": "userBioTag"}, {"id": "1038034", "type": "userBioTag"}, {"id": "1038035", "type": "userBioTag"}, {"id": "1038036", "type": "userBioTag"}, {"id": "1038037", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1133", "type": "authorResearch"}}}, "links": {"self": "/author/joe-albano", "profileUrl": "/author/joe-albano", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "1168", "type": "tag", "attributes": {"slug": "qcom", "name": "QCOM", "company": "QUALCOMM Incorporated", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "45", "type": "sector"}}}, "links": {"self": "/symbol/QCOM"}}, {"id": "146", "type": "tag", "attributes": {"slug": "aapl", "name": "AAPL", "company": "Apple Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/AAPL"}}, {"id": "464145", "type": "tag", "attributes": {"slug": "joe-albano", "name": "Joe Albano", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/joe-albano"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "603709", "type": "tag", "attributes": {"slug": "tier-1", "name": "Tier 1", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/tier-1"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "465858", "type": "sentiment", "attributes": {"articleId": 4613344, "type": "neutral", "createdAt": "2023-06-26T09:00:00.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4613344", "type": "article"}}, "tag": {"data": {"id": "1168", "type": "tag"}}}}]}