{"data": {"id": "4635321", "type": "fullArticle", "attributes": {"publishOn": "2023-09-14T21:57:20-04:00", "isLockedPro": false, "commentCount": 29, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"daan-rijnberk": {"id": 644134, "slug": "daan-rijnberk", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "growth": {"id": 115472, "slug": "growth", "kind": "common", "non_theme": true}, "qcom": {"id": 1168, "slug": "qcom", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "alpha-rich-investment-style": {"id": 114682, "slug": "alpha-rich-investment-style", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "information-technology": {"id": 45, "slug": "information-technology", "kind": "sector", "path": "/stock-ideas/technology", "title": "Tech ", "sasource": "theme_breadcrumb"}}, "title": "Qualcomm: Recent Developments Strengthen The Bull Case", "summary": ["Qualcomm's renewed agreement with Apple reduces the risk of losing its largest customer and provides a clearer path to medium-term financial stability.", "The company's strength in automotive technologies, evidenced by partnerships with leading OEMs, positions it for impressive growth in a rapidly expanding market.", "Qualcomm's efforts in developing an alternative PC processor, the Apple's M chips or AMD and Intel's Windows alternatives could give the company access to a massive new market.", "The recently released Q3 earnings report contained little positives as the company continues to be impacted by economic weakness.", "With an attractive valuation and a fair value estimate of $142 per share, Qualcomm presents an intriguing investment opportunity with a potential upside of 25.5%."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-09-15T03:46:44-04:00", "isModerated": false, "closestTradingDate": "2023-09-15", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 16, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w750\" alt=\"Qualcomm Office Building in San Diego, California\" data-id=\"1390379868\" data-type=\"getty-image\" width=\"1536px\" height=\"1017px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">AutumnSkyPhotography</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Investment thesis</h2> <p>I maintain my <a href=\"https://seekingalpha.com/author/daan-rijnberk?ticker=QCOM\">buy rating</a> on Qualcomm Incorporated (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/QCOM\" title=\"QUALCOMM Incorporated\">QCOM</a></span>) and update my revenue and EPS estimates following the company’s announcement of a renewed Apple deal, its Q3 results, and strong progress in its automotive segment.</p> <p>After<span class=\"paywall-full-content invisible\"> already significantly underperforming most of its peers in the first half of the year, shares are down another 13% since I last covered the company prior to its Q3 results in July, when I rated shares a buy. Meanwhile, the company’s financial results were far from bad and even included several positives. Furthermore, a new agreement with Apple (</span><a href=\"https://seekingalpha.com/symbol/AAPL\" title=\"Apple Inc.\" class=\"paywall-full-content invisible\">AAPL</a><span class=\"paywall-full-content invisible\">) lowers its risk profile and allows for a higher valuation multiple, and several automotive design wins paint a promising picture of the company’s automotive potential, further boosting my belief in its long-term prospects.</span></p> <p class=\"paywall-full-content invisible\">Now, before I dive into each of these subjects and update my financial outlook and price target for the company, let me quickly repeat my <a href=\"https://seekingalpha.com/article/4621757-qualcomm-fiscal-q3-earnings-preview-the-potential-to-outperform-is-there\">investment thesis</a>:</p> <blockquote class=\"paywall-full-content invisible\"> <p> </p> <p>Qualcomm fundamentally remains in excellent shape despite significant near-term headwinds. The company has faced challenges in its latest quarterly results, experiencing a massive deceleration in growth due to the economic downturn and declining personal electronics sales. However, Qualcomm's strong market position and technological leadership across its leading segments make it a primary beneficiary in the growing smartphone market, IoT chip market, and advanced automotive semiconductors market.</p> <p>The smartphone industry remains an essential revenue source for Qualcomm, and its 30% market share positions it well to capitalize on the predicted 7.3% CAGR through 2029. Additionally, the company's leading position in IoT chips, with a 38% market share, and automotive semiconductors, with an 80% market share in the automotive connectivity market, bodes well for future growth as these markets continue to expand.</p> <p>Despite short-term challenges, Qualcomm's healthy financials, including strong margins and ROE, and its ability to generate solid cash flows contribute to its excellent fundamental shape. The company's balance sheet allows for returning cash to shareholders through dividends and share repurchases.</p> </blockquote> <p class=\"paywall-full-content invisible\">In this article, I will take you through the latest developments and financial results and update my estimates and view on the company accordingly.</p> <h2 class=\"paywall-full-content invisible\">The new agreement with Apple is of significant importance</h2> <p class=\"paywall-full-content invisible\">Let’s start with the literal elephant in the room, Apple. One of the biggest overhangs on Qualcomm’s share price in recent years has been the risk of losing Apple as a customer as the company has long been working on replacing the Qualcomm chipsets in its devices with its in-house silicon. However, it has been unable to design and manufacture a matching product so far, which is why the company was forced to sign a new agreement with Qualcomm.</p> <p class=\"paywall-full-content invisible\">The new agreement recently announced by the pair means Qualcomm will continue to supply 5G modem chips to Apple for at least three more years until the end of 2026. This is amazing news for Qualcomm shareholders and will be a meaningful needle-mover in its medium-term financial projections.</p> <p class=\"paywall-full-content invisible\">Crucially, Apple is Qualcomm’s largest customer and accounts for a significant 20% or $9 billion of its FY22 revenue. Furthermore, according to calculations from <a href=\"https://seekingalpha.com/news/4010514-qualcomm-pops-as-apple-extends-chip-supply-agreement-until-2026\">Evercore analysts</a>, Apple likely also accounts for somewhere between $2 to $3 in earnings per share for Qualcomm, or around 20% at the midpoint.</p> <p class=\"paywall-full-content invisible\">Do note that this includes licensing and hardware sales, while this new agreement is only about the hardware side of the partnership. The current licensing agreement expires in 2025 with the option for another two years. In terms of impact on earnings, the licensing most likely accounts for a large part of this as this generally is a much higher margin business for Qualcomm. Nevertheless, both deals are of great importance for Qualcomm’s financials and it is not hard to see why losing Apple as a customer is a significant risk.</p> <p class=\"paywall-full-content invisible\">Furthermore, as materially the agreement is <a href=\"https://www.reuters.com/technology/qualcomm-supply-apple-with-5g-chips-until-2026-under-new-deal-2023-09-11/\" rel=\"nofollow\">unchanged</a> from previous years, the deal is worth many billions annually to Qualcomm as well. Qualcomm’s financial projections so far only assumed a fifth of Apple's iPhones using Qualcomm chips by 2026, but this estimate can now be revised upward.</p> <p class=\"paywall-full-content invisible\">Of course, through the new deal, the risk of losing Apple has not disappeared as Apple continues to work on developing its own 5G modem, but the agreement has given investors a clearer view of the company’s medium-term financials, which in itself should demand a higher premium.</p> <p class=\"paywall-full-content invisible\">Whether Apple will succeed at this in the next three years remains a question, but for now, the risk has simply been moved three years forward, allowing Qualcomm to use these revenues generated through the Apple deal to further grow and diversify the business, eventually lowering its dependence on Apple. Furthermore, as long as Qualcomm has superior technology and sits far ahead of Apple’s initiatives in terms of performance, I believe there is little chance of Apple replacing Qualcomm. So far, it seems to be unable to compete with the Qualcomm products.</p> <p class=\"paywall-full-content invisible\">By the time Apple might now replace Qualcomm’s chips, Apple will most likely represent a smaller share of revenue and earnings due to rapid growth in other business segments like IoT, Automotive, and potential ventures into new markets like PC processors. The result of Apple replacing the Qualcomm 5G modems will be far less impactful on the company’s financials by that time. Therefore, while the Apple business is not secured for the longer term, the risks have decreased meaningfully nevertheless lowering the company’s overall risk profile.</p> <h2 class=\"paywall-full-content invisible\">Qualcomm’s potential in the PC processor market is speculative, but it is there for sure</h2> <p class=\"paywall-full-content invisible\">Regarding Qualcomm’s revenue diversification away from Apple, one of the most significant opportunities to boost these efforts, apart from its existing segments and operations, seems to be the opportunities the company has in PC CPUs, which is a massive market currently dominated by Intel (<a href=\"https://seekingalpha.com/symbol/INTC\" title=\"Intel Corporation\">INTC</a>), Apple, and AMD (<a href=\"https://seekingalpha.com/symbol/AMD\" title=\"Advanced Micro Devices, Inc.\">AMD</a>).</p> <p class=\"paywall-full-content invisible\">Qualcomm is reportedly working with ARM technology and patents, acquired through the Nuvia acquisition, to design a challenger to these companies in the PC processor industry. Interestingly, Apple’s M chips are also designed using ARM technology, highlighting the potential of the technology.</p> <p class=\"paywall-full-content invisible\">Please do note that Qualcomm and ARM are involved in a <a href=\"https://www.digitimes.com/news/a20230913VL205/arm-ic-design-distribution.html\" rel=\"nofollow\">lawsuit</a> over the Nuvia ARM patents as ARM believes the Nuvia acquisition should not have transferred the patents to Qualcomm. There has been no update on this, but it is important to keep a close eye on this as it could result in Qualcomm losing a large part of its progress here.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976149931483_origin.jpg\" rel=\"lightbox\" data-width=\"800\" data-height=\"574\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976149931483.jpg\" alt=\"Apple currently owns 90% of the Arm-Based Laptop Market and the Trend will continue to take Market Share away from Intel - Patently Apple\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Counterpoint Research</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Qualcomm releasing a PC CPU <a href=\"https://www.techzine.nl/nieuws/infrastructure/486425/qualcomm-kondigt-eerste-nuvia-arm-processors-aan-voor-eind-2023/\" rel=\"nofollow\">this year</a> has been the expectation for a while. However, sources claim the company has so far made little progress and has had to deal with <a href=\"https://itdaily.be/nieuws/kantoor/qualcomm-sukkelt-met-ontwikkeling-apple-m-uitdager/\" rel=\"noopener\">performance problems</a>. At the same time, <a href=\"https://tweakers.net/nieuws/207586/gerucht-dell-brengt-volgend-jaar-laptops-met-qualcomm-soc-uit.html\" rel=\"nofollow\">other reports state</a> that Dell could start shipping PCs and laptops with Qualcomm-socs starting next year already.</p> <p class=\"paywall-full-content invisible\">For now, this is all speculation, but the company clearly is working on competing in the laptop CPU industry, potentially opening it up to a massive new market. Looking at the Nuvia technology acquired by Qualcomm, I see the potential for Qualcomm to produce a chip that could compete despite a rough history between Windows and ARM chips.</p> <p class=\"paywall-full-content invisible\">Furthermore, while the PC processor market is not fast-growing, with an expected CAGR of around <a href=\"https://www.maximizemarketresearch.com/market-report/global-pc-processor-market/93456/\" rel=\"noopener\">4%</a> through 2030, the market offers massive potential for Qualcomm if the company could design alternatives to AMD and Intel at a similar or even better quality. With a market size of $130 billion by 2030, the potential clearly is huge if it can get a foot in, making it an interesting subject to keep a close eye on for Qualcomm investors.</p> <h2 class=\"paywall-full-content invisible\">Qualcomm is a leader in automotive technologies, giving it great potential in a rapidly growing market</h2> <p class=\"paywall-full-content invisible\">Another notable <a href=\"https://seekingalpha.com/news/4009077-qualcomm-unveils-deals-with-mercedes-bmw-aws-partnership\">announcement</a> from Qualcomm last quarter was the unveiling of deals with some of the largest automotive OEMs globally. The company announced new deals with Mercedes (<a href=\"https://seekingalpha.com/symbol/MBGAF\" title=\"Mercedes-Benz Group AG\">OTCPK:MBGAF</a>) and BMW (<a href=\"https://seekingalpha.com/symbol/BMWYY\" class=\"ticker-link\">BMWYY</a>), two of the leading manufacturers of luxury cars, to provide chips for in-car infotainment systems.</p> <p class=\"paywall-full-content invisible\">At this time last year, Qualcomm announced it already had a backlog of over <a href=\"https://www.qualcomm.com/news/releases/2022/09/qualcomm-s-automotive-design-win-pipeline-expands-to--30-billion\" rel=\"nofollow\">$30 billion</a> of automotive design wins. This latest announcement of automotive partnerships further solidifies Qualcomm’s strength in automotive. Add to this the 12 new Snapdragon Cockpit and Snapdragon Connectivity 5G Platform designs with automakers globally in Q2 and it is safe to assume the backlog today sits between $35 billion to $40 billion, by far the largest backlog of any of its peers.</p> <p class=\"paywall-full-content invisible\">Qualcomm’s automotive segment has been growing rapidly over recent years and the company seems to have an edge over many competitors like Nvidia and Mobileye (<a href=\"https://seekingalpha.com/symbol/MBLY\" title=\"Mobileye Global Inc.\">MBLY</a>) in terms of automotive technologies. In fact, with the new Qualcomm partnership, <a href=\"https://www.fierceelectronics.com/electronics/aws-and-qualcomm-co-innovate-around-auto-bmw-one\" rel=\"nofollow\">BMW has moved away from Nvidia</a> after earlier moving away from Mobileye, potentially indicating Qualcomm has the best offering today.</p> <p class=\"paywall-full-content invisible\">Qualcomm supplies automotive chips broadly targeting three areas, namely infotainment and digital cockpit solutions, connectivity, and advanced driver assistance systems under its “digital chassis” platform. Automotive chips for electrification and advanced digital systems like autonomous driving and digital cockpit present a potential $30 billion market for Qualcomm, of which it currently takes a large share.</p> <p class=\"paywall-full-content invisible\">From ADAS systems to car connectivity and digital cockpits, <a href=\"https://www.qualcomm.com/products/automotive\" rel=\"nofollow\">Qualcomm offers</a> it all through its single Snapdragon digital chassis platform. This one platform offering makes it a very interesting and convenient pick for car OEMs.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976154561455_origin.png\" rel=\"lightbox\" data-width=\"1386\" data-height=\"447\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976154561455.png\" alt=\"Afbeelding met tekst, schermopname, ontwerp Automatisch gegenereerde beschrijving\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Qualcomm automotive offering <span>(Qualcomm)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-1694697615354829_origin.png\" rel=\"lightbox\" data-width=\"1387\" data-height=\"419\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-1694697615354829.png\" alt=\"Afbeelding met tekst, Lettertype, nummer, schermopname Automatisch gegenereerde beschrijving\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Qualcomm automotive offering <span>(Qualcomm)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Qualcomm also currently <a href=\"https://www.counterpointresearch.com/insights/automotive-connectivity-market-h1-2022/\" rel=\"noopener\">controls 80%</a> of the automotive connectivity market through its specialism in 5G and IoT, which is part of the vehicle-to-everything ecosystem. Vehicle-to-everything technology refers to the sensors, cameras, and wireless connectivity that allow vehicles to share real-time information with their drivers and other vehicles to create road safety and traffic management and is a crucial part of autonomous driving technologies.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976149977527_origin.png\" rel=\"lightbox\" data-width=\"979\" data-height=\"842\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976149977527.png\" alt=\"Automotive connectivity chipset market Counterpoint\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Counterpoint Research</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">The frontrunner in this technology is Autotalks, which Qualcomm will acquire if it can get permission from European regulators. Qualcomm would get access to interesting technologies that could further enhance its automotive offering. Therefore, the deal has clear value, and it could further strengthen the company’s competitive edge and presence in the automotive industry.</p> <p class=\"paywall-full-content invisible\">Total automotive revenue stood at $975 million in FY21 and rose to $1.3 billion in FY22. Furthermore, Qualcomm estimates that the number could grow to $4 billion by FY26 and $9 billion by 2031. Qualcomm has a long-growth runway in this business, estimating that the total addressable market for its automotive target market will be $100 billion by 2030, driven mainly by a rapidly growing ADAS market.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976152519794_origin.png\" rel=\"lightbox\" data-width=\"1386\" data-height=\"447\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976152519794.png\" alt=\"Afbeelding met tekst, schermopname, Lettertype, logo Automatisch gegenereerde beschrijving\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Qualcomm</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\"><a href=\"https://www.forbes.com/sites/greatspeculations/2023/05/19/can-qualcomm-count-on-automotive-sector-to-drive-its-next-wave-of-growth/?sh=62abd2266bd4\" rel=\"noopener\">According to Deloitte</a>, digital systems today account for over 40% of a car’s cost already, which could rise to 45% by the end of the decade. To highlight the value Qualcomm could get from every single car manufactured by a partner OEM, this is what <a href=\"https://www.cnbc.com/2023/08/31/qualcomm-banks-on-ai-to-grow-automotive-chip-business.html\" rel=\"noopener\">CNBC wrote</a>:</p> <blockquote class=\"paywall-full-content invisible\"><p>Qualcomm makes between $200 and $3,000 per car that uses its chips and software, officials said last fall at an investor event. The company also makes $5 per car that’s connected to 5G through licensing fees.</p></blockquote> <p class=\"paywall-full-content invisible\">So, as Qualcomm keeps winning automotive design wins from large OEMs, it should be poised for impressive revenue growth over the remainder of the decade, indeed. A $9 billion estimate by 2030 sounds like a very realistic scenario to me, especially as I expect it to keep winning more OEM deals.</p> <p class=\"paywall-full-content invisible\">The best proof of how strong Qualcomm’s automotive platform and offering is are the many deals it has already signed with the world’s largest OEMs—a very impressive feat to say the least but above all, a promising picture.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-1694697616525277_origin.png\" rel=\"lightbox\" data-width=\"1387\" data-height=\"388\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-1694697616525277.png\" alt=\"Afbeelding met tekst, Lettertype, schermopname Automatisch gegenereerde beschrijving\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Qualcomm OEM partnerships <span>(Qualcomm)</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">Qualcomm keeps fighting economic headwinds without much success</h2> <p class=\"paywall-full-content invisible\"><a href=\"https://d1io3yog0oux5.cloudfront.net/_41a23eee8678c5540105f02c9d3746dc/qualcomm/db/773/7309/file/FY+2023+3rd+Quarter+Earnings+Release.pdf\" rel=\"nofollow\">Qualcomm reported its fiscal Q3 earnings</a> on August 2, and while I expected to see a flattening in the declining revenue and earnings trends, this was not the case as weakness in its end markets persisted. The reported revenue number showed a further acceleration in the negative growth rates it has been reporting for three straight quarters now as a result of a significant slowdown in handset sales and a weak demand environment impacting its IoT revenue.</p> <p class=\"paywall-full-content invisible\">Revenue of $8.44 billion missed my estimates by $370 million. This miss was mainly the result of continued inventory adjustments at customers and investments by customers not yet materializing in boosted growth rates for Qualcomm, contrary to my expectations as I expected the handset segment to see an improvement in Q3, but this was not the case as handset revenue declined by 23% YoY, a worsening from the 17% growth decline reported in Q2. This disappointing performance has led to downgraded near-term expectations from analysts and a downgraded FY23 outlook.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976165407124_origin.png\" rel=\"lightbox\" data-width=\"860\" data-height=\"512\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976165407124.png\" alt=\"Afbeelding met tekst, schermopname, Lettertype, diagram Automatisch gegenereerde beschrijving\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>By Author</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Handset revenue was $5.3 billion and continued to reflect a treacherous landscape. However, please do consider, as I have said many times in prior articles, that these negative growth rates are simply the result of a cyclical downturn in the handset industry and while they impact the company’s near-term potential, the long-term outlook remains unchanged.</p> <p class=\"paywall-full-content invisible\">Fundamentally, the company remains in excellent shape and remains well-positioned as one of the industry leaders to benefit from mid-to-high-single-digit long-term growth in the handset industry. Qualcomm’s Snapdragon products will remain a number one choice for Android-powered brands, and we should expect this segment to quickly recover over the next years as the smartphone industry does the same, although the weakness might persist somewhat longer than previously anticipated.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976168783221_origin.png\" rel=\"lightbox\" data-width=\"860\" data-height=\"512\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976168783221.png\" alt=\"Afbeelding met tekst, schermopname, Lettertype, diagram Automatisch gegenereerde beschrijving\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>By Author</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Furthermore, the IoT segment also continued to struggle, reporting a revenue decline of 24% YoY, far worse than my 14% to 18% revenue decline expectation. Still, there was a slight improvement in the segment as revenue did grow 7% sequentially to $1.5 billion, driven by increased demand from consumer and industrial customers. Still, IoT inventory remained elevated due to the overall weak demand resulting from disappointing hardware sales. For now, management expects this to last through the end of the year, also impacting guidance for the next quarter.</p> <p class=\"paywall-full-content invisible\">Again, IoT remains a massive growth opportunity for Qualcomm and the company is an industry leader. Once the economy recovers and hardware sales return to growth, the expected growth in the IoT market through 2030 will also drive significant double-digit growth for Qualcomm. Current near-term weakness does not damage the long-term potential.</p> <p class=\"paywall-full-content invisible\">With these comments, I am not saying that the sales underperformance from the company last quarter and likely going into the next couple of quarters is any good. It isn’t. However, long-term investors should focus on fundamental developments instead of near-term financials impacted by economic weakness. In the end, the company is highly cyclical, mainly due to its exposure to the smartphone market and this is something investors will have to cope with. It for sure is not a reason to sell, most definitely right now as things are slowly improving.</p> <p class=\"paywall-full-content invisible\">Finally, there was one bright spot last quarter as the automotive segment continued to grow revenue. Growth in the company’s automotive segment also slowed down further to just 13%, but at least remained positive as trends like the increased number of technologies in cars and increase in EV shipments were able to offset economic weakness.</p> <p class=\"paywall-full-content invisible\">In terms of margins, Qualcomm performed much stronger than I expected, especially considering the continued top-line weakness. The company deserves some credit for this. The company managed to keep operating expenses flat YoY at $2.2 billion, limiting the impact of the top-line decline on margins.</p> <p class=\"paywall-full-content invisible\">It achieved this despite continuously growing its R&amp;D investments, up another 10% YoY in Q3 and up slightly sequentially. I am happy to see Qualcomm management remaining committed to its R&amp;D investments as this positions it favorably for a return to strong growth over the next couple of years and should help it maintain its leading position across its end markets.</p> <p class=\"paywall-full-content invisible\">As a result, the net income margin declined further, down 70 basis points sequentially and 530 basis points YoY to 25.4%. While this might sound quite bad, this beat my expectations and led to a solid EPS performance as this beat the <a href=\"https://seekingalpha.com/news/3995747-qualcomm-non-gaap-eps-of-1_87-beats-0_06-revenue-of-8_44b-misses-70m\">consensus</a> by $0.07 and my estimates by $0.01 despite a significant top-line miss. EPS was still down 37% YoY.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-1694697616597614_origin.png\" rel=\"lightbox\" data-width=\"860\" data-height=\"512\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-1694697616597614.png\" alt=\"Afbeelding met tekst, schermopname, Lettertype, Perceel Automatisch gegenereerde beschrijving\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>By Author</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">Outlook &amp; QCOM stock valuation</h2> <p class=\"paywall-full-content invisible\">While my expectations for a bottom in the negative and accelerating growth rates in Q3 did not materialize, management’s guidance for Q4 shows some improvement and is far from bad. Management forecasts revenue in the range of $8.1 billion to $8.9 billion, quite a wide range, I must say. Management has communicated before that it has little visibility on economic and demand developments, which is also reflected in its Q4 guidance.</p> <p class=\"paywall-full-content invisible\">This reflects an expectation for handset revenues to be flat sequentially or down around 19% YoY, assuming this comes in at around $5.3 billion. Looking at sales data from the last months, I expect Qualcomm to perform slightly better and report handset revenue of closer to $5.4 billion to $5.5 billion. However, this will still highly depend on economic developments and a possible China recovery in the remainder of the quarter. Management expects handset revenues to improve more significantly by Q1.</p> <p class=\"paywall-full-content invisible\">For the IoT segment, management expects to report a mid-single-digit sequential decline, while automotive is expected to show another quarter of resilience with revenues expected to be up by low-double digits. Furthermore, management aims to keep operating expenses flat as operational cost measures should offset the continued rise in R&amp;D expenses. This should lead to EPS in the range of $1.80 to $2, down 39% at the midpoint.</p> <p class=\"paywall-full-content invisible\">Overall, the Q4 outlook might not look overly optimistic but could indicate a bottom with growth returning heading into the company’s FY24 fiscal year.</p> <p class=\"paywall-full-content invisible\">Based on these recent developments, the company’s slightly disappointing Q3 results, and Q4 outlook in line with estimates and potentially indicating a bottom in the cycle for Qualcomm, I have lowered my medium-term revenue and EPS estimate as I expect economic weakness to remain a drag on the company’s performance in the first half of FY24 and expect the following recovery to be gradual. Nevertheless, I remain bullish on the company’s long-term prospects due to its strong market share and the massive potential I see for the company in automotive. Therefore, I now project the following financial results through FY26.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-1694697616380001_origin.png\" rel=\"lightbox\" data-width=\"1072\" data-height=\"248\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-1694697616380001.png\" alt=\"Afbeelding met tekst, schermopname, Lettertype, nummer Automatisch gegenereerde beschrijving\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Financial projections <span>(By Author)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">These updated estimates and the lower share price mean Qualcomm now trades at a forward earnings multiple of 13.68x, which sits around 20% below its 5-year average and makes it one of the cheapest among its peers.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976161425772_origin.png\" rel=\"lightbox\" data-width=\"1387\" data-height=\"124\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/14/55767760-16946976161425772.png\" alt=\"comparison\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Valuation peer comparison <span>(Seeking Alpha)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">As for a fair multiple, this is what I wrote a couple of months ago:</p> <blockquote class=\"paywall-full-content invisible\"><p>Taking this<strong> [undervaluation to its peers] </strong>into account, as well as the company’s strong market position and solid outlook, but also the significant risks that come with an investment in Qualcomm, I remain of the belief that a P/E of 15x is fair for this company. Its China exposure and the probability and effect of losing Apple as a customer over the next several years are risks that require a significant discount.</p></blockquote> <p class=\"paywall-full-content invisible\">The one big change since this article is that the company signed a new three-year agreement with Apple, removing a significant risk to the company’s financials and therefore allowing for higher earnings multiple to be rewarded. Thus, I increase my fair P/E multiple to 17x, which seems appropriate when considering the lowered risk profile and solid growth outlook.</p> <p class=\"paywall-full-content invisible\">Also, we should not forget Qualcomm still pays an excellent dividend, which currently yields close to 3% on a low payout ratio of just 32%, even as the company’s cash flow levels have decreased significantly. The dividend looks very well covered and should have plenty of room to keep growing as it has one for the last 19 years already.</p> <p class=\"paywall-full-content invisible\">Using a 17x earnings multiple and my lowered FY24 EPS projection, I calculate a price target of $159 per share. Going with an annual return of around 10% (or close to 13%, including the dividend), I believe fair value sits around $142 per share, indicating shares are currently undervalued by 25.5%.</p> <h2 class=\"paywall-full-content invisible\">Conclusion</h2> <p class=\"paywall-full-content invisible\">Qualcomm presents an intriguing investment opportunity despite recent challenges and headwinds. While the company has faced short-term setbacks, including a decline in handset and IoT revenue, it remains fundamentally sound and well-positioned to capitalize on long-term growth opportunities.</p> <p class=\"paywall-full-content invisible\">The renewed agreement with Apple, which ensures the supply of 5G modem chips until the end of 2026, is a significant milestone that reduces the risk associated with losing its largest customer. This agreement not only secures substantial revenue but also provides Qualcomm with a clearer path to medium-term financial stability.</p> <p class=\"paywall-full-content invisible\">Qualcomm's strength in automotive technologies is another compelling aspect of its growth story. The company's partnerships with automotive OEMs and its backlog of design wins indicate a strong position in this rapidly expanding market. With projections of automotive revenue potentially reaching $9 billion by 2031, Qualcomm's automotive segment is poised for impressive growth.</p> <p class=\"paywall-full-content invisible\">In terms of valuation, Qualcomm currently trades at an attractive forward earnings multiple of 13.68x, making it one of the cheaper options among its peers. Considering the reduced risk profile due to the Apple agreement and the solid growth outlook, a fair P/E multiple of 17x is reasonable. Factoring in this valuation, Qualcomm's shares appear undervalued, with a fair value estimate of $142 per share, indicating a 25.5% potential upside.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Therefore, I rate shares a Buy.</p>", "twitContent": "$QCOM - Qualcomm: Recent Developments Strengthen The Bull Case. https://seekingalpha.com/article/4635321-qualcomm-recent-developments-strengthen-the-bull-case?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "106771", "type": "author"}}, "sentiments": {"data": [{"id": "485782", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "1168", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "644134", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "115472", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "114682", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4635321-qualcomm-recent-developments-strengthen-the-bull-case", "canonical": "https://seekingalpha.com/article/4635321-qualcomm-recent-developments-strengthen-the-bull-case", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1390379868/image_1390379868.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "106771", "type": "author", "attributes": {"company": null, "slug": "daan-rijnberk", "userId": 55767760, "tagId": 644134, "bio": "<p>Daan Rijnberk is an independent investor and author who focuses on finding businesses with a strong moat, healthy financials, and a promising growth outlook to deliver investors stable and above-average long-term profits. This includes a combination of both value and growth opportunities across industries to help readers build well-diversified portfolios. </p><p>The articles aim not to make quick gains but to achieve long-term sustainable growth by identifying the most promising opportunities in the markets at a fair price. The leading strategy is to buy and hold for as long as the investment thesis is intact. Therefore, an update on most of the covered equities will be provided<span> every 3-6 (In some cases 12) months to keep the rating and thesis up-to-date. </span></p><p>Built upon professional experience and personal interests, Daan has specific expertise in semiconductors and fintech. <br></p><p>Articles and analyses are published exclusively on Seeking Alpha. <br></p>", "image": {"small": "https://static.seekingalpha.com/images/users_profile/055/767/760/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/055/767/760/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/055/767/760/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/055/767/760/extra_large_pic.png"}, "nick": "Daan Rijnberk", "deactivated": null, "memberSince": 2022, "isRss": false, "contributorSince": 2022, "followersCount": 1707}, "relationships": {"user": {"data": {"id": "55767760", "type": "user"}}, "userBioTags": {"data": [{"id": "1005383", "type": "userBioTag"}, {"id": "1005384", "type": "userBioTag"}, {"id": "1005385", "type": "userBioTag"}, {"id": "1005386", "type": "userBioTag"}, {"id": "1005387", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/daan-rijnberk", "profileUrl": "/author/daan-rijnberk", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "1168", "type": "tag", "attributes": {"slug": "qcom", "name": "QCOM", "company": "QUALCOMM Incorporated", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "45", "type": "sector"}}}, "links": {"self": "/symbol/QCOM"}}, {"id": "644134", "type": "tag", "attributes": {"slug": "daan-rijnberk", "name": "Daan Rijnberk", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/daan-rijnberk"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "115472", "type": "tag", "attributes": {"slug": "growth", "name": "Growth", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=growth"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "114682", "type": "tag", "attributes": {"slug": "alpha-rich-investment-style", "name": "Alpha-Rich Investment Style", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/alpha-rich-investment-style"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "485782", "type": "sentiment", "attributes": {"articleId": 4635321, "type": "bullish", "createdAt": "2023-09-14T21:57:20.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4635321", "type": "article"}}, "tag": {"data": {"id": "1168", "type": "tag"}}}}]}