{"data": {"id": "4636699", "type": "fullArticle", "attributes": {"publishOn": "2023-09-22T04:25:50-04:00", "isLockedPro": false, "commentCount": 13, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"gytis-zizys": {"id": 677972, "slug": "gytis-zizys", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "qcom": {"id": 1168, "slug": "qcom", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "information-technology": {"id": 45, "slug": "information-technology", "kind": "sector", "path": "/stock-ideas/technology", "title": "Tech ", "sasource": "theme_breadcrumb"}}, "title": "Qualcomm Inc.: Long-Term Situation Is Intact, Reiterate Buy", "summary": ["Qualcomm's contract with Apple provides stability and revenue for the next three years, while it reduces reliance on Apple in the long run.", "China's campaign to become self-sufficient in semiconductors poses a risk, but the quality of domestic chips may not match established players like Qualcomm.", "Despite short-term risks and negative sentiment, QCOM is expected to persevere, diversify its revenue streams, and reward patient shareholders in the long run."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-09-22T04:25:50-04:00", "isModerated": false, "closestTradingDate": "2023-09-22", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 10, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no stock, option or similar derivative position in any of the companies mentioned, but may initiate a beneficial Long position through a purchase of the stock, or the purchase of call options or similar derivatives in QCOM over the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-w750\" alt=\"Latest Consumer Technology Products On Display At CES 2017\" data-id=\"631095956\" data-type=\"getty-image\" width=\"3000px\" height=\"1507px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"></picture><figcaption><p class=\"item-credits\">Ethan Miller</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2><strong>Investment Thesis</strong></h2> <p>With the continuing negative sentiment surrounding Qualcomm (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/QCOM\" title=\"QUALCOMM Incorporated\">QCOM</a></span>), I wanted to take a look at what investors are fearing the most about the company's outlook and how I think that the company will be able<span class=\"paywall-full-content invisible\"> to survive the short-term noise and will reward patient shareholders in the long run. I </span><a href=\"https://seekingalpha.com/article/4616121-qualcomm-seems-like-a-steal-at-these-prices\" class=\"paywall-full-content invisible\">covered QCOM previously</a><span class=\"paywall-full-content invisible\"> in early July.</span></p> <h2 class=\"paywall-full-content invisible\"><strong>Apple Contract</strong></h2> <p class=\"paywall-full-content invisible\">A big reason for underperformance is that Apple (<a href=\"https://seekingalpha.com/symbol/AAPL\" title=\"Apple Inc.\">AAPL</a>) is a big customer of QCOM, relying on the company's 5G Modem RF chips for their phones. Just a couple of months back, everyone thought that Apple would soon be able to produce its chips for their phones and would drop QCOM altogether. Now that fear has been gone for at <a href=\"https://www.qualcomm.com/news/releases/2023/09/qualcomm-announces-agreement-with-apple-for-chip-supply\" rel=\"nofollow\">least 3 years</a> as the company has extended its contract with QCOM to keep supplying the product. I know 3 years is not that much time, but the revenues are going to be sustained for now. What could happen in the next 3 years is Apple will start to make their chips sure, but by that time I also expect QCOM to not be dependent on Apple revenue as the company expects to reduce its reliance <a href=\"https://www.cnbc.com/2021/11/16/qualcomm-stock-hits-record-high-after-it-says-it-will-grow-without-apple.html\" rel=\"nofollow\">on AAPL to low-single digits</a>.</p> <p class=\"paywall-full-content invisible\">What can also happen in those three years is that they keep extending the contract further as the company continues to struggle with the manufacturing of high-quality RF chips that would compare to QCOM. An <a href=\"https://www.macrumors.com/2023/09/21/apple-wsj-5gm-modem-project-challenges/\" rel=\"nofollow\">article recently published</a> says that Apple is three years behind QCOM's best chip, which coincidentally coincides with the extended contract. AAPL's tested chips were too big and were prone to overheating because everyone on the engineering team was not working like an actual team and there were too many obstacles that made it impossible to produce a decent chip.</p> <p class=\"paywall-full-content invisible\">Sure, the company is supposedly going to have a chip that is as good as QCOM's best TODAY. QCOM is not going to sit around for 3 years and do nothing in that time. The company will be looking to further diversify its business, which means less reliance on AAPL, and most likely their chips are going to continue to be top quality, while newcomers like Apple in the RF chip business may continue to lag in terms of quality.</p> <h2 class=\"paywall-full-content invisible\"><strong>Made in China 2025 Campaign</strong></h2> <p class=\"paywall-full-content invisible\">Another big worry that keeps the company relatively cheap and unloved by investors is the fear that China is going to become <a href=\"https://www.bing.com/search?pglt=129&amp;q=Made+in+China+2025+Campaign&amp;cvid=d536b73885a344b5ad97a17e22c3e95f&amp;gs_lcrp=EgZjaHJvbWUyBggAEEUYOTIECAEQADIECAIQADIECAMQADIECAQQADIECAUQADIECAYQADIECAcQADIECAgQANIBBzgzMGowajGoAgCwAgA&amp;FORM=ANNTA1&amp;PC=LCTS\" rel=\"nofollow\">self-sustained by 2025</a> in terms of semiconductor production. The government is plowing billions of dollars into this cause. China is the largest revenue generator for QCOM, so I get that it is scary that Chinese companies will switch away from QCOM's products for something home-grown. China is throwing a lot of subsidies to its local companies and this campaign is no different. Subsidies help local businesses to develop new products that will benefit the overall campaign goal. Companies get tax breaks and that is not a new thing as many countries are doing it, especially when it comes to EVs and China is the <a href=\"https://asia.nikkei.com/Spotlight/Electric-cars-in-China/China-led-world-with-500-000-electric-car-exports-in-2021#:~:text=According%20to%20Nikkei%20research%20based,Japan%20accounted%20for%20just%200.9%25.\" rel=\"nofollow\">largest producer</a> of EVs in the world.</p> <p class=\"paywall-full-content invisible\">Why am I bringing up EVs here? Well, the EV industry is thriving in China due to the subsidies the government is providing, or should I say has provided in the past. <a href=\"https://www.msn.com/en-us/autos/news/here-s-why-china-has-thousands-of-abandoned-cars-rotting-in-fields/ar-AA1g3YqS\" rel=\"nofollow\">Now, with the reduced subsidies</a> in place, many EV car-sharing companies in China have gone out of business. Many companies decided to enter the EV market and produce low-quality EVs for the tax breaks, sell the EVs to car-sharing companies, and repeat the process because it was profitable. When subsidies started to dry out, many of these companies got squeezed and went out of business, and now all of a sudden there are EV graveyards all around China, reminiscent of the boom-bust of the <a href=\"https://flatbike.com/chinas-huge-bicycle-graveyards-and-why-they-matter/\" rel=\"nofollow\">bike-sharing scheme</a> a few years back.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/21/48589448-16953393464234326_origin.jpg\" rel=\"lightbox\" data-width=\"752\" data-height=\"422\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/21/48589448-16953393464234326.jpg\" alt=\"EV graveyard in China\" width=\"640\" height=\"359\" contenteditable=\"false\" data-width=\"640\" data-height=\"359\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">EV graveyard in China (MSN)</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">The point I'm making here is this. The government will throw money at the semiconductor companies to develop new chips so they will rely less on the bigger players like Taiwan Semiconductor (<a href=\"https://seekingalpha.com/symbol/TSM\" title=\"Taiwan Semiconductor Manufacturing Company Limited\">TSM</a>) or QCOM, but that doesn't mean the quality will be as good as the players who already have decades of experience and are well ahead of the competition. Companies will be incentivized to come out with chips that are of lower quality just to get the tax breaks and we will see another graveyard starting in the near future if the campaign is unsuccessful.</p> <p class=\"paywall-full-content invisible\">The plan that was introduced in 2015, targeted 70% semiconductor self-sufficiency by 2025, however, even in 2020, the country took <a href=\"https://semiengineering.com/china-accelerates-foundry-power-semi-efforts/\" rel=\"nofollow\">in over 80% of its chip needs</a> from abroad, which tells me that the campaign is not going according to plan. Even with such efforts from the country that wants to strengthen its presence and be less reliant on companies from abroad, one analyst believes that the efforts will yield lower-than-expected results, meaning by the end of the decade, China will be able <a href=\"https://www.etcentric.org/chinas-five-year-plan-to-build-domestic-chip-manufacturing/#:~:text=Over%20the%20next%20five%20years%2C%20China%20plans%20to,creating%20local%20companies%20for%20relevant%20software%20and%20hardware.\" rel=\"nofollow\">to supply 35%</a> of its domestic demand of semis.</p> <p class=\"paywall-full-content invisible\">In summary, I believe that the contract with AAPL is providing the company with time to continue its plan to be less reliant on Apple for revenue, which I think is going to work out in the end and the company will not have that hovering over its head. China, although a serious problem, is going slightly slow on its plan of becoming self-sufficient and I believe QCOM will continue to enjoy high revenues going forward.</p> <h2 class=\"paywall-full-content invisible\"><strong>Risks</strong></h2> <p class=\"paywall-full-content invisible\">While we're on the topic of China, one big risk that prevents people from investing in QCOM is the geopolitical risks between the US and China. This one bears the biggest question mark of all the risks. We don't know how further actions of the two countries will affect QCOM in the long run. One way it is affected is by associating with Apple as it was announced recently <a href=\"https://seekingalpha.com/news/4010025-qualcomm-leads-chips-lower-amid-iphone-china-worries\">that iPhones are banned</a> in government agencies and other state-owned entities.</p> <p class=\"paywall-full-content invisible\">China's campaign is successful at meeting its tight deadline and the country becomes self-sufficient, which means QCOM's revenues plummet, and so does the whole company. This one is less likely to happen any time soon in my opinion, but if the company isn't able to further diversify its revenue streams away from China, this will impact the company's top line severely.</p> <p class=\"paywall-full-content invisible\">The next worry of mine is more short-term noise. The volatile macroeconomic situation, coupled with the negative sentiment in the semiconductor industry lasts longer, which in turn will bring more volatility to the stock markets and bring down QCOM and many other companies, which I think will only present an even better entry point than right now.</p> <p class=\"paywall-full-content invisible\">Not many risks, however, they are quite big risks. In the long run, I believe the company is going to persevere and reward its current shareholders once the dust has settled.</p> <h2 class=\"paywall-full-content invisible\"><strong>Briefly on the latest financials and quarter results</strong></h2> <p class=\"paywall-full-content invisible\"><a href=\"https://www.bamsec.com/filing/80432823000043?cik=804328\" rel=\"nofollow\">As of Q3 '23</a>, the company had $8.5B in liquidity against $14B in long-term debt. I don't think debt is an issue for the company as long as it can cover annual interest expenses comfortably, and QCOM is in that position. Operating income stood at $6.3B as of Q3, while interest expense was $521m. That means the interest coverage ratio is around 12x. For reference, many analysts consider 2x to be healthy, while I consider 5x to be the minimum as I like to be more stringent.</p> <p class=\"paywall-full-content invisible\">The current ratio stood at around 2.4, which is also very good. A little too good in my opinion, which makes it slightly inefficient in my view. I would like to see the company achieving 1.5-2.0 as I believe this range is more efficient. This range strikes a good balance between being able to pay off short-term obligations and using the company's assets like cash for further growth of the company. It is safe to say the company is at no risk of insolvency and has no liquidity issues.</p> <p class=\"paywall-full-content invisible\">Profitability and efficiency metrics are all still very good, which tells me the company has a strong competitive advantage and a moat, and the management is utilizing the company's assets and shareholder equity efficiently.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><img src=\"https://static.seekingalpha.com/uploads/2023/9/21/48589448-16953393923370597.jpg\" alt=\"Profitability and Efficiency Metrics of QCOM\" width=\"570\" height=\"122\" contenteditable=\"false\" data-width=\"570\" data-height=\"122\" loading=\"lazy\"></picture><figcaption><p class=\"item-caption\">Profitability and Efficiency Metrics (Seeking Alpha)</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Quarterly results are too short-sighted in my opinion. The company saw a 22% decline in revenues, which was not a surprise in the slightest. Many semiconductor companies have been guiding poor numbers for the rest of the year and early next year, due to the negative sentiment in the semiconductor market. I'm more interested in the future of the sector, which is expected to see <a href=\"https://www.gartner.com/en/newsroom/press-releases/2023-02-02-navigating-the-dynamics-of-the-chip-market-cyclicality-is-back\" rel=\"nofollow\">16.3% growth</a> in '24.</p> <h2 class=\"paywall-full-content invisible\"><strong>Valuation</strong></h2> <p class=\"paywall-full-content invisible\">I've updated my valuation slightly with more updated financials and with the stock price coming down since my last article a couple of months back, I am upgrading my rating to Strong Buy and putting a fair price of QCOM at $130 a share, implying that the company is trading at a 20% discount to its fair value.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/9/21/48589448-16953394411598544_origin.jpg\" rel=\"lightbox\" data-width=\"752\" data-height=\"172\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/9/21/48589448-16953394411598544.jpg\" alt=\"Intrinsic Value of QCOM\" width=\"640\" height=\"146\" contenteditable=\"false\" data-width=\"640\" data-height=\"146\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Intrinsic Value (Author)</p></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\"><strong>Closing Comments</strong></h2> <p class=\"paywall-full-content invisible\">I believe the company is a strong buy and if it drops further in the short-run, it would be great to average down, as I believe the company is going to survive these short-term obstacles and will successfully diversify its business that will be less reliant on AAPL and hopefully China. The China part will be much harder to achieve, however, it will be just as hard for China to be self-reliant and both parties will need each other for the foreseeable future.</p> <p class=\"paywall-full-content invisible\">I'm confident that the company will get past the short-term negative noise and will reward the patient shareholders many years from now. I am curious to see where the company is going to be in 3-5 years from now, but I have a good feeling it will not be at such lows as we are seeing right now, which is close to its 52-week low once again.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Once the negativity leaves the semiconductor industry sometime in '24, I would expect many similar companies to start appreciating as demand for new products resumes.</p>", "twitContent": "$QCOM - Qualcomm Inc.: Long-Term Situation Is Intact, Reiterate Buy. https://seekingalpha.com/article/4636699-qualcomm-stock-long-term-situation-intact-reiterate-buy?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "106896", "type": "author"}}, "sentiments": {"data": [{"id": "487747", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "1168", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "677972", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4636699-qualcomm-stock-long-term-situation-intact-reiterate-buy", "canonical": "https://seekingalpha.com/article/4636699-qualcomm-stock-long-term-situation-intact-reiterate-buy", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/631095956/image_631095956.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "106896", "type": "author", "attributes": {"company": null, "slug": "gytis-zizys", "userId": 48589448, "tagId": 677972, "bio": "MSc in Finance. Long-term horizon investor mostly with 5-10 year horizon. I like to keep investing simple. I believe a portfolio should consist of a mix of growth, value, and dividend-paying stocks but usually end up looking for value more than anything. I also sell options from time to time.", "image": {"small": "https://static.seekingalpha.com/images/users_profile/048/589/448/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/048/589/448/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/048/589/448/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/048/589/448/extra_large_pic.png"}, "nick": "Gytis Zizys", "deactivated": null, "memberSince": 2017, "isRss": false, "contributorSince": 2023, "followersCount": 2859}, "relationships": {"user": {"data": {"id": "48589448", "type": "user"}}, "userBioTags": {"data": [{"id": "1010104", "type": "userBioTag"}, {"id": "1010105", "type": "userBioTag"}, {"id": "1010106", "type": "userBioTag"}, {"id": "1010107", "type": "userBioTag"}, {"id": "1010108", "type": "userBioTag"}, {"id": "1010109", "type": "userBioTag"}, {"id": "1010110", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/gytis-zizys", "profileUrl": "/author/gytis-zizys", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "1168", "type": "tag", "attributes": {"slug": "qcom", "name": "QCOM", "company": "QUALCOMM Incorporated", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "45", "type": "sector"}}}, "links": {"self": "/symbol/QCOM"}}, {"id": "677972", "type": "tag", "attributes": {"slug": "gytis-zizys", "name": "Gytis Zizys", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/gytis-zizys"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "487747", "type": "sentiment", "attributes": {"articleId": 4636699, "type": "very_bullish", "createdAt": "2023-09-22T04:25:50.000-04:00", "typeId": 0}, "relationships": {"article": {"data": {"id": "4636699", "type": "article"}}, "tag": {"data": {"id": "1168", "type": "tag"}}}}]}