{"data": {"id": "4645334", "type": "fullArticle", "attributes": {"publishOn": "2023-10-31T09:05:32-04:00", "isLockedPro": false, "commentCount": 19, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"daan-rijnberk": {"id": 644134, "slug": "daan-rijnberk", "kind": "common", "non_theme": true}, "aapl": {"id": 146, "slug": "aapl", "kind": "common", "non_theme": true}, "amd": {"id": 1016, "slug": "amd", "kind": "common", "non_theme": true}, "arm": {"id": 762329, "slug": "arm", "kind": "common", "non_theme": true}, "intc": {"id": 1017, "slug": "intc", "kind": "common", "non_theme": true}, "mbly": {"id": 644966, "slug": "mbly", "kind": "common", "non_theme": true}, "msft": {"id": 575, "slug": "msft", "kind": "common", "non_theme": true}, "nvda": {"id": 1150, "slug": "nvda", "kind": "common", "non_theme": true}, "on": {"id": 2046, "slug": "on", "kind": "common", "non_theme": true}, "txn": {"id": 1051, "slug": "txn", "kind": "common", "non_theme": true}, "qcom": {"id": 1168, "slug": "qcom", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "earnings": {"id": 10, "slug": "earnings", "kind": "breadcrumb", "path": "/earnings/earnings-analysis", "title": "Earnings Analysis", "sasource": "theme_breadcrumb"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "article-outreach": {"id": 615773, "slug": "article-outreach", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "information-technology": {"id": 45, "slug": "information-technology", "kind": "sector", "path": "/stock-ideas/technology", "title": "Tech ", "sasource": "theme_breadcrumb"}}, "title": "Qualcomm Q4 Earnings Preview: Headwinds, Risks, And New Products In Focus", "summary": ["Qualcomm Incorporated continues to face several headwinds, fueled mainly by a struggling economy and decreased consumer spending.", "I expect Qualcomm’s fiscal Q4 data expected on November 1st post-market to reflect better customer inventories and a slight improvement in orders and shipments due to new device releases and the upcoming holiday season.", "Recent developments in China make me somewhat weary of what to expect in 2024. Therefore, I am lowering my sales forecast for 2024 to limit downside risk.", "Qualcomm's venture into the PC processor market with the Snapdragon X Elite has potential, but it faces challenges in penetrating the market dominated by AMD and Intel.", "Despite short-term challenges, Qualcomm's healthy financials, including strong margins and ROE, and its ability to generate solid cash flows contribute to its excellent fundamental shape."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-10-31T09:11:22-04:00", "isModerated": false, "closestTradingDate": "2023-10-31", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 9, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-w750\" alt=\"Qualcomm headquarters sign in San Diego, California, USA.\" data-id=\"1445251323\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"></picture><figcaption><p class=\"item-credits\">JHVEPhoto</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Introduction</h2> <p>I maintain my buy rating on <strong>Qualcomm Incorporated</strong> (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/QCOM\" title=\"QUALCOMM Incorporated\">QCOM</a></span>) and update my revenue and EPS estimates following the announcement of the Snapdragon X Elite, the re-emergence of Huawei, and recent smartphone shipments data ahead of the fiscal Q4<span class=\"paywall-full-content invisible\"> results.</span></p> <p class=\"paywall-full-content invisible\">Qualcomm is set to <a href=\"https://seekingalpha.com/symbol/QCOM/earnings\">release Q4 earnings</a> later this week post-market on November 1st. After QCOM reported an accelerating revenue decline over the last 12 months, investors will be hoping to see a bottom reflected in the numbers and will look for positive commentary from management and improved visibility. However, this might be too much to wish for.</p> <p class=\"paywall-full-content invisible\">Qualcomm is facing several headwinds, fueled mainly by a struggling economy and decreased consumer spending, subjects I have discussed many times over the last few months. This has resulted in sales growth decelerating from double-digit growth in 2022 to double-digit declines so far in 2023. This significant top-line slowdown has also resulted in margins falling rapidly, with the net income margin dropping from above 30% last year to just above 25% in the most recent quarter.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/10/30/55767760-16986970663003478_origin.png\" rel=\"lightbox\" data-width=\"754\" data-height=\"454\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/10/30/55767760-16986970663003478.png\" alt=\"Qualcomm YoY growth graph\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">By Author</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/10/30/55767760-16986970664948728_origin.png\" rel=\"lightbox\" data-width=\"750\" data-height=\"452\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/10/30/55767760-16986970664948728.png\" alt=\"Qualcomm R&amp;D and margins graph\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">By Author</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">As a result, shares are flat YTD and down 18% since it released its <a href=\"https://seekingalpha.com/news/3995747-qualcomm-non-gaap-eps-of-1_87-beats-0_06-revenue-of-8_44b-misses-70m\">fiscal Q3 earnings</a>. Even a new licensing deal with Apple and a lot of investor enthusiasm for AI developments couldn't offset the negative sentiment around Qualcomm shares, resulting in the shares being down 7% since I last covered these about two months ago. Nevertheless, <a href=\"https://seekingalpha.com/article/4635321-qualcomm-recent-developments-strengthen-the-bull-case\">I remained bullish</a> on the company's long-term opportunities and current valuation:</p> <blockquote class=\"paywall-full-content invisible\"> <p> </p> <p>Qualcomm fundamentally remains in excellent shape despite significant near-term headwinds. The company has faced challenges in its latest quarterly results, experiencing a massive deceleration in growth due to the economic downturn and declining personal electronics sales. However, Qualcomm's strong market position and technological leadership across its leading segments make it a primary beneficiary in the growing smartphone market, IoT chip market, and advanced automotive semiconductors market.</p> <p>The smartphone industry remains an essential revenue source for Qualcomm, and its 30% market share positions it well to capitalize on the predicted 7.3% CAGR through 2029. Additionally, the company's leading position in IoT chips, with a 38% market share, and automotive semiconductors, with an 80% market share in the automotive connectivity market, bodes well for future growth as these markets continue to expand.</p> <p>Despite short-term challenges, Qualcomm's healthy financials, including strong margins and ROE, and its ability to generate solid cash flows contribute to its excellent fundamental shape. The company's balance sheet allows for returning cash to shareholders through dividends and share repurchases.</p> </blockquote> <p class=\"paywall-full-content invisible\">On that bullish note, let's look at what to expect from QCOM's Q4 earnings report, forward guidance, and some of the latest developments.</p> <h2 class=\"paywall-full-content invisible\">Qualcomm's venture into the PC processor market is a highly interesting one with a lot of potential</h2> <p class=\"paywall-full-content invisible\">Before we get into the Q4 and FY24 expectations and forecasts, I first want to highlight some of the most recent developments, most notably the release of its highly anticipated Snapdragon X Elite and new Snapdragon smartphone chipset.</p> <p class=\"paywall-full-content invisible\">Qualcomm has been heavily criticized over recent years regarding its revenue diversification and dependence on a very mature, volatile, and slow-growing smartphone market, and rightfully so.</p> <p class=\"paywall-full-content invisible\">For many years, Qualcomm has lacked the growth of the overall semiconductor industry and peers and has seen its dependence on its largest customer - Apple (<a href=\"https://seekingalpha.com/symbol/AAPL\" title=\"Apple Inc.\">AAPL</a>) - increase meaningfully. While innovation has never been a problem for the company, with it leading the way in 5G connectivity technology and smartphone semiconductors, it does not seem to get investors excited enough, resulting in it historically trading at a discounted multiple.</p> <p class=\"paywall-full-content invisible\">Over recent years, however, the company has been working on diversifying its revenue stream with ventures into the Internet of Things (\"IoT\") and Automotive space, and these new segments have been showing impressive growth in recent years.</p> <p class=\"paywall-full-content invisible\">The latest attempt to increase investor enthusiasm toward the company and to diversify its revenue stream is the company's focus on AI technologies and its <a href=\"https://seekingalpha.com/news/4023378-qualcomms-new-chips-aimed-at-ai-demand\">venture into the Windows PC market</a>, where it hopes to compete with Intel (<a href=\"https://seekingalpha.com/symbol/INTC\" title=\"Intel Corporation\">INTC</a>) and Advanced Micro Devices, Inc. (<a href=\"https://seekingalpha.com/symbol/AMD\" title=\"Advanced Micro Devices, Inc.\">AMD</a>) through its recently released Snapdragon X Elite, which features the Qualcomm Oryon CPU based on Nuvia and ARM Holdings plc (<a href=\"https://seekingalpha.com/symbol/ARM\" title=\"Arm Holdings plc\">ARM</a>) technology and built on a Taiwan Semiconductor (<a href=\"https://seekingalpha.com/symbol/TSM\" title=\"Taiwan Semiconductor Manufacturing Company Limited\">TSM</a>) 4 nm node.</p> <h3 class=\"paywall-full-content invisible\">The Snapdragon X Elite's performance potential is staggering</h3> <p class=\"paywall-full-content invisible\">The Snapdragon X Elite impressed the audience during the release presentation as the performance statistics are incredible. Starting by comparing it to the primary competition, the X Elite has up to twice the performance vs. a 12-core x86 CPU at the same power consumption level and offers up to 66% better power efficiency. The Snapdragon X Elite should even be able to beat the Speed of Apple's M2 Max chip in single-threaded performance and should match it in peak performance while using 30% less power.</p> <p class=\"paywall-full-content invisible\">Simply put, based on the statistics provided by Qualcomm, it blows away the competition both in power efficiency and performance. Just how fast the new CPU setup is, is nicely <a href=\"https://www.fastcompany.com/90970077/qualcomms-snapdragon-x-elite-chip-is-a-big-bet-on-the-pcs-future\" rel=\"noopener\">highlighted by CEO Amon</a>:</p> <blockquote class=\"paywall-full-content invisible\"><p>It's the fastest CPU for a laptop, period. Period! It's faster than anything Apple, anything AMD, anything Intel. But it's also delivering performance that is faster than the fastest desktop gaming PC from AMD. It's at the same level as some of the fastest CPUs you can buy from Intel for a gaming rig, one that is liquid-cooled. And we're doing all of that in a laptop, in a battery-powered device.</p></blockquote> <p class=\"paywall-full-content invisible\">The chip also carries a new version of Qualcomm's Adreno GPU technology, which should be up to 2x faster compared to similar offerings from Intel and AMD. In addition, it also carries a very impressive NPU, which has up to 4x the raw performance of any competitor, making it perfectly suited for AI functionalities.</p> <h3 class=\"paywall-full-content invisible\">Qualcomm sets itself apart by introducing new AI functionalities to PCs</h3> <p class=\"paywall-full-content invisible\">And this is where the Snapdragon X Elite really shines. The chip primarily pronounces Qualcomm's abilities in AI as the most well-suited CPU for AI on PC.</p> <p class=\"paywall-full-content invisible\">Qualcomm has in the last year already stated its intentions to deliver the functionality to run model-powered LLMs (Large Language Models) locally on smartphones, but has now also brought this functionality to PCs. The Snapdragon X Elite can run models like Meta Platforms' (<a href=\"https://seekingalpha.com/symbol/META\" title=\"Meta Platforms, Inc.\">META</a>) Llama2 with up to 13 billion parameters all on-device, reducing the need to access cloud computing resources, bringing with it several advantages.</p> <p class=\"paywall-full-content invisible\">It's important that Qualcomm's AI capabilities aren't understated. Qualcomm is often overlooked when it comes to AI, which is clearly highlighted by the fact that it has seen little benefit from the AI boom, which has driven the share prices of Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>), Microsoft (<a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a>), and Broadcom (<a href=\"https://seekingalpha.com/symbol/AVGO\" title=\"Broadcom Inc.\">AVGO</a>) to new highs this year, while Qualcomm's share price is flat YTD.</p> <p class=\"paywall-full-content invisible\">However, Qualcomm is the first to release technology that supports LLM models of 10 billion parameters on phones and 13 billion parameters on PCs. Not only does this make these technologies much more available, but it also lowers the running costs and increases privacy and security.</p> <h3 class=\"paywall-full-content invisible\">The growing share of ARM technology PC CPUs is promising, but Qualcomm faces challenges</h3> <p class=\"paywall-full-content invisible\">Recent reports indicate that Nvidia and AMD are also potentially working on CPU designs using ARM technology. This does not come as a surprise as Apple has shown, through its M-chips based on ARM technology, that this technology carries the potential for higher-performance CPUs compared to traditional X86 processors, which are historically presumed to be superior.</p> <p class=\"paywall-full-content invisible\">According to <a href=\"https://seekingalpha.com/news/4023463-arm-tsm-nvidia-among-the-possible-winners-in-new-chip-development\">Truist analysts led by William Stein</a>, the current total addressable market, or TAM, for ARM processors designed for PCs is sitting around $30 billion but has the potential to grow meaningfully over the next couple of years as more ARM-based designs are expected to be released. <a href=\"https://www.counterpointresearch.com/zh-hans/insights/arm-based-pcs-to-nearly-double-market-share-by-2027/\" rel=\"nofollow\">Counterpoint Research analysts</a> believe ARM processors should be able to double their share of the total PC processor market to 27% by 2027, increasing the 2027 TAM to <a href=\"https://www.mordorintelligence.com/industry-reports/processor-market/market-size#:~:text=Processor%20Market%20Analysis,needed%20to%20run%20the%20computer.\" rel=\"noopener\">$38 billion</a>.</p> <p class=\"paywall-full-content invisible\">This creates a very interesting market for Qualcomm to penetrate and benefit from. If the Snapdragon X Elite is indeed as impressive as it claims, Qualcomm could easily take a significant market share in the ARM PC processor market, making this a multi-billion-dollar product. Even if it can take just a 20% market share (considering Apple is the only current competitor in ARM-based PC technology, this is not that far-fetched), this could result in $7.6 billion in PC revenue by 2027, adding close to 17% in incremental sales to my FY26 sales estimate, highlighting the potential Qualcomm has here.</p> <p class=\"paywall-full-content invisible\">Yet, I will state again that this will depend on the real-world performance of this chipset. And not just that alone, but also Qualcomm's ability to mitigate software compatibility risks. The way to success here for Qualcomm is not as straightforward as it might seem.</p> <p class=\"paywall-full-content invisible\">The Windows PC market has for years been built around X86 processors from AMD and Intel, and while Microsoft has publicly stated its interest in ARM-based processors in combination with its Windows software, it will still be hard for Qualcomm to penetrate this market, even if its processor is as strong as it claims.</p> <p class=\"paywall-full-content invisible\">It would require significant adjustments on the part of everyone from PC makers to Microsoft to app developers. This will be the largest challenge for Qualcomm going forward. Luckily, Microsoft is already working to ensure that all of its key offerings run natively with the Snapdragon X Elite, mitigating at least one risk.</p> <p class=\"paywall-full-content invisible\">Furthermore, nine PC manufacturers listed themselves as \"partners\" of Qualcomm, with three of them committing to releasing multiple generations of devices powered by Qualcomm's CPU. These include Microsoft and its Surface PC, Lenovo, and HP. The first PCs using the Qualcomm CPU will become available by mid-2024.</p> <p class=\"paywall-full-content invisible\">Meanwhile, Qualcomm also released its latest smartphone chip with the Snapdragon 8 Gen 3, which will bring LLMs to smartphones, solidifying its market share in this industry through innovation.</p> <h2 class=\"paywall-full-content invisible\">Underlying industry data improves but headwinds remain</h2> <p class=\"paywall-full-content invisible\">The biggest question today is what we can expect from Qualcomm's Q3 results, set to be released in a couple of days. Cutting right to the chase, I believe investors should not get their hopes up with global smartphone shipments still down YoY, the IoT market seemingly remaining weak, and automotive losing some of its strength potentially. However, there is also room for positivity.</p> <p class=\"paywall-full-content invisible\">As with previous quarters, the most important indicators of Qualcomm's performance are quarterly smartphone shipments and new device releases as the handset segment continues to account for over 60% of Qualcomm's quarterly revenue, and these aren't (yet) looking overly strong, though a bottom might be in.</p> <h3 class=\"paywall-full-content invisible\">A bottom in the smartphone industry seems to be in</h3> <p class=\"paywall-full-content invisible\">Global smartphone shipments in <a href=\"https://canalys.com/newsroom/global-smartphone-market-q3-2023\" rel=\"nofollow\">Q3 were down 1% YoY</a>, indicating a slowdown in the decline and a significant double-digit jump in shipments sequentially, with primary Qualcomm customers Samsung and Apple still leading the global market, holding a market share of 37%.</p> <p class=\"paywall-full-content invisible\">We will most likely see smartphone shipment number growth turn positive again in Q4 of this year, indicating better times ahead for Qualcomm and a bottom being in. With this outlook finally improving, I expect Qualcomm's fiscal Q4 data to reflect better customer inventories and a slight improvement in orders and shipments due to new device releases and the upcoming holiday season. I also expect management to highlight better visibility.</p> <p class=\"paywall-full-content invisible\">However, the Chinese smartphone market remained weak in Q3, noting a second consecutive <a href=\"https://www.canalys.com/newsroom/china-smartphone-market-Q3-2023\" rel=\"noopener\">decline of 5%</a> in terms of shipments. With China being one of the largest smartphone markets globally and Qualcomm holding a <a href=\"https://www.gizchina.com/2022/05/21/top-5-soc-brands-for-chinese-smartphones-in-q1-qualcomm-is-not-first/\" rel=\"nofollow\">market share of around 35%</a> in this market, this is a crucial indicator for Qualcomm's Q3 results and not a positive one.</p> <p class=\"paywall-full-content invisible\">Crucially, Qualcomm derives around 64% of its revenue from Chinese sales, making it extremely sensitive to any developments in the country or export restrictions. Luckily, recent new Chinese semiconductor restrictions aimed at limiting China's AI capabilities seem to be primarily aimed at <a href=\"https://seekingalpha.com/news/4021196-nvidia-pares-losses-new-china-export-rules\">Nvidia's China-specific GPUs</a> and should not impact Qualcomm for now. Of course, the risk remains.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/10/30/55767760-1698697066417128_origin.png\" rel=\"lightbox\" data-width=\"1408\" data-height=\"890\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/10/30/55767760-1698697066417128.png\" alt=\"Afbeelding met tekst, schermopname, software, nummer Automatisch gegenereerde beschrijving\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Qualcomm revenue by region (Statista)</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">While Chinese smartphone shipment data was far from positive for Qualcomm, there is also room for some positivity here as, sequentially, there was a slight increase, and <a href=\"https://www.mobileworldlive.com/devices/canalys-confident-of-china-smartphone-comeback/\" rel=\"noopener\">Canalys analysts</a> are confident that the market has bottomed.</p> <p class=\"paywall-full-content invisible\">Smartphone vendors are releasing new models to stimulate consumer upgrades and brand switches, and while this has not materialized in higher volumes in Q3, a gradual recovery of the industry is expected, supporting my earlier communicated expectation for fiscal Q4 data to reflect improved customer demand.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/10/30/55767760-16986970665290308_origin.png\" rel=\"lightbox\" data-width=\"900\" data-height=\"506\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/10/30/55767760-16986970665290308.png\" alt=\"China-smartphone-market-Q3-2023\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Canalys</p></figcaption></figure></p> <h3 class=\"paywall-full-content invisible\">The new Huawei Kirin chipset is a serious threat to Qualcomm and could cost the company billions in sales</h3> <p class=\"paywall-full-content invisible\">And yet (yes, another negative), while the outlook for Qualcomm's fiscal Q4 and Q1 could see some upside due to improved demand, the fact that Huawei is reemerging as a strong player in the Chinese smartphone industry could be a drag on Qualcomm's financial performance. During Q3, Huawei was the strongest growing brand in China, <a href=\"https://www.reuters.com/markets/asia/china-smartphone-shipments-fall-5-yy-q3-667-mln-handsets-canalys-2023-10-26/\" rel=\"noopener\">noting a 37% increase</a> in shipments and taking close to 400 basis points of market share to 12.9%, closing the gap to its leading competitors.</p> <p class=\"paywall-full-content invisible\">Huawei was forced to use Qualcomm's 4G Snapdragon processors for many years after being hit by US sanctions but has now finally found an in-house way around it with its Kirin chipset, which has drawn enthusiastic consumer response in Mainland China. Huawei uses an advanced <a href=\"https://finance.yahoo.com/news/qualcomm-tumbles-china-turmoil-hits-151954545.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAJ1RD4NV6LIULI4ZzU5LsVCgZDiUj5i-9lgE_9gFj-QogDTGK6ZBg-nTeIY3zf2pm57wF4ZdrOu6jmZu5ESAYopPs3fGiZdwq1EP_dCvi9nD9RaEGvB89XdI2nQJWSEmXX3-ffAM9O41JKYlOpi-PgQWI-ngN753yysghQSWs9on#:~:text=San%20Diego%2Dbased%20Qualcomm%20provides,watching%20developments%20in%20that%20market.\" rel=\"nofollow\">7nm node built by SMIC</a> to power its latest smartphone, allowing Huawei to shift to 5G, meaning Qualcomm will lose a significant portion of its Chinese sales after already facing tough competition from MediaTek. Huawei's Kirin processor is impressive and a <a href=\"https://www.androidauthority.com/kirin-980-vs-snapdragon-845-900722/\" rel=\"nofollow\">strong competitor</a> to Qualcomm's Snapdragon chipset.</p> <p class=\"paywall-full-content invisible\">Analysts estimate that Qualcomm's shipments to Chinese smartphone brands in 2024 will decrease by at least <a href=\"https://www.globaltimes.cn/page/202309/1297763.shtml\" rel=\"noopener\">50-60 million units</a> compared with 2023 as a result of the Kirin release. The problem for Qualcomm could get even worse as Huawei might start shipping its Kirin processors to other Chinese brands as well. Furthermore, Samsung is <a href=\"https://www.gizchina.com/2023/09/07/huawei-kirin-9000s-chips-qualcomm/\" rel=\"nofollow\">rumored to use its in-house Exynos chips</a> again for the S24 series smartphones, limiting the number of snapdragon processors used.</p> <p class=\"paywall-full-content invisible\">So, while I can see underlying industry data improving, supporting a gradual recovery in Qualcomm's handset segment in its fiscal Q4 and going into Q1, these latest developments in China make me somewhat weary of what to expect in 2024. Therefore, I am lowering my sales forecast for 2024 to limit downside risk and take a more conservative stance.</p> <h3 class=\"paywall-full-content invisible\">The IoT market remains weak, and automotive could lose some strength</h3> <p class=\"paywall-full-content invisible\">The <a href=\"https://seekingalpha.com/article/4643099-texas-instruments-incorporated-txn-q3-2023-earnings-call-transcript\">recent results</a> released by Texas Instruments (<a href=\"https://seekingalpha.com/symbol/TXN\" title=\"Texas Instruments Incorporated\">TXN</a>) last week already highlighted a slight weakening of the automotive chip industry forecasted for Q4, and the <a href=\"https://seekingalpha.com/article/4645060-on-semiconductor-corporation-on-q3-2023-earnings-call-transcript\">results released by</a> ON Semiconductor (<a href=\"https://seekingalpha.com/symbol/ON\" title=\"ON Semiconductor Corporation\">ON</a>) yesterday paint a similar picture of the automotive industry losing some of its strength. I am, therefore expecting Qualcomm to see growth in Automotive slow heading into its fiscal FY24.</p> <p class=\"paywall-full-content invisible\">Nevertheless, in the long term, I am very bullish on this segment. In the automotive sector, Qualcomm stands out with an edge over competitors like Nvidia and Mobileye (<a href=\"https://seekingalpha.com/symbol/MBLY\" title=\"Mobileye Global Inc.\">MBLY</a>). Its automotive offerings cover infotainment, connectivity, and advanced driver assistance systems through the Snapdragon digital chassis platform, simplifying OEM choices. As a result, with new Snapdragon Cockpit and Connectivity 5G Platform deals, Qualcomm's backlog now likely surpasses $35-40 billion, making it the largest among its peers.</p> <p class=\"paywall-full-content invisible\">As Qualcomm secures more automotive design wins, it is poised for impressive revenue growth. Therefore, the estimated $9 billion in automotive revenue by 2030 seems highly likely, underscored by its consistent success in signing deals with major OEMs.</p> <p class=\"paywall-full-content invisible\">Moving to IoT, I do not expect a very positive Q3 for this segment either. The IoT market will likely remain weak in Q3, showing little improvement from Q2. <a href=\"https://www.idc.com/getdoc.jsp?containerId=prUS50994923\" rel=\"nofollow\">IDC</a> earlier this year stated that it expects the smart home device market to remain weak throughout 2023 and into 2024.</p> <p class=\"paywall-full-content invisible\">Of course, in the long term, the market remains very promising and a large opportunity for Qualcomm as the leader in high-end connectivity. According to Mordor Intelligence, the IoT market is expected to grow at a <a href=\"https://www.mordorintelligence.com/industry-reports/iot-chip-market#:~:text=The%20Internet%20of%20Things%20%28IoT,period%20%282023%2D2028%29.\" rel=\"noopener\">16% CAGR through 2028</a>, which should drive solid growth for Qualcomm.</p> <h2 class=\"paywall-full-content invisible\">Outlook &amp; QCOM stock valuation</h2> <p class=\"paywall-full-content invisible\">Management has guided revenue in the range of $8.1 billion to $8.9 billion, which is a very wide range reflecting management's low visibility. This reflects an expectation for handset revenues to be flat sequentially or down around 19% YoY, assuming this comes in at around $5.3 billion. For the IoT segment, management expects to report a mid-single-digit sequential decline, while automotive is expected to show another quarter of resilience with revenues expected to be up by low-double digits. This should lead to EPS in the range of $1.80 to $2, down 39% at the midpoint.</p> <p class=\"paywall-full-content invisible\">Looking at the latest developments, I believe handset revenue will most likely remain flat sequentially, roughly in line with management's guidance, at $5.35 billion, indicating a bottom in the industry. Meanwhile, IoT revenues will remain under pressure, and I expect Qualcomm to report revenue of around $1.4 billion. Finally, automotive will most likely remain resilient this quarter, coming in at around $475 million.</p> <p class=\"paywall-full-content invisible\">Overall, I expect Qualcomm to report fiscal Q4 revenue of $8.46 billion and EPS of $1.88 based on a net income margin of 24.8%, down another 60 basis points sequentially. This results in the following financial projections through FY26.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/10/30/55767760-16986970664731784_origin.png\" rel=\"lightbox\" data-width=\"1078\" data-height=\"252\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/10/30/55767760-16986970664731784.png\" alt=\"Afbeelding met tekst, schermopname, Lettertype, nummer Automatisch gegenereerde beschrijving\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Financial projections (By Author)</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Based on these expectations, shares are now valued at a forward P/E of 13x, which sits roughly 25% below its 5-year average earnings multiple. Therefore, shares look rather attractive when considering the EPS forecast shown above and the dividend yield currently standing at over 3%.</p> <p class=\"paywall-full-content invisible\">However, uncertainties remain for Qualcomm as it relies heavily on the handset segment, has significant exposure to the Chinese market (opening it up to the increasing competition coming from Huawei and export restrictions), and any success in the PC processor space remains uncertain.</p> <p class=\"paywall-full-content invisible\">However, at the same time, I believe the current valuation does not correctly price in the company's exposure to and strength in AI and any potential in the PC processor market. Therefore, despite the significant risk and many question marks, I believe shares offer considerable potential. Qualcomm remains an exciting investment option, albeit at a higher-than-average risk profile.</p> <p class=\"paywall-full-content invisible\">Based on a conservative 15x earnings multiple and my FY24 EPS projection, I calculate a 12-month price target of $138. Going with an annual return of 11%, I believe shares would be fairly valued today at a share price of $121, leaving at least 12% upside to fair value based on very conservative estimates and multiples.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Therefore, I maintain my buy rating of Qualcomm shares.</p>", "twitContent": "$QCOM - Qualcomm Q4 Earnings Preview: Headwinds, Risks, And New Products In Focus. https://seekingalpha.com/article/4645334-qualcomm-q4-earnings-preview-headwinds-risks-new-products-focus?source=tweet ", "innerMarketing": "", "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "106771", "type": "author"}}, "sentiments": {"data": [{"id": "497960", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "1168", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "146", "type": "tag"}, {"id": "1016", "type": "tag"}, {"id": "762329", "type": "tag"}, {"id": "1017", "type": "tag"}, {"id": "644966", "type": "tag"}, {"id": "575", "type": "tag"}, {"id": "1150", "type": "tag"}, {"id": "2046", "type": "tag"}, {"id": "1051", "type": "tag"}]}, "otherTags": {"data": [{"id": "644134", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "10", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "615773", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4645334-qualcomm-q4-earnings-preview-headwinds-risks-new-products-focus", "canonical": "https://seekingalpha.com/article/4645334-qualcomm-q4-earnings-preview-headwinds-risks-new-products-focus", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1445251323/image_1445251323.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "106771", "type": "author", "attributes": {"company": null, "slug": "daan-rijnberk", "userId": 55767760, "tagId": 644134, "bio": "<p>Daan Rijnberk is an independent investor and author who focuses on finding businesses with a strong moat, healthy financials, and a promising growth outlook to deliver investors stable and above-average long-term profits. This includes a combination of both value and growth opportunities across industries to help readers build well-diversified portfolios. </p><p>The articles aim not to make quick gains but to achieve long-term sustainable growth by identifying the most promising opportunities in the markets at a fair price. The leading strategy is to buy and hold for as long as the investment thesis is intact. Therefore, an update on most of the covered equities will be provided<span> every 3-6 (In some cases 12) months to keep the rating and thesis up-to-date. </span></p><p>Built upon professional experience and personal interests, Daan has specific expertise in semiconductors and fintech. <br></p><p>Articles and analyses are published exclusively on Seeking Alpha. <br></p>", "image": {"small": "https://static.seekingalpha.com/images/users_profile/055/767/760/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/055/767/760/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/055/767/760/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/055/767/760/extra_large_pic.png"}, "nick": "Daan Rijnberk", "deactivated": null, "memberSince": 2022, "isRss": false, "contributorSince": 2022, "followersCount": 1707}, "relationships": {"user": {"data": {"id": "55767760", "type": "user"}}, "userBioTags": {"data": [{"id": "1005383", "type": "userBioTag"}, {"id": "1005384", "type": "userBioTag"}, {"id": "1005385", "type": "userBioTag"}, {"id": "1005386", "type": "userBioTag"}, {"id": "1005387", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/daan-rijnberk", "profileUrl": "/author/daan-rijnberk", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "1168", "type": "tag", "attributes": {"slug": "qcom", "name": "QCOM", "company": "QUALCOMM Incorporated", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "45", "type": "sector"}}}, "links": {"self": "/symbol/QCOM"}}, {"id": "146", "type": "tag", "attributes": {"slug": "aapl", "name": "AAPL", "company": "Apple Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/AAPL"}}, {"id": "1016", "type": "tag", "attributes": {"slug": "amd", "name": "AMD", "company": "Advanced Micro Devices, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/AMD"}}, {"id": "762329", "type": "tag", "attributes": {"slug": "arm", "name": "ARM", "company": "Arm Holdings plc", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 8, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/ARM"}}, {"id": "1017", "type": "tag", "attributes": {"slug": "intc", "name": "INTC", "company": "Intel Corporation", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/INTC"}}, {"id": "644966", "type": "tag", "attributes": {"slug": "mbly", "name": "MBLY", "company": "Mobileye Global Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MBLY"}}, {"id": "575", "type": "tag", "attributes": {"slug": "msft", "name": "MSFT", "company": "Microsoft Corporation", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MSFT"}}, {"id": "1150", "type": "tag", "attributes": {"slug": "nvda", "name": "NVDA", "company": "NVIDIA Corporation", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/NVDA"}}, {"id": "2046", "type": "tag", "attributes": {"slug": "on", "name": "ON", "company": "ON Semiconductor Corporation", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/ON"}}, {"id": "1051", "type": "tag", "attributes": {"slug": "txn", "name": "TXN", "company": "Texas Instruments Incorporated", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/TXN"}}, {"id": "644134", "type": "tag", "attributes": {"slug": "daan-rijnberk", "name": "Daan Rijnberk", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/daan-rijnberk"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "10", "type": "tag", "attributes": {"slug": "earnings", "name": "Earnings", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/earnings"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "615773", "type": "tag", "attributes": {"slug": "article-outreach", "name": "Article outreach", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/article-outreach"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "497960", "type": "sentiment", "attributes": {"articleId": 4645334, "type": "bullish", "createdAt": "2023-10-31T09:05:32.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4645334", "type": "article"}}, "tag": {"data": {"id": "1168", "type": "tag"}}}}]}