{"data": {"id": "4652056", "type": "fullArticle", "attributes": {"publishOn": "2023-11-15T11:26:27-05:00", "isLockedPro": false, "commentCount": 15, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"simple-investing": {"id": 614223, "slug": "simple-investing", "kind": "common", "non_theme": true}, "aapl": {"id": 146, "slug": "aapl", "kind": "common", "non_theme": true}, "qcom": {"id": 1168, "slug": "qcom", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "earnings": {"id": 10, "slug": "earnings", "kind": "breadcrumb", "path": "/earnings/earnings-analysis", "title": "Earnings Analysis", "sasource": "theme_breadcrumb"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "tier-1": {"id": 603709, "slug": "tier-1", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "information-technology": {"id": 45, "slug": "information-technology", "kind": "sector", "path": "/stock-ideas/technology", "title": "Tech ", "sasource": "theme_breadcrumb"}}, "title": "Qualcomm: Handset Recovery Imminent", "summary": ["Qualcomm Incorporated's fiscal Q4 2023 results and guidance exceeded expectations as global handset demand showed signs of stabilization and Android demand showed early signs of recovery.", "With the latest Snapdragon 8 Gen 3 smartphone platform, the company is a leader on-device generative AI.", "Qualcomm expansion into PCs marks an exciting new era for the company as it looks to become a leader in the market.", "There were also multiple wins in the automotive segment, which is helping diversify Qualcomm's revenue source.", "Lastly, the launch of the Snapdragon 8 Gen 3 Apple's agreement to use the Snapdragon 5G Modem-RF systems for smartphone launches brings tailwinds for the handset business."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-11-15T11:26:27-05:00", "isModerated": false, "closestTradingDate": "2023-11-15", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 10, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of QCOM either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-w750\" alt=\"Happy man, social media phone and living room relax, typing smartphone and online communication, reading notification and web on sofa. Smile guy hands, mobile connection and home network technology\" data-id=\"1440149723\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Delmaine Donson</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>In this article, I will be reviewing the <a href=\"https://seekingalpha.com/news/4028326-qualcomm-non-gaap-eps-of-2_02-beats-0_11-revenue-of-8_67b-beats-150m\">fiscal Q4 2023</a> results of <strong>QUALCOMM Incorporated</strong> (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/QCOM\" title=\"QUALCOMM Incorporated\">QCOM</a></span>).</p> <p>From a high level, from an industry and company point of view, things are starting to look promising for Qualcomm as the global<span class=\"paywall-full-content invisible\"> handset demand is stabilizing and its focus on diversification of revenues is bearing fruit.</span></p> <h2 class=\"paywall-full-content invisible\">Fiscal Q4 2023</h2> <p class=\"paywall-full-content invisible\">Q4 2023 non-GAAP revenues for Qualcomm came in at <a href=\"https://d1io3yog0oux5.cloudfront.net/_d648ff949c836a580c8475ca7f15484d/qualcomm/db/773/7349/file/FY+2023+4th+Quarter+Earnings+Release.pdf\" rel=\"nofollow\">$8.7 billion</a>, 2% higher than the consensus expectations.</p> <p class=\"paywall-full-content invisible\">EPS came in at $2.02, 12% higher than consensus expectations and above the high end of its own guidance.</p> <p class=\"paywall-full-content invisible\">Revenue for the QTL segment, the licensing business, came in at $1.3 billion and EBT margins were 66%, both of which were in-line with guidance.</p> <p class=\"paywall-full-content invisible\">Revenues for the QCT segment came in at $7.4 billion and EBT margins were 26%, both of which were near the high end of its guidance due to strong handset and automotive revenues. Handset revenues within QCT segment grew 4% sequentially to $5.5 billion. The beat in handset revenues was due to what management described as the early stages of recovery in Android demand. Automotive revenues grew 23% sequentially to $535 million, and this is the 12th consecutive quarter of double digit percentage growth on a year-on-year basis. IoT revenues were weak as they were down 7% sequentially to $1.4 billion due to softness in industrial IoT demand.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/11/7/55407818-16993422006326933_origin.png\" rel=\"lightbox\" data-width=\"1210\" data-height=\"621\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/11/7/55407818-16993422006326933.png\" alt=\"FY4Q23\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">FY4Q23 <span>(Qualcomm)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">It is also worth noting that for the full 2023 fiscal year, Qualcomm managed to meet its target of reducing non-GAAP operating expenses by 7% and delivered on its promise to manage the cost structure to adjust it to the current operating environment. With that, in FY2023, Qualcomm achieved a record free cash flow of $9.8 billion and the company has more than $11 billion in cash and marketable securities on its balance sheet today.</p> <h2 class=\"paywall-full-content invisible\">Global handset cycle is stabilizing</h2> <p class=\"paywall-full-content invisible\">Encouragingly, Qualcomm is seeing early signs of stabilization in the global demand for handsets.</p> <p class=\"paywall-full-content invisible\">The company is now estimating that for 2023, handsets will be down just mid-to-high single-digit percentage relative to 2022.</p> <p class=\"paywall-full-content invisible\">The earlier expectation from just the prior quarter was at least a high single-digit percentage decline relative to 2022.</p> <p class=\"paywall-full-content invisible\">This is a perfect timing for Qualcomm as the company enters FY2024 given not only the early signs of stabilization of demand of handsets, but also continued strong competitive positioning across different segments.</p> <p class=\"paywall-full-content invisible\">In addition, growing and new industry trends like on-device generative AI and mobile computing is expected to drive content growth, units growth or both.</p> <h2 class=\"paywall-full-content invisible\">Guidance</h2> <p class=\"paywall-full-content invisible\">As a result of the improvement in the fundamentals of the handset industry, Qualcomm guided for FY1Q24 revenues to be in the range of <a href=\"https://d1io3yog0oux5.cloudfront.net/_d648ff949c836a580c8475ca7f15484d/qualcomm/db/773/7351/file/FY2023+4th+Quarter+Earnings+Presentation_11.1.23_Final.pdf\" rel=\"nofollow\">$9.1 billion to $9.9 billion</a> and non-GAAP EPS to be in the range of $2.25 to $2.45.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/11/7/55407818-16993434916395628_origin.png\" rel=\"lightbox\" data-width=\"1107\" data-height=\"493\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/11/7/55407818-16993434916395628.png\" alt=\"Guidance\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Guidance <span>(Qualcomm)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Qualcomm is guiding for revenues in the range of $1.3 billion to $1.5 billion and EBT margins of 70% to 74% for the QTL segment.</p> <p class=\"paywall-full-content invisible\">This sequential growth is contributed by an increase in global handset units for the holiday season.</p> <p class=\"paywall-full-content invisible\">For the QCT segment, Qualcomm is guiding for revenues in the range of $7.7 billion to $8.3 billion and EBT margins of 26% to 28%.</p> <p class=\"paywall-full-content invisible\">Within QCT, handset revenues are expected to grow by double-digits sequentially, while IoT and automotive are expected to decline sequentially, similar to what we saw in the prior year.</p> <p class=\"paywall-full-content invisible\">For QCT handset revenue, the strong sequential growth comes from the Android channel inventory normalizing and growing demand due to an acceleration in flagship launched as a result of Qualcomm's brand new Snapdragon 8 Gen 3 mobile platform.</p> <p class=\"paywall-full-content invisible\">I would note that Chinese OEMs QCT handset revenue forecast is expected to grow 35% sequentially, highlighting strong growth from Chinese OEMs and further diversification of revenues for Qualcomm.</p> <p class=\"paywall-full-content invisible\">On the other hand QCT IoT revenue weakness is mainly due to cyclical industry factors, like lower demand and elevated channel inventory.</p> <p class=\"paywall-full-content invisible\">For non-GAAP operating expenses, Qualcomm expects it to be flat relative to FY4Q23.</p> <h2 class=\"paywall-full-content invisible\">Strong technology roadmap and growth drivers</h2> <p class=\"paywall-full-content invisible\">I am highly impressed by Qualcomm's technology and product roadmaps and this further increases my confidence in the company.</p> <h3 class=\"paywall-full-content invisible\">Generative AI</h3> <p class=\"paywall-full-content invisible\">In particular, given we are in the generative AI wave, Qualcomm has been quick to embrace and innovate to become a leader in on-device generative AI for not just smartphones, but also laptops and more.</p> <p class=\"paywall-full-content invisible\">These new products and innovations also improve my conviction that Qualcomm will continue to be able to fuel its own growth and diversify its revenues further, which has been a key focus for the company.</p> <p class=\"paywall-full-content invisible\">Qualcomm expects on-device generative AI to become a requirement for its customers in the next few years, driving content growth, unit growth or both.</p> <p class=\"paywall-full-content invisible\">Qualcomm believes that running on-device generative AI will become prevalent as it brings about a significant change in user experience.</p> <p class=\"paywall-full-content invisible\">Qualcomm's Snapdragon platform is well positioned for this generative AI wave as it is highly differentiated from peers and I expect it to remain a leader for the foreseeable future with its level of innovation.</p> <p class=\"paywall-full-content invisible\">For the Snapdragon platform, the company has significantly improved the AI processing performance and power efficiency of its best-in-class NPU, CPU and GPU, it is working with multiple partners to grow its ecosystem to enable multiple consumer and productivity-based AI models to run natively on its Snapdragon platform. Lastly, Qualcomm is enabling multibillion parameter generative AI models to run continuously and concurrently for multiple use cases, including multimodal.</p> <p class=\"paywall-full-content invisible\">Qualcomm's latest Snapdragon 8 Gen 3 smartphone platform enables large language models like Llama to run at up to 20 tokens per second and large vision models like stable diffusion to generate images from text in less than one second with low power consumption.</p> <h3 class=\"paywall-full-content invisible\">Expansion into PCs</h3> <p class=\"paywall-full-content invisible\">Qualcomm launched the Snapdragon X Elite, which is a huge milestone for the company as it is now expanding into the PC market.</p> <p class=\"paywall-full-content invisible\">To put the Snapdragon X Elite's superior technology in context, it not only exceeds the multi-threaded CPU performance of any x86 or ARM competitor in its class, but it also matches the single-threaded CPU peak performance of the leading x86 CPU competitors at 70% less power.</p> <p class=\"paywall-full-content invisible\">In addition, the Snapdragon X Elite includes Qualcomm's first implementation of the custom Oryon CPU, which came about from its acquisition of <a href=\"https://www.theverge.com/2023/10/10/23911431/qualcomm-snapdragon-x-platform-oryon-cpu-windows-pc-apple-silicon\" rel=\"nofollow\">Nuvia</a>.</p> <p class=\"paywall-full-content invisible\">In addition, the Snapdragon X Elite also features its newest Hexagon NPU, which has a performance of 45 tops, and capable of running Gen AI models with over 13 billion parameters on-device.</p> <p class=\"paywall-full-content invisible\">The Snapdragon X Elite's total AI performance across CPU, GPU and NPU is 75 tops, which is the highest in the industry.</p> <p class=\"paywall-full-content invisible\">What does this mean for Qualcomm commercially?</p> <p class=\"paywall-full-content invisible\">With Microsoft working to improve the overall Windows experience with AI Copilot, this creates an excellent opportunity for Qualcomm's Snapdragon X Elite and the company expects to see PCs from leading OEMs powered by the Snapdragon X Elite starting from the middle of 2024.</p> <p class=\"paywall-full-content invisible\">With its entry into the PC market with the Snapdragon X Elite, Qualcomm has established itself as potential leader in the industry based on performance and power efficiency</p> <h2 class=\"paywall-full-content invisible\">Mixed reality</h2> <p class=\"paywall-full-content invisible\">Qualcomm is arguable the leader within the mixed reality space with the recently launched Snapdragon AR1 platform, on top of the earlier Snapdragon XR platform, both of which were designed for smart glasses.</p> <p class=\"paywall-full-content invisible\">Qualcomm is working closely with Meta to develop next generation technologies for augmented and mixed reality. The Snapdragon AR1 Gen1 is packed with next-generation technology and enabled on-device AI and rapid connectivity.</p> <p class=\"paywall-full-content invisible\">With Meta looking to be one of the biggest spenders on mixed reality, Qualcomm is the key beneficiary of the potential growth opportunity that comes from the space.</p> <h2 class=\"paywall-full-content invisible\">Automotive is winning</h2> <p class=\"paywall-full-content invisible\">Within automotive, we are seeing the Snapdragon Digital Chassis helping drive digital transformation of the automotive industry as it improves user experiences, and bring advancements to the safety and autonomy of the vehicle.</p> <p class=\"paywall-full-content invisible\">There were multiple forms of progress in the automotive business.</p> <p class=\"paywall-full-content invisible\">Qualcomm will be equipping the <a href=\"https://www.cadillac.com/upcoming-vehicles/escalade-iq\" rel=\"nofollow\">Cadillac ESCALADE IQ</a>, which will go into commercial production in 2024, with the Snapdragon Cockpit, Snapdragon Auto Connectivity and Snapdragon Ride platforms.</p> <p class=\"paywall-full-content invisible\">In addition, Qualcomm is <a href=\"https://www.qualcomm.com/news/releases/2023/09/bmw-group-and-qualcomm-demonstrate-continued-momentum-to-redefin\" rel=\"nofollow\">partnering</a> with BMW, bringing the Snapdragon Digital Chassis high-performance Snapdragon Automotive Cockpit, Auto Connectivity and Ride Platforms to all of BMW's vehicles.</p> <p class=\"paywall-full-content invisible\">Another win was the news that starting with the 2024 E-Class sedan, the Snapdragon Digital Cockpit and Connectivity solutions will now powered the new Mercedes Benz User Experience.</p> <p class=\"paywall-full-content invisible\">Also, Qualcomm recently expanded its Digital Chassis offering to two new platforms for two wheelers and other vehicle classes like motorcycles. There were new platform design wins and launches with<a href=\"https://www.gogoro.com/\" rel=\"nofollow\"> Gogoro</a>, Harley-Davidson (<a href=\"https://seekingalpha.com/symbol/HOG\" title=\"Harley-Davidson, Inc.\">HOG</a>) and more.</p> <p class=\"paywall-full-content invisible\">Last but not least, Qualcomm entered a new long-term relationship with Amazon Web Services. This will enable Qualcomm's automotive customers to integrate cloud technologies into their vehicle development lifecycle. This offering will combine AWS's breadth of services and capabilities with the Qualcomm Cloud AI 100 solution and its Snapdragon Ride platforms.</p> <p class=\"paywall-full-content invisible\">In my opinion, this relationship will enable further consolidation of automotive revenues with Qualcomm. The evidence of this is when AWS just announced that BMW selected AWS to power its next-generation of automated driving platform in its Q3 2023 results and in Qualcomm's results, we see a partnership between Qualcomm and BMW.</p> <h2 class=\"paywall-full-content invisible\">New products and continued traction in handsets</h2> <p class=\"paywall-full-content invisible\">As mentioned earlier, Qualcomm announced its newest premium mobile platform the Snapdragon 8 Gen 3.</p> <p class=\"paywall-full-content invisible\">It delivers industry leading performance and caters to the generative AI wave, including features like the best-in-class connectivity, intelligent capture with the world's smartest AI powered camera, the world's fastest on-device AI processing on a smartphone, and the world's first XSPAN technology, amongst others.</p> <p class=\"paywall-full-content invisible\">As a result of the launch of the Snapdragon 8 Gen 3 , I expect many smartphone OEMs to launch their flagship devices powered by it, including the likes of Xiaomi, OPPO, Honor, amongst others.</p> <p class=\"paywall-full-content invisible\">Within handsets, it is also worth noting that Apple (<a href=\"https://seekingalpha.com/symbol/AAPL\" title=\"Apple Inc.\">AAPL</a>) signed an agreement with Qualcomm for Snapdragon 5G Modem-RF systems for smartphone launches in 2024, 2025 and 2026. Clearly, this proves that Qualcomm's technology leadership remains ahead of Apple, and it seems to still be ahead of Apple by about three years in terms of the high-end and most advanced 5G technologies and products.</p> <h2 class=\"paywall-full-content invisible\">Valuation</h2> <p class=\"paywall-full-content invisible\">As a result of the improved market environment in the handset space, particularly in Android, improving fundamentals and continued innovation, I am revising my 1-year price target marginally upwards to $159.</p> <p class=\"paywall-full-content invisible\">This is based on a 15x 2024 P/E for Qualcomm, which is still rather conservative in my view given the strong technological and competitive leadership of the company.</p> <h2 class=\"paywall-full-content invisible\">Conclusion</h2> <p class=\"paywall-full-content invisible\">I think this set of results marks an important point for Qualcomm.</p> <p class=\"paywall-full-content invisible\">While negativism is embedded within the stock, we continue to see that despite Apple supposedly being a headwind in 2024 and beyond and that having been priced in, the company actually signed a new agreement for until 2026.</p> <p class=\"paywall-full-content invisible\">In addition, it looks like the global handset demand is stabilizing, particularly for the Android side of things, which should mark somewhat a bottoming in the current global handset market cycle.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Apart from cyclicality, Qualcomm has executed well on its cost reduction initiatives while also investing in innovation and research &amp; development. This is evident from its strong technology and product roadmap, including its expansion into the PC market, the latest Snapdragon 8 Gen 3 smartphone platform which enables on-device AI applications, amongst others.</p>", "twitContent": "$QCOM - Qualcomm: Handset Recovery Imminent. https://seekingalpha.com/article/4652056-qualcomm-handset-recovery-imminent?source=tweet ", "innerMarketing": "<h2>Outperforming the Market</h2><p><strong><a href=\"https://seekingalpha.com/checkout?service_id=mp_1422\">Outperforming the Market</a> </strong>is focused on helping you outperform the market while having downside protection during volatile markets by providing you with comprehensive deep dive analysis articles, as well as access to <strong>The Barbell Portfolio</strong>.</p><p>The Barbell Portfolio has outperformed the S&amp;P 500 by <strong>34%</strong> in the past year through owning high conviction growth, value and contrarian stocks.</p><p>Apart from focusing on bottom-up fundamental research, we also provide you with intrinsic value, 1-year and 3-year price targets in <strong>The Price Target report</strong>. </p><p>Join us for the <strong><a href=\"https://seekingalpha.com/checkout?service_id=mp_1422\">2-week free trial</a></strong> to get access to The Barbell Portfolio today! <br></p>", "marketingBullet": "This idea was discussed in more depth with members of my private investing community, Outperforming the Market. <a href='/checkout?service_id=mp_1422&source=mp_marketing_text_top' sasource='mp_marketing_text_top'>Learn More »</a>", "isReit": false, "videoData": null, "marketingBulletVariant": "I am Simple Investing, a former manager of a hedge fund with over $1B in AUM and a strong track record. I now run the investing group <a href=\"/checkout?service_id=mp_1422&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A55407818%7Csection_asset%3Aauthor_bullets%3A-outperforming-the-market\" data-test-id=\"author-custom-template-link\">Outperforming the Market</a>, where I share my Barbell Portfolio.", "marketingBio": "\"Simple Investing is a former hedge fund and long-only portfolio manager with a track record for outperformance. He managed more than $1 billion in AUM, and is a CFA charter holder who holds degrees in Finance and Accounting.\n\nHe runs the Investing Group <a href=\"\"/checkout?service_id=mp_1422&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A55407818%7Csection_asset%3Aauthor_root%3A-outperforming-the-market\"\" data-test-id=\"\"author-custom-template-link\"\">Outperforming the Market</a>. While having a pure growth or pure value portfolio may do well in certain markets, it leaves investors vulnerable to certain investment styles going out of favor. The objective of Outperforming the Market is to outperform the S&P 500 across market cycles. This is achieved through The Barbell Portfolio, which is comprised of high conviction growth and contrarian/value stocks. <a href=\"\"/checkout?service_id=mp_1422&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A55407818%7Csection_asset%3Aauthor_root%3A-outperforming-the-market\"\" data-test-id=\"\"author-custom-template-link\"\">Learn more.</a>\"", "audioDuration": null}, "relationships": {"author": {"data": {"id": "106427", "type": "author"}}, "sentiments": {"data": [{"id": "502137", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "1168", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "146", "type": "tag"}]}, "otherTags": {"data": [{"id": "614223", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "10", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "603709", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4652056-qualcomm-handset-recovery-imminent", "canonical": "https://seekingalpha.com/article/4652056-qualcomm-handset-recovery-imminent", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1440149723/image_1440149723.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "1422", "type": "authorResearch", "attributes": {"createdAt": "2022-11-01T11:50:22-04:00", "title": "Outperforming the Market", "rating": "5.0", "reviewCount": 33, "shortPitch": "High conviction growth and contrarian ideas for long-term outperformance", "categories": ["Growth", "GARP"], "serviceAssistantIds": [], "inAppPurchasesAllowedInIos": false, "inAppPurchasesAllowedInAndroid": false, "activeSubscriptionsCount": 98, "androidIapPlan": "sa_approved", "iosIapPlan": "sa_approved", "description": "Want to outperform the market while protecting the downside? The Barbell Portfolio can help you do so by identifying high conviction growth and contrarian stocks, trading at a discount to intrinsic value. You will also get The Price Target Report, stock ideas, earnings report analysis and weekly newsletters. This service is for long-term investors wanting to create a portfolio that outperforms.", "landingPageColor": null, "adUnits": ["direct_access", "trading_alert", "model_portfolio", "exclusive_idea", "weekly_news", "real_time"], "tempData": {}, "price": 45.99, "wildcardText": "", "slug": "outperforming-the-market", "annualPriceWithDiscount": 319.99, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": true}, "relationships": {"author": {"data": {"id": "106427", "type": "author"}}}}, {"id": "106427", "type": "author", "attributes": {"company": null, "slug": "simple-investing", "userId": 55407818, "tagId": 614223, "bio": "<p>Simple Investing is a former hedge fund and long-only portfolio manager with a track record for outperformance. He managed more than $1 billion in AUM, and is a CFA charter holder who holds degrees in Finance and Accounting. He runs the Investing Group <a href=\"/checkout?service_id=mp_1422&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A55407818%7Csection_asset%3Aauthor_root%3A-outperforming-the-market\">Outperforming the Market</a>. </p><p>While having a pure growth or pure value portfolio may do well in certain markets, it leaves investors vulnerable to certain investment styles going out of favor. The objective of Outperforming the Market is to outperform the S&P 500 across market cycles. This is achieved through The Barbell Portfolio, which is comprised of high conviction growth and contrarian stocks. </p><p><a href=\"/checkout?service_id=mp_1422&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A55407818%7Csection_asset%3Aauthor_root%3A-outperforming-the-market\">Learn more.</a></p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/055/407/818/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/055/407/818/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/055/407/818/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/055/407/818/extra_large_pic.png"}, "nick": "Simple Investing", "deactivated": null, "memberSince": 2021, "isRss": false, "contributorSince": 2021, "followersCount": 7534}, "relationships": {"user": {"data": {"id": "55407818", "type": "user"}}, "userBioTags": {"data": [{"id": "998527", "type": "userBioTag"}, {"id": "998528", "type": "userBioTag"}, {"id": "998529", "type": "userBioTag"}, {"id": "998530", "type": "userBioTag"}, {"id": "998531", "type": "userBioTag"}, {"id": "998532", "type": "userBioTag"}, {"id": "998533", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1422", "type": "authorResearch"}}}, "links": {"self": "/author/simple-investing", "profileUrl": "/author/simple-investing", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "1168", "type": "tag", "attributes": {"slug": "qcom", "name": "QCOM", "company": "QUALCOMM Incorporated", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "45", "type": "sector"}}}, "links": {"self": "/symbol/QCOM"}}, {"id": "146", "type": "tag", "attributes": {"slug": "aapl", "name": "AAPL", "company": "Apple Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/AAPL"}}, {"id": "614223", "type": "tag", "attributes": {"slug": "simple-investing", "name": "Simple Investing", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/simple-investing"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "10", "type": "tag", "attributes": {"slug": "earnings", "name": "Earnings", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/earnings"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "603709", "type": "tag", "attributes": {"slug": "tier-1", "name": "Tier 1", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/tier-1"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "502137", "type": "sentiment", "attributes": {"articleId": 4652056, "type": "bullish", "createdAt": "2023-11-15T11:26:27.000-05:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4652056", "type": "article"}}, "tag": {"data": {"id": "1168", "type": "tag"}}}}]}