{"data": {"id": "4657780", "type": "fullArticle", "attributes": {"publishOn": "2023-12-13T20:03:07-05:00", "isLockedPro": false, "commentCount": 2, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"alberto-abaterusso": {"id": 97181, "slug": "alberto-abaterusso", "kind": "common", "non_theme": true}, "ati": {"id": 2607, "slug": "ati", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "undercovered": {"id": 764066, "slug": "undercovered", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "materials": {"id": 15, "slug": "materials", "kind": "sector", "path": "/stock-ideas/basic-materials", "title": "Basic Materials", "sasource": "theme_breadcrumb"}}, "title": "ATI: Solid Foundation For Long-Term Growth, But With Short-Term Headwinds", "summary": ["ATI Inc. is assigned a Hold rating as it is well-positioned to benefit from the growth prospects of the aerospace and defense industry.", "The company's decision to expand its aerospace and defense activities is seen as positive and promising for shareholders.", "ATI's financial position is solid, supported by profitable operations, and signaled by participation in shareholder rewards programs. The latter could increase and lead to higher stock prices in the future."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-12-13T20:03:07-05:00", "isModerated": false, "closestTradingDate": "2023-12-14", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-w750\" alt=\"Military Jets in Flight\" data-id=\"498381212\" data-type=\"getty-image\" width=\"1536px\" height=\"1025px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">guvendemir/E+ via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2><strong>A “Hold” Recommendation Rating on ATI Inc.</strong></h2> <p>This analysis assigns a Hold rating to shares of ATI Inc. (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ATI\" title=\"ATI Inc.\">ATI</a></span>) - a Dallas, Texas-based manufacturer and seller of high-performance materials and components, as well as advanced alloys and<span class=\"paywall-full-content invisible\"> solutions for multiple industries worldwide.</span></p> <p class=\"paywall-full-content invisible\">This stock appears to be much better positioned than in the past to benefit from the robust growth prospects of the aerospace and defense industry. At 60%, the goal of generating the majority of customer revenue in the aerospace and defense industry is just a touch away from the 65% growth target. According to this analysis, ATI's decision to expand its aerospace and defense activities is considered very positive and highly promising from the perspective of shareholders' growth expectations.</p> <p class=\"paywall-full-content invisible\">It is amazing how much emphasis is placed on aerospace and defense these days and how countries take diametrically different diplomatic positions depending on which negotiating table they sit at. Geopolitical disputes, tensions, and existing conflicts between countries increase the world's perceived sense of insecurity, and in response, governments increase their spending on armaments and various bulwarks against external (including cybernetic) attacks. Instead, when it comes to specific projects, especially in the aerospace field, countries usually prefer to work together, and the pursuit of goals becomes a common interest.</p> <p class=\"paywall-full-content invisible\">ATI is better positioned to benefit from the growth driver of continued global arms proliferation happening globally. Since the United States is home to the world's largest manufacturers of aerospace technologies and weapons, the sharp increase in <a href=\"https://tradingeconomics.com/united-states/military-expenditure\" rel=\"nofollow\">US military budgets</a> in recent years and near-record <a href=\"https://tradingeconomics.com/united-states/weapons-sales\" rel=\"nofollow\">US arms sales</a> serve as a strong benchmark of the ongoing trend.</p> <p class=\"paywall-full-content invisible\">At the same time, ATI remains exposed to the long-term benefits of increasing globalization of markets, which undoubtedly facilitates collaboration between two or more countries when they want to work on scientific projects that require each other's resources.</p> <p class=\"paywall-full-content invisible\">With increasing reliance on the aerospace and defense sector's rosy growth prospects, ATI's balance sheet is on track for significant liquidity improvement. Liquidity is still too low relative to the increased debt, but the benefits the growth strategy brings in the future will outweigh the costs the balance sheet might be facing now.</p> <p class=\"paywall-full-content invisible\">However, ATI's financial position already appears to be solid, relying on the ability of its profitable operations to create value, which provides significant support to its share price. An indication of financial strength is the company's participation in open market share buyback programs. From today's perspective, it is unlikely that growth expectations will be disappointed by the facts. So, the company could combine the share repurchase programs with dividends in the future, which is another strong catalyst for higher share prices.</p> <p class=\"paywall-full-content invisible\">This analysis does not suggest a recommendation higher than Hold for now, as it assumes shares could offer more attractive entry points in 2024 when the economy is expected to be in recession.</p> <h2 class=\"paywall-full-content invisible\"><strong>The Prospects for the Near Future also Present ATI with Some Challenges</strong></h2> <p class=\"paywall-full-content invisible\">The long-term outlook for a position in the US-listed stock of ATI Inc. is very promising. In the short term, however, ATI stock could face headwinds if the economy slips into recession: Like many other industrial metal producers, ATI's profits could also come under some negative pressure as weaker demand and lower sales prices appear to be the trend in the US manufacturing sector at the moment. The latter two factors are due to elevated core inflation and tight credit conditions affecting consumption and business investment, two important pillars of US gross domestic product.</p> <p class=\"paywall-full-content invisible\">ATI Inc.'s revenues are also exposed to overseas markets as a global distributor of its specialty metal products and components.</p> <p class=\"paywall-full-content invisible\">Sales in overseas markets <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1018963/000162828023036343/ati-20230930.htm\" rel=\"nofollow\">totaled</a> $469 million, accounting for 46% of total sales in the third quarter of 2023. The contribution of international markets to ATI revenue increased 11.4% year-over-year. ATI's other foreign customers mostly come from the aerospace and defense industries, but also from other industries such as energy, electronics, automotive sectors, and even from medical technology sectors.</p> <p class=\"paywall-full-content invisible\">Additionally, international sales by segment:</p> <ul class=\"paywall-full-content invisible\"> <li> <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1018963/000162828023036343/ati-20230930.htm\" rel=\"nofollow\">international sales</a> accounted for 55% of the High-Performance Materials &amp; Components (HPMC) division's total sales in the third quarter of 2023, increasing 200 basis points year-over-year.</li> <li> <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1018963/000162828023036343/ati-20230930.htm\" rel=\"nofollow\">international sales</a> accounted for 57% of the High-Performance Materials &amp; Components (HPMC) division's total sales in the first 9 months of 2023, increasing by 300 basis points year-over-year as they were <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/0001018963/000162828022028121/ati-20220930.htm\" rel=\"nofollow\">54% of total segment</a> sales in the same period of 2022.</li> <li>international sales <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1018963/000162828023036343/ati-20230930.htm\" rel=\"nofollow\">accounted for 35%</a> of the Advanced Alloys &amp; Solutions (AA&amp;S) business division's total sales in the third quarter of 2023, increasing by 400 basis points year-over-year.</li> <li> <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1018963/000162828023036343/ati-20230930.htm\" rel=\"nofollow\">international sales</a> accounted for 33% of the Advanced Alloys &amp; Solutions (AA&amp;S) business division's total sales in the first 9 months of 2023, increasing by 100 basis points year-over-year as they were <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/0001018963/000162828022028121/ati-20220930.htm\" rel=\"nofollow\">32% of total segment</a> sales in the same period of 2022.</li> </ul> <p class=\"paywall-full-content invisible\">In its attempt to get back on track, the cycle will also face major resistance from the loss of luster in the European economy and the deflation that plagues the Chinese cycle. Europe and China are important trading partners of North American companies. In Europe, markets cannot hide their concerns about consumption and investment as the European Central Bank has pursued aggressive policies for more than a year to try to reduce core inflation to its 2% target. The same evil is currently affecting the US economy. Instead, the opposite phenomenon occurs in China: that is, the prices of goods and services do not rise but fall, which risks entering a vicious circle with a very negative impact on the economy. As consumers and businesses now anticipate the formation of even lower prices, they <a href=\"https://edition.cnn.com/2023/12/11/economy/china-cpi-deflation-worsens-intl-hnk/index.html\" rel=\"nofollow\">postpone</a> consumption and investment.</p> <p class=\"paywall-full-content invisible\">In addition, there is still the problem of the crisis in the real estate sector, a driving sector of the Chinese economy but also a mainstay for the sales of operators such as ATI with the large developers of the caliber of China Evergrande Group (EGRNQ) and Country Garden Holdings Company Limited (<a href=\"https://seekingalpha.com/symbol/CTRYF\" title=\"Country Garden Holdings Company Limited\">OTCPK:CTRYF</a>) (<a href=\"https://seekingalpha.com/symbol/CTRYY\" title=\"Country Garden Holdings Company Limited\">OTCPK:CTRYY</a>) who are at risk of default on their offshore debt.</p> <p class=\"paywall-full-content invisible\">The economic recession is signaled by the inverted yield curve of US government bonds (currently: 10-year yield of 4.189% versus 1-year yield of 5.135%), and predicted by these <a href=\"https://seekingalpha.com/article/4648436-gatos-silver-could-perform-strongly-if-silver-rallies\">economists</a>, including most recently Swiss bank giant UBS Group AG (<a href=\"https://seekingalpha.com/symbol/UBS\" title=\"UBS Group AG\">UBS</a>) analysts' <a href=\"https://finance.yahoo.com/news/the-pain-trade-for-stock-investors-isnt-over-yet-113055272.html?.tsrc=372\" rel=\"nofollow\">view</a>.</p> <h2 class=\"paywall-full-content invisible\"><strong>More About the Looming Recession</strong></h2> <p class=\"paywall-full-content invisible\">Duke professor and Canadian economist Campbell Harvey, <a href=\"https://finance.yahoo.com/news/professor-behind-recession-indicator-with-a-perfect-track-record-says-it-remains-way-too-early-to-call-off-a-us-economic-downturn-093049502.html?.tsrc=372\" rel=\"nofollow\">who</a> has also been predicting a recession in recent months, suggests using the difference between three-month Treasuries and the 10-year bond yield as a predictor. When the former exceeds the latter, the result is a perfect indicator, as it anticipated eight out of eight recessions since World War II. The 10-year 3-month Treasury yield spread <a href=\"https://ycharts.com/indicators/10_year_3_month_treasury_spread\" rel=\"nofollow\">was</a> negative -1.26% (below the long-term average of 1.15%) as of December 12, 2023, predicting a recession.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/12/13/5074741-17024761052573538_origin.png\" rel=\"lightbox\" data-width=\"1044\" data-height=\"432\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/12/13/5074741-17024761052573538.png\" alt=\"A graph with purple lines Description automatically generated\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Source: ycharts.com</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">The curve will lessen over time (i.e. the spread will shift its slope to negative relative to the x-axis), but that doesn't mean there won't be a recession anymore. The recession has already been signaled (because the Fed did it...), and based on history, it is likely to happen this time too. When the curve lessens, it means that bond investors prefer not to let their money stay in the hands of borrowers including public administrations for too long due to increased risk aversion. Because the longer the term, the higher the risk that the borrower will go bankrupt as the outlook is more uncertain and interest rates on federal funds are near or at their peak.</p> <p class=\"paywall-full-content invisible\">The mentioned group of economists believes that the Federal Reserve's most aggressively restrictive stance on interest rates since the 2007-2008 financial crisis, to combat the record inflation rate (the highest in more than forty years), will most certainly have negative consequences for the US economic cycle.</p> <p class=\"paywall-full-content invisible\">As in all areas, two main ideas emerge. Other economists believe that a soft landing is possible: i.e. a return of inflation to the target of 2% but despite restrictive credit conditions the cycle will fall into a serious slowdown.</p> <p class=\"paywall-full-content invisible\">However, some relevant economic trends seem to contradict the expectations of soft-landing economists/analysts, while being more consistent with the scenario of an economic recession.</p> <p class=\"paywall-full-content invisible\">In terms of consumption, with this component accounting for <a href=\"https://ycharts.com/indicators/personal_consumption_gdp\" rel=\"nofollow\">nearly 70%</a> of the growth potential of US gross domestic product (GDP), there appears to be a growing attitude among consumers to be much more conservative than in the past when shopping under pressure from student loan repayments, expensive credit card loans, high core inflation and <a href=\"https://www.conference-board.org/topics/consumer-confidence?fbclid=IwAR1-BpGv3LP6UD9xxLtnzdggJo3QwT_KEPCrk5qIAMfSHIcjBdJ8QXyVcGA\" rel=\"nofollow\">fear</a> of the consequences of the conflicts. Reflecting ongoing negative trends among consumers, analysts cut U.S. retailers' profits. Analysts sharply cut profits at these <a href=\"https://seekingalpha.com/article/4655559-seabridge-gold-relevant-upside-potential-as-gold-turns-bullish\">major US retailers</a> well ahead of the third-quarter 2023 earnings season – which has not performed well overall – in a clear sign of significantly weaker consumption. The more frugal attitude of consumers is also leading <a href=\"https://seekingalpha.com/article/4653991-osisko-development-upside-potential-intact-but-stocks-could-drop-rating-downgrade\">these major retailers</a> to lower their sales forecasts, which, among other things, did not develop well in the third quarter of 2023. On the business investment side, the situation is no better: murkier consumption prospects (i.e. demand for goods and services) coupled with expensive credit mean that companies have to reduce their investments, impacting the money supply and possibly cutting jobs.</p> <p class=\"paywall-full-content invisible\">Morgan Stanley (<a href=\"https://seekingalpha.com/symbol/MS\" title=\"Morgan Stanley\">MS</a>)'s third-quarter 2023 earnings report <a href=\"https://seekingalpha.com/pr/19501049-morgan-stanley-third-quarter-2023-earnings-results?hasComeFromMpArticle=false&amp;source=content_type%253Areact%257Csection%253Amain_content%257Cbutton%253Abody_link\">suggested</a> a lack of momentum in corporate investment as companies are applying less to have capital for acquisitions or merger projects with other companies. The report also shows that due to increased risk aversion in financial markets, companies are postponing growth plans to finance with capital through initial public offerings (IPO) transactions. Morgan Stanley recorded significantly lower IPO proceeds in the third quarter of 2023 than in the previous year.</p> <p class=\"paywall-full-content invisible\">When labor condition worsens significantly, the economy will officially enter a recession: last week, Andrew Challenger, a labor expert and senior vice president of Challenger, Gray and Christmas, Inc., <a href=\"https://tradingeconomics.com/united-states/challenger-job-cuts\" rel=\"nofollow\">said</a> that he expects the number of layoffs to increase in the coming months. Plus, Nela Richardson, chief economist at Automatic Data Processing, Inc. (<a href=\"https://seekingalpha.com/symbol/ADP\" title=\"Automatic Data Processing, Inc.\">ADP</a>), <a href=\"https://tradingeconomics.com/united-states/adp-employment-change\" rel=\"nofollow\">expects</a> hiring and wage growth to moderate significantly in 2024 following an increase in restaurant and hotel job creation during the post-pandemic recovery. Additional economic data from the U.S. Bureau of Labor Statistics <a href=\"https://tradingeconomics.com/united-states/non-farm-payrolls\" rel=\"nofollow\">showed</a> last week that nonfarm payroll growth in November fell below last year's average for the second month in a row, suggesting a “slowdown in the labor market”.</p> <h2 class=\"paywall-full-content invisible\"><strong>ATI Inc. Revenue and EBITDA Margins: Aerospace and Defense as Key Drivers</strong></h2> <p class=\"paywall-full-content invisible\">In the <a href=\"https://seekingalpha.com/pr/19520555-ati-announces-third-quarter-2023-results?hasComeFromMpArticle=false\">third quarter of 2023</a>, ATI reported revenue of $1.026 billion, down 1.95% quarter-over-quarter and down 0.62% year-over-year, primarily due to recessionary weakness in general industrial end markets as well as planned outages mainly within the Advanced Alloys &amp; Solutions (AA&amp;S) business division.</p> <p class=\"paywall-full-content invisible\">The headwind, which is expected to increase in 2024 when the recession is expected to bite into the cycle, was stronger than AA&amp;S's good sales performance in commercial aviation products.</p> <p class=\"paywall-full-content invisible\">ATI is also facing a challenge from lower orders currently impacting the overall U.S. manufacturing sector, as companies reported three consecutive months of declining activity after bottoming out in November 2023, as <a href=\"https://tradingeconomics.com/united-states/manufacturing-pmi\" rel=\"nofollow\">indicated</a> by the S&amp;P Global US Manufacturing PMI. As previously mentioned, the well-known issues of high core inflation and tightening credit conditions are affecting consumer purchasing power and business investment, which, among other things, means that operators are currently struggling with an unfavorable selling price environment. ATI sees these two product categories currently paying the price for deteriorating business conditions in the industrial metal fabrication sector: Investors can expect a continued decline in demand for its nickel-based alloys and a decline in shipments of precision rolled strip products in the coming months.</p> <p class=\"paywall-full-content invisible\">The headwinds that prevented ATI sales from improving were also stronger than the positive effects from growth in the commercial air-frame market and stronger than positive year-over-year momentum in total aerospace and defense-related sales in the High-Performance Materials and Components (HPMC) business division.</p> <p class=\"paywall-full-content invisible\">For the first nine months of 2023, total sales were $3.110 billion, up 10% year-on-year, still signaling an overall improvement in sales, as a result of the important contribution of increased exposure to aerospace and defense which represented 85% of HPMC's total sales and 61% of ATI's total sales in the third quarter of 2023. The latter percentage of total revenue increased 300 basis points sequentially and 1,000 basis points year-over-year.</p> <p class=\"paywall-full-content invisible\">ATI's adjusted EBITDA was $148.1 million in the third quarter of 2023, still up 5% year-over-year, driven by higher-margin, next-generation commercial aerospace platforms within the HPMC segment and increases in titanium mill product shipments in the AA&amp;S segment. ATI's adjusted EBITDA was down 1% compared to the previous quarter.</p> <p class=\"paywall-full-content invisible\">ATI's adjusted EBITDA margin was 14.4% in the <a href=\"https://seekingalpha.com/pr/19520555-ati-announces-third-quarter-2023-results?hasComeFromMpArticle=false\">third quarter of 2023</a>, compared to 14.3% in the second quarter of 2023 and compared to 13.7% in the third quarter of 2022, with a higher contribution from the HPMC division, particularly for aerospace and defense applications.</p> <h2 class=\"paywall-full-content invisible\"><strong>Looking Ahead: All Set for Higher Sales and EBITDA Margins</strong></h2> <p class=\"paywall-full-content invisible\">Going forward, ATI's EBITDA margins are on track to further improve and generate significant cash flow from operations. This expectation is because of the increased exposure to profitable aerospace and defense markets within the HPMC segment.</p> <p class=\"paywall-full-content invisible\">Although AA&amp;S's growth may be impacted in the near term by recession headwinds, the aerospace and defense industries will, in turn, help the segment continue to move forward.</p> <p class=\"paywall-full-content invisible\">The company has provided the following forecasts for a longer-term outlook. By the entire year of 2025, revenue is <a href=\"https://seekingalpha.com/pr/19551840-ati-targets-2027-revenue-exceeding-5-billion-on-platform-of-organic-growth?hasComeFromMpArticle=false\">estimated</a> at $4.5 billion to $4.6 billion (up 9.6% from $4.15 billion <a href=\"https://seekingalpha.com/symbol/ATI/earnings/estimates\">forecasted</a> for 2023), while adjusted EBITDA is estimated between $0.8 billion and $0.9 billion, resulting in an adjusted EBITDA margin of 17.8% to 19.6%.</p> <p class=\"paywall-full-content invisible\">By the entire year of 2027, revenue is <a href=\"https://seekingalpha.com/pr/19551840-ati-targets-2027-revenue-exceeding-5-billion-on-platform-of-organic-growth?hasComeFromMpArticle=false\">estimated</a> at $5.2 billion to $5.4 billion (up 7.9% from $4.91 billion <a href=\"https://seekingalpha.com/symbol/ATI/earnings/estimates\">forecasted</a> for 2026), while adjusted EBITDA is estimated between $1 billion and $1.2 billion, resulting in an adjusted EBITDA margin of 19.2% to 22.2%.</p> <p class=\"paywall-full-content invisible\">This is expected to generate strong free cash flow as the adjusted net income conversion ratio was set above 90%, improving the company's financial position, which however appeared stable in the third quarter of 2023, and increasing the likelihood that ATI will start paying dividends.</p> <h2 class=\"paywall-full-content invisible\"><strong>The Financial Condition</strong></h2> <p class=\"paywall-full-content invisible\">As of the <a href=\"https://seekingalpha.com/pr/19520555-ati-announces-third-quarter-2023-results?hasComeFromMpArticle=false\">third quarter of 2023</a>, ATI's balance sheet had $433 million plus additional undrawn liquidity of $550 million in credit facilities.</p> <p class=\"paywall-full-content invisible\">That cash is significantly less compared to the total debt load of about $2.19 billion, but the solvency ratios suggest that the company can easily pay off financial obligations from the outstanding debt and that the repayment plan seems manageable with no notable maturities before 2025.</p> <p class=\"paywall-full-content invisible\">Total debt currently implies paying a trailing 12-month interest expense of <a href=\"https://seekingalpha.com/symbol/ATI/income-statement\">$89.3 million</a> as of the third quarter of 2023, but this is 4.6 times lower than the trailing 12-month operating income of <a href=\"https://seekingalpha.com/symbol/ATI/income-statement\">$412.9 million</a> as of the third quarter of 2023, suggesting ATI can generate enough income to cover costs due to outstanding debt.</p> <p class=\"paywall-full-content invisible\">If you scroll down to the risk section on this <a href=\"https://seekingalpha.com/symbol/ATI/\">page</a> of Seeking Alpha, you'll find the Altman Z-Score of 2.58, which suggests that ATI's balance sheet is not completely in safe territory and is at low risk of bankruptcy within a few years. However, this risk is likely to become zero as the company increases free cash flow which in the future could be used to finance the payment of a dividend as a form of rewarding shareholders in addition to the current share buyback programs.</p> <p class=\"paywall-full-content invisible\">Based on trends observed over the past 2 years, taking into account the times the dynamics worked in favor of the generation of positive free cash flow, it can be concluded that with a 12-month EBITDA of $440 million, the company could convert 14% of that to free cash flow of $62 million.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/12/13/5074741-1702476181480485_origin.png\" rel=\"lightbox\" data-width=\"898\" data-height=\"140\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2023/12/13/5074741-1702476181480485.png\" alt=\"ATI''s EBITDA, operating cash flow, capex, and free cash flow on a 12-month basis over past 2 years\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Source of data: Seeking Alpha</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Based on some observations made as part of this analysis, analyst estimates of industry growth, and the company's forecasts of earnings and free cash flow conversion rates, the future free cash flow generation will be significantly higher, which will improve the financial health of the balance sheet. The company aims for <a href=\"https://seekingalpha.com/pr/19551840-ati-targets-2027-revenue-exceeding-5-billion-on-platform-of-organic-growth?hasComeFromMpArticle=false\">90%</a> of future adjusted EBITDA to be free cash flow within a few years, for example between $720 million and $1.1 billion. Free cash flow hasn't always been positive in the past as the company went through a restructuring process that today brings it closer to its goal of generating 65% of total revenue (vs. the past 40-45%) in fast-growing aerospace and defense markets. In addition, as previously mentioned, the company may currently face the same economic burdens as other manufacturers, which could continue into 2024. However, the tipping point should be just one step away: Driven by the significant growth expected in the global aerospace and defense market in the coming years - with a compound annual growth rate <a href=\"https://www.linkedin.com/pulse/aerospace-defense-market-size-2023-forecasting\" rel=\"nofollow\">of almost 6%</a> over the next five years - ATI's business will then be in a stronger position to beat forecasts of strong free cash flow conversion. This scenario is out there as soon as the current phase of economic uncertainty is overcome.</p> <p class=\"paywall-full-content invisible\">In the third quarter of 2023, one million common shares were repurchased in the open market at $43.93 each, providing approximately $45 million for the share repurchase program. Under the current approval, $30 million can still be repurchased, but more such rewards for investors are not ruled out going forward.</p> <h2 class=\"paywall-full-content invisible\"><strong>The Stock Valuation</strong></h2> <p class=\"paywall-full-content invisible\">ATI has what it takes to continue the upward trend in its share price as seen in 2023, albeit through cycles, but instead of adding shares to the position now, investors may want to wait for a lower share price that has a chance to occur in the next few weeks.</p> <p class=\"paywall-full-content invisible\">Shares of ATI were trading at $40.41 per unit giving it a market cap of $5.22 billion.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/12/12/5074741-17024049035243192_origin.png\" rel=\"lightbox\" data-width=\"805\" data-height=\"419\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/12/12/5074741-17024049035243192.png\" alt=\"A graph of stock market Description automatically generated\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Source: Seeking Alpha</span></p></figcaption></figure><figure contenteditable=\"false\" class=\"paywall-full-content invisible\"></figure></p> <p class=\"paywall-full-content invisible\">Shares do not look expensive but also not very interesting based on a comparison with their recent performance. They are trading almost in line with the 200-day simple moving average of $40.99 and the 50-day SMA of $40.82. But shares are also above the $38.185 midpoint of the 52-week range of $28.45 to $47.92.</p> <p class=\"paywall-full-content invisible\">To establish or expand a long-term position in ATI, the ball is now in the market's court, as the company has certainly done its best to turn its fortunes around.</p> <p class=\"paywall-full-content invisible\">The last five years have shown that ATI is a suitable candidate to participate in the long-term growth of the US stock market. It was nearly in line with the SPDR® S&amp;P 500 ETF Trust (<a href=\"https://seekingalpha.com/symbol/SPY\" title=\"SPDR® S&amp;P 500 ETF Trust\">SPY</a>), a benchmark for U.S.-listed stocks. The index grew 77.5% over the past five years, while ATI stock gained 72.80%. ATI has laid a solid foundation to reverse the trend.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/12/12/5074741-1702404903456909_origin.png\" rel=\"lightbox\" data-width=\"805\" data-height=\"419\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/12/12/5074741-1702404903456909.png\" alt=\"A graph of stock market Description automatically generated with medium confidence\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Source: Seeking Alpha</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">The company's strategy to increase exposure to high-margin aerospace and defense customers bodes well for this stock's growth prospects. As the company's strategy begins to generate stronger free cash flow and perhaps even pay a dividend, the stock will attract more interest in the stock market and the share price should reap the benefits.</p> <p class=\"paywall-full-content invisible\">Recessionary headwinds expected in 2024 could prevent profit margins from growing faster than they could, but the aerospace and defense industry should help overcome the challenges. Nonetheless, shares of US-listed companies are likely to continue to suffer from the negative winds, and with a 24-month market beta of 1.15 (scroll down to the risk section on this <a href=\"https://seekingalpha.com/symbol/ATI/\">page</a> of Seeking Alpha), shares of ATI will also face some downward pressure.</p> <p class=\"paywall-full-content invisible\">The 14-day RSI of 43.15 suggests that shares are still far from oversold levels, so shares could still reach lower levels than currently amid negative winds from the next downturn of the economy.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/12/12/5074741-1702404903592766_origin.png\" rel=\"lightbox\" data-width=\"805\" data-height=\"419\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/12/12/5074741-1702404903592766.png\" alt=\"A screenshot of a graph Description automatically generated\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Source: Seeking Alpha</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\"><strong>Conclusion</strong></h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">ATI has almost reached its goal of generating 65% of the company's total revenue from the aerospace and defense sector. The income range is then well positioned to benefit from the sector's strong outlook, driven by massive government spending on strategic activities. With a conversion rate of more than 90%, ATI will generate strong free cash flow from earnings, then it could potentially establish the payment of a dividend in addition to a share repurchase program, providing a strong catalyst for higher share prices. However, this analysis does not recommend increasing this stock now, but rather waiting for the creation of more attractive entry points, which are possible as early as 2024 given the looming economic recession.</p>", "twitContent": "$ATI - ATI: Solid Foundation For Long-Term Growth, But With Short-Term Headwinds. https://seekingalpha.com/article/4657780-ati-solid-foundation-for-long-term-growth-but-with-short-term-headwinds?source=tweet ", "innerMarketing": "", "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "44381", "type": "author"}}, "sentiments": {"data": [{"id": "508827", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2607", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "97181", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "764066", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4657780-ati-solid-foundation-for-long-term-growth-but-with-short-term-headwinds", "canonical": "https://seekingalpha.com/article/4657780-ati-solid-foundation-for-long-term-growth-but-with-short-term-headwinds", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/498381212/image_498381212.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "44381", "type": "author", "attributes": {"company": null, "slug": "alberto-abaterusso", "userId": 5074741, "tagId": 97181, "bio": "Alberto holds a Master's degree in Business Economics. During his academic career he acquired an extensive managerial and economic background, with a solid quantitative basis.  He covers all sectors and the different types of stocks. Essentially describes a useful investment strategy that fits the profile of any investor, whether they are dividend investors or interested in a value proposition or growth opportunity.<br><br><p>  <br></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/005/074/741/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/005/074/741/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/005/074/741/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/005/074/741/extra_large_pic.png"}, "nick": "Alberto Abaterusso", "deactivated": null, "memberSince": 2012, "isRss": false, "contributorSince": 2013, "followersCount": 1706}, "relationships": {"user": {"data": {"id": "5074741", "type": "user"}}, "userBioTags": {"data": [{"id": "890387", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/alberto-abaterusso", "profileUrl": "/author/alberto-abaterusso", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2607", "type": "tag", "attributes": {"slug": "ati", "name": "ATI", "company": "ATI Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "15", "type": "sector"}}}, "links": {"self": "/symbol/ATI"}}, {"id": "97181", "type": "tag", "attributes": {"slug": "alberto-abaterusso", "name": "Alberto Abaterusso", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/alberto-abaterusso"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "764066", "type": "tag", "attributes": {"slug": "undercovered", "name": "undercovered", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/undercovered"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "508827", "type": "sentiment", "attributes": {"articleId": 4657780, "type": "neutral", "createdAt": "2023-12-13T20:03:07.000-05:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4657780", "type": "article"}}, "tag": {"data": {"id": "2607", "type": "tag"}}}}]}