{"data": {"id": "3132686", "type": "fullArticle", "attributes": {"publishOn": "2015-05-03T07:37:45-04:00", "isLockedPro": false, "commentCount": 4, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"market-dj": {"id": 507976, "slug": "market-dj", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "dis": {"id": 86, "slug": "dis", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro: A Possible Transformation To Higher Multiples Through Initiatives And Partnerships", "summary": ["Hasbro’s stock has been on a tear lately because of great earnings, new products and initiatives, and new partnerships.", "A closer look at the earnings transcript and the earnings presentation from April should give investors more insight into Hasbro’s prospects.", "Valuation numbers are a concern, so I will attempt to grade Hasbro on a sliding scale."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2015-05-03T19:42:12-04:00", "isModerated": false, "closestTradingDate": "2015-05-04", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>The author is long DIS.</span> <span id=\"top-business-disclosure\"> The author wrote this article themselves, and it expresses their own opinions. The author is not receiving compensation for it (other than from Seeking Alpha). The author has no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I will be watching the price action of HAS daily, and may average in at any time. I will disclose any buys via StockTalk on SA immediately after my purchase.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>On April 20th, 2015, Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) reported fairy tale numbers across many of its traditional brands, through franchise brand revenues. More importantly, Hasbro is finding the story of its products being told on the big screen, and this (film + product) relationship could stimulate double-digit growth both on the top and bottom line.</p> <p>When deciding to invest, I like to use a simple three-pronged analysis. Sticking to the basics, I look at the product, the company, and then the numbers, in that order. There is no need to waste time looking at the numbers without a compelling product and a solid company.</p> <p>First let's start with the product. Hasbro is a maker of toys. The list is extensive, and growing. Hasbro designates seven brands as Franchise Brands: Littlest Pet Shop, Magic: The gathering, Monopoly, My Little Pony, Nerf, Play-Doh, and Transformers. I like to find out where I can purchase the products as well, so I checked out <a href=\"https://www.hasbro.com/en-us\" target=\"_blank\" rel=\"nofollow\">www.hasbro.com/en-us</a>. I found the website clean and direct, easy to navigate, even for a small child. This is a plus, considering the amount of toys an online shopper could sift through. Product market is important; the market for Hasbro is kids - everywhere, big and small. I picked out an item for my office:</p> <p><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/5/14841532_14306150017651_rId6.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/5/14841532_14306150017651_rId6_thumb.jpg\" fetchpriority=\"high\"></a></span></p> <p>There is an obvious market for Hasbro's products, but what are the possibilities for new growth? New products generate excitement, and one of the criticisms this past decade for Hasbro is a lack of girl toys. My Little Pony has experienced a recent surge in sales growth with some new initiatives and a successful TV show, but Furby and Easy Bake have been laggards in the product line. That all changed late last September with perhaps the biggest move Hasbro has made all year, <a href=\"https://www.bloomberg.com/news/articles/2014-09-24/hasbro-swipes-disney-s-frozen-princess-licenses-from-mattel\" target=\"_blank\" rel=\"nofollow\">the deal with Disney</a><span class=\"paywall-full-content invisible\">. As far as new products go, Disney Princess and the Frozen franchise are possible game changers, and Wall Street reacted favorably to the news. Disclosure, in order to perform due diligence, I went ahead and ordered the Han Solo action figure above. I will rate the toy when it arrives and provide an update.</span></p> <p class=\"paywall-full-content invisible\">Besides the Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>) Star Wars, and Marvel toys, new apps and digital games are being produced and branded to take advantage of the technological shift in the way boys and girls play with their favorite characters today. Hasbro's realignment of products and possibilities through the use of technology and licensing make this company look good, so we go on.</p> <p class=\"paywall-full-content invisible\">Hasbro has been a publicly traded company since 1968, and it's safe to assume they aren't going away via bankruptcy or some other financial disruption. But let's take a look at the company financials just to be sure.</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/5/14841532_14306150017651_rId8.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/5/14841532_14306150017651_rId8_thumb.jpg\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em>Source: S&amp;P Capital IQ</em></p> <p class=\"paywall-full-content invisible\">As you can see from the income statement, revenue growth felt a few hiccups from the Great Recession until last year, but things seem to be back on track, especially if you add in the beginning of this year, Q1 2015, which I will get to shortly. Not a pristine balance sheet, we all know it could be better, but the company possesses enough FCF to satisfy me, especially in this super low-rate environment. Long-term debt is always an issue, but a Baa2 via Moody's says Hasbro has a long-term \"stable\" credit rating: check. I am satisfied with the company at this point, and I am super excited (the kid in me) about its products. Let's see if the numbers can keep the momentum going.</p> <p class=\"paywall-full-content invisible\">The stock price for Hasbro started moving up wildly with Disney's Frozen announcement last September, and it continued to climb to nearly $75 with the conference call just last week. Wall Street spoke with their money after they heard what Hasbro had to say. Was it something in earnings, or in the Q&amp;A, that sparked the massive rise in the stock price before the market opened April 20th, 2015? I've combed the transcript a number of times this past week, which you can find <a href=\"https://seekingalpha.com/article/3083146-hasbro-has-brian-d-goldner-on-q1-2015-results-earnings-call-transcript\" target=\"_blank\">here</a>. And I have identified a couple of strategies, found <a href=\"https://files.shareholder.com/downloads/HAS/110154859x0x822014/2346B79C-B7A7-4AB3-9157-7B999B22EA0E/Hasbro_Q1_2015_Earnings_Presentation_FINAL.pdf\" target=\"_blank\" rel=\"nofollow\">here</a>. And these plans, if successful, could transform Hasbro from a successful long time toy company into a fast growing juggernaut in this \"Content is King\" environment.</p> <p class=\"paywall-full-content invisible\">From the conference call, we know that revenues increased across the board in all regions, and in all categories, with the exception of the girls division, which was down 16%. As mentioned before, this issue has been addressed in a big way with the Disney announcement. Some features I want to highlight from the Investor Presentation include:</p> <p class=\"paywall-full-content invisible\"><strong>Strategic Retail Partnerships:</strong></p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/5/14841532_14306150017651_rId12.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/5/14841532_14306150017651_rId12_thumb.jpg\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">This is a transformation from brand to content, and a company that acts on these perpetual market shifts can capitalize on its brand and its story. This blueprint looks like a monster revenue machine. Why? Consider the movies slated for 2015, and beyond: Star Wars, Transformers, and the recently announced Play-Doh movie mentioned in the CC. There are other movies and TV shows I haven't mentioned, and I predict a fresh batch of these cross-licensed toy movies to be produced each year until it is no longer a winning formula. The Disney partnership bodes well for Hasbro, and this relationship will only expand the amount of content Hasbro has access to. What's next, a Monopoly movie? Why wouldn't Hollywood be on board when there is so much money to be made? Besides this vision, what other numbers did Wall Street like?</p> <p class=\"paywall-full-content invisible\"><strong>FX impacts tell a better story. Operating Profit, Major Expenses, and Capital Priorities</strong></p> <p class=\"paywall-full-content invisible\">The financial highlights I found in the investor presentation spoke volumes to how good of a quarter it really was at Hasbro, maker of smiles. Absent FX, international revenues grew at about 20% across all markets. A difference of $62.6M on the top line was lost due to the strong dollar. Revenue growth in higher margin brands such as Magic: The Gathering, and Entertainment and Licensing, in particular, helped to increase operating profit, which grew 25% from $43M to $54M. A closer look at operating cash flow sees a 174% growth YOY, $6M to $16M, in Entertainment and Licensing, which is high margin business. Some of the capital priorities also look good; including dividend increases, share repurchases, and a target of at least $500M on average per year operating cash flow.</p> <p class=\"paywall-full-content invisible\">Check out Page 14 from the investor's presentation:</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/5/14841532_14306150017651_rId13.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/5/14841532_14306150017651_rId13_thumb.jpg\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Money flowing into product development stimulates new growth opportunities, and with the addition of Disney's Frozen Princess, these investments are in line with the story management is telling. The remainder of the expense sheet seems to tell the story of content, and branding merchandise across TV, film, digital games and formats, and, of course, the hard copy toys you, or your child, might want to hold.</p> <p class=\"paywall-full-content invisible\">These are not just highlights, but substantial shifts, that should bring about substantial growth. I am taking into consideration that some of these initiatives have just started. These numbers could be just the beginning of something massive, or they could just be a spark and fade in an ultra competitive environment. This year should be very telling with the film releases I mentioned earlier. The films could be busts. Regardless, I like to side with winners. In the past two years Hasbro has been aggressive, and those behaviors have won over Wall Street <em>because</em> the numbers have been there, plain and simple. The potential for more films to market products directly to the consumer is probably debatable; but if the first product to market (the film) is successful, and the secondary products, (toys + licensing fees) are as advertised, then a bunch of money is going to be made, both for Hasbro, and for shareholders.</p> <p class=\"paywall-full-content invisible\">The only remaining numbers have to do with the stock price. I prefer growth over value, but if I am paying for growth at 20-22x earnings, then that growth needs to be in the ballpark of 20%. Let's take a look at the estimates and see where they take us, the stock price performance of Hasbro is reflected in the blue line:</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2015/5/14841532_14306150017651_rId14.png\" loading=\"lazy\"></p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table border=\"1\" cellpadding=\"0\"> <colgroup> <col> <col> <col> <col> <col> <col> </colgroup> <tr> <td><p><strong>Market Comparison</strong></p></td> <td><p><strong>P/E (TTM)</strong></p></td> <td> <p><strong>P/E (Forward</strong></p> <p><strong>12 Months)</strong></p> </td> <td><p><strong>PEG</strong></p></td> <td> <p><strong>1-Year EPS</strong></p> <p><strong>Growth Rate</strong></p> </td> <td> <p><strong>5-Year EPS</strong></p> <p><strong>Growth Rate</strong></p> </td> </tr> <tr> <td> <p><strong>HAS</strong></p> <p>Hasbro Inc.</p> </td> <td><p><strong>22.0</strong></p></td> <td><p><strong>21.4</strong></p></td> <td><p><strong>1.9</strong></p></td> <td><p><strong>47.46%</strong></p></td> <td><p><strong>5.22%</strong></p></td> </tr> <tr> <td> <p><strong>Leisure Products</strong></p> <p>Industry</p> </td> <td><p><strong>21.9</strong></p></td> <td><p><strong>18.6</strong></p></td> <td><p><strong>6.5</strong></p></td> <td><p><strong>14.14%</strong></p></td> <td><p><strong>36.09%</strong></p></td> </tr> <tr> <td> <p><strong>Consumer Cyclicals</strong></p> <p>Sector</p> </td> <td><p><strong>69.9</strong></p></td> <td><p><strong>8.7</strong></p></td> <td><p><strong>4.7</strong></p></td> <td><p><strong>431.47%</strong></p></td> <td><p><strong>17.52%</strong></p></td> </tr> <tr> <td><p><strong>S&amp;P 500</strong></p></td> <td><p><strong>19.9</strong></p></td> <td><p><strong>18.1</strong></p></td> <td><p><strong>3.4</strong></p></td> <td><p><strong>2.34%</strong></p></td> <td><p><strong>15.99%</strong></p></td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span><p class=\"paywall-full-content invisible\"><em>Source: Scottrade.</em></p> <p class=\"paywall-full-content invisible\">The high end of EPS estimates for the next two quarters are at $0.30 for Q2, and $1.60 for Q3, add the real numbers from Q1, then the high-range before the addition of the holiday quarter, stands at $2.11 per share. Last holiday season Hasbro earned $1.22 a share, so the trailing P/E ratio would still be 21x earnings at today's price of $71.66 per share going into the 2015 holiday season - if everything went according to plan, and in line with the high-end of the estimates. There is just too much of 2015 left to predict the upcoming holiday season, and most street estimates vary dramatically. At this point in the story a drop in the share price would be more aligned with a short-term (2015) outlook in what feels like a fairly priced market, overall. However, be aware that if Hasbro starts beating again, like it did on April 20th, then the ride for this fairy tale stock is far from over. The market will reward Hasbro with a higher multiple, and the 22 P/E-handle you see on Hasbro now will look fashionable, like Disney.</p> <p class=\"paywall-full-content invisible\">What if things go way better than planned? The movies become mega blockbusters, the merchandise flies off the shelf, and the earnings estimates must continue to be revised. What if the ballpark estimates move towards $4 a share? Then $5 per share as we get into 2016? I know these numbers sound lofty now, but magic happens on the big screen, and Hasbro is a big company making strategic moves to stimulate double-digit growth, both on the top and bottom line.</p> <p class=\"paywall-full-content invisible\"><strong>The Risks</strong></p> <p class=\"paywall-full-content invisible\">Besides the obvious macro-economic downturns, and bear markets, which all equities are subject to, questions of valuation are currently a risk. There are dangers at these prices if Hasbro does not beat estimates, and the movies do not equal big revenue increases for its toys, or if they just don't execute well. These are real risks, so let's go as low as $3.33 per year EPS, a disaster if you consider the potential outlined in both the earnings call and the investor presentation. Hasbro would likely trade as low as 15x earnings, putting the stock price at right about $50 per share. An absolute bear scenario puts Hasbro as low as 12x-14x times earnings for $3 to $3.30; giving us a low ranging from $36 to $46. Oh, did I mention the dividend, which currently stands at 2.57% (using the May 1st closing price of $71.66), paying shareholders $0.46 per quarter. The dividend is safe and growing nicely; Hasbro specifically addresses the dividend on page 17 in the investor's presentation linked earlier.</p> <p class=\"paywall-full-content invisible\"><strong>Final Grades</strong></p> <p class=\"paywall-full-content invisible\">The short answers are as follows. The Product: an A, growth potential is there for already popular merchandise. The Company: a B-, the long-term debt is there and always a concern, and despite initiatives the company still has more to prove. The Numbers: This is the toughest grade because of the run-up in Hasbro's stock price. At current levels it's a C+, because the dividend boosts the grade. At $65-60 per share, I can honestly give Hasbro a B+ because the dividend is nearly 3%. Hasbro's stock price would have to drop to $52.50 or below to earn an A to A+, and that would put the dividend right at 3.5%. The final grade gives 25% weight to each Product and Company, and 50% weight to the Numbers:</p> <p class=\"paywall-full-content invisible\">Final Grade for Hasbro = B-</p> <p class=\"paywall-full-content invisible\"><strong>Conclusion</strong></p> <p class=\"paywall-full-content invisible\">After I have evaluated the product, the company, and the numbers, I like to ask myself the easy question (the EQ), or the equation. Others like to call it the equalizer, or the end question. The EQ for Hasbro goes as follows: Can the products that Hasbro sells generate enough revenue for double-digit EPS growth, and will shareholders be rewarded? I think the first part is up for grabs, but the chances are that Hasbro's toys will experience a generous uptick in popularity because of the corresponding movies. After looking through the company's numbers and prospects, I have no doubt that Hasbro will be rewarding shareholders if its plans work out, and revenue expectations are met or exceeded. There are no red flags, the company has laid out a solid strategy, and I cannot wait to see what happens next.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">So when should you buy the stock? I can only offer Peter Lynch's advice<em>, \"The best time to buy stocks will always be the day you've convinced yourself you've found solid</em> <em>merchandise at a good price- the same as at the department store.\"</em></p>", "twitContent": "$HAS - Hasbro: A Possible Transformation To Higher Multiples Through Initiatives And Partnerships. https://seekingalpha.com/article/3132686-hasbro-a-possible-transformation-to-higher-multiples-through-initiatives-and-partnerships?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "87366", "type": "author"}}, "sentiments": {"data": [{"id": "154673", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "86", "type": "tag"}]}, "otherTags": {"data": [{"id": "507976", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/3132686-hasbro-a-possible-transformation-to-higher-multiples-through-initiatives-and-partnerships", "canonical": "https://seekingalpha.com/article/3132686-hasbro-a-possible-transformation-to-higher-multiples-through-initiatives-and-partnerships", "uriImage": "https://static.seekingalpha.com/uploads/2015/5/14841532_14306150017651_rId6.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2015/5/14841532_14306150017651_rId6.png"}}}, "included": [{"id": "87366", "type": "author", "attributes": {"company": null, "slug": "market-dj", "userId": 14841532, "tagId": 507976, "bio": "<i>Every stock has a story, and that story is told each day the stock market opens.</i><br><br><b><br></b><p><b>Market DJ: Research, Enlightenment, Entertainment</b></p><br><br><p>Listening to the market, cutting through the noise... Finding good products & companies, crunching numbers... Looking for long-term macro trends in consumer spending habits... Learning through research and market performance...</p>Focusing on US Listed Companies:<br><i><br></i><i>–retail and technology trends<br></i><i><br></i><i>–media and entertainment products<br></i><i><br></i><i>–food & beverage, restaurant, and hospitality <br></i><i><br></i><i>–long & short opportunities<br></i><br><br><br><p>We conduct independent, boots on the ground research, as well as the numbers. Go with what you know. Every stock has a story, and that story is told each and every day in the stock market. We look at the product, the company, then the numbers. I am djkidm, and teamed with knowledgable family & friends form <b>Market DJ</b>– research with a goal of making money & sharing that research publicly every once in a while to measure performance & receive criticism & advice. </p><br><b>Market DJ</b> is mainly interested in growth & value. Companies that make money, preferably American, but we invest around the world. We look for at least 10% or more growth per year, and want a good product, company, and market, no excuses.  <br><p></p><br><br><b>About djkidm: <br></b><br>I have a background in Journalism, and I hope to shed some light upon the media practices I witness each day in the Stock Market. I graduated from Portland State University in 2003 with a BA in English. I make money as a restauranteur, deejay, and writer. I joined the market in June of 2013, which presented some terrific buying opportunities. Recently I quit my night job as a bartender to concentrate on business plans, market research, and to continue making money in the market. <br><p><br></p><br><br>dj<br><br>knowledge<br><br>insight<br><br>diligence<br><br>money$", "image": {"small": "https://static.seekingalpha.com/images/users_profile/014/841/532/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/014/841/532/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/014/841/532/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/014/841/532/extra_large_pic.png"}, "nick": "Market DJ", "deactivated": null, "memberSince": 2013, "isRss": false, "contributorSince": 2015, "followersCount": 386}, "relationships": {"user": {"data": {"id": "14841532", "type": "user"}}, "userBioTags": {"data": [{"id": "607526", "type": "userBioTag"}, {"id": "607536", "type": "userBioTag"}, {"id": "607546", "type": "userBioTag"}, {"id": "607556", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/market-dj", "profileUrl": "/author/market-dj", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "86", "type": "tag", "attributes": {"slug": "dis", "name": "DIS", "company": "The Walt Disney Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/DIS"}}, {"id": "507976", "type": "tag", "attributes": {"slug": "market-dj", "name": "Market DJ", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/market-dj"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "154673", "type": "sentiment", "attributes": {"articleId": 3132686, "type": "bullish", "createdAt": "2015-05-03T07:37:45.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "3132686", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}