{"data": {"id": "3162306", "type": "fullArticle", "attributes": {"publishOn": "2015-05-08T20:08:59-04:00", "isLockedPro": false, "commentCount": 4, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"the-dividend-guy": {"id": 9170, "slug": "the-dividend-guy", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "mat": {"id": 1748, "slug": "mat", "kind": "common", "non_theme": true}, "dis": {"id": 86, "slug": "dis", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro, The Growth Is In Licensing Products (And There Is More To Come)", "summary": ["The stock popped almost 30% this year and trades at a 52 week high, but there is more growth to come.", "New deal for Frozen proves Hasbro can steal business from Mattel and take over bigger projects.", "Upcoming blockbusters such as Frozen 2 and Star Wars will generate more toy sales for Hasbro."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2015-05-08T20:08:59-04:00", "isModerated": false, "closestTradingDate": "2015-05-11", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>The author is long DIS, WMT.</span> <span id=\"top-business-disclosure\"> The author wrote this article themselves, and it expresses their own opinions. The author is not receiving compensation for it (other than from Seeking Alpha). The author has no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><strong>DSR Quick Stats</strong></p> <p>Sector: Consumer, Cyclical</p> <p>5-Year Revenue Growth: 1.01%</p> <p>5-Year EPS Growth: 5.47%</p> <p>5-Year Dividend Growth: 16.13%</p> <p>Current Dividend Yield: 2.60%</p> <p><strong>What Makes Hasbro a Good Business?</strong></p> <p>Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) has divided their operation into four different segments that all share the same goal: offering the best family entertainment possible, which Hasbro calls the \"Best Play Experience.\" Their four segments are listed as follow:</p> <p><em>Toy &amp; Game Product Innovation</em></p> <p><em>Digital Media</em></p> <p><em>Immersive Entertainment Experiences</em></p> <p><em>Lifestyle Licensing</em></p> <p>But what really makes Hasbro interesting for me lies in its unique ability to renew and manage its franchise brands. In 2014, its franchise brands sales grew by 31%. While Hasbro has created its own blockbusters such as Monopoly (and I must mention I'm a huge fan of RISK), most of their creations are part of the \"old ways of playing\" as many board games don't catch today's kids' attention as they used too. Nonetheless, they continuously find a way to make their toys attractive and gather more kids around.</p> <p>On the other hand, their ability to generate numerous toys from partner brands such as Marvel (Avengers) or more recently Frozen from Disney is spectacular. Now that we have a new Star Wars trilogy coming and Hasbro will be part of the adventure, we can expect additional growth over the years to come.</p> <p>Please note that global toy growth is not phenomenal these days. There is about 1% growth in industrial countries (North America &amp; Europe) and between 5% and 6% for Latin America, Africa and Asia (source <a href=\"https://investor.hasbro.com/common/download/download.cfm?companyid=HAS&amp;fileid=809841&amp;filekey=9A9F3121-1455-401D-BC69-FD5DF63BEA39&amp;filename=Analyst_BG.pdf\" rel=\"nofollow\">Hasbro 2015 Investors Presentation</a>).</p> <p><strong>How HAS fares vs. My 7 Principles of Investing</strong></p> <p>We all have our methods for analyzing a company. Over the years of trading, I have gone through several stock researches methodologies from various sources. This is how I came up with my <a href=\"https://www.dividendstocksrock.com/buildyourownportfolio/\" rel=\"nofollow\" class=\"paywall-full-content invisible\"><strong>7 investing principles of dividend investing</strong></a><span class=\"paywall-full-content invisible\">. These investing rules are based on empirical research and have proven to consist in a solid and successful investing method. The first four principles are directly linked to a company's metrics. Let's take a closer look at them.</span></p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/5/106145_14311112361880_rId8.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/5/106145_14311112361880_rId8_thumb.jpg\" fetchpriority=\"high\"></a></span></p> <p class=\"paywall-full-content invisible\"><strong>Principle #1: High dividend yield doesn't equal high returns</strong></p> <p class=\"paywall-full-content invisible\">If a company shows a high yield, chances are it's because it is also showing a higher risk than other investments. Therefore, if you pick a high yield dividend stock, chances are that the results won't be spectacular in the future and the stock price might not rise very high. At worst, the dividend payment could become at risk. Empirical research has proven that the highest yield dividend stocks underperformed stocks in the second quartile in terms of dividend payments. This is why I always start by looking at what the dividend yield was through the past years.</p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table border=\"1\" cellpadding=\"0\"> <colgroup> <col> <col> </colgroup> <tr> <td><p><strong>Year</strong></p></td> <td><p><strong>Yield</strong></p></td> </tr> <tr> <td><p>Current</p></td> <td><p>2.60%</p></td> </tr> <tr> <td><p>2014</p></td> <td><p>3.08%</p></td> </tr> <tr> <td><p>2013</p></td> <td><p>3.16%</p></td> </tr> <tr> <td><p>2012</p></td> <td><p>4.70%</p></td> </tr> <tr> <td><p>2011</p></td> <td><p>2.61%</p></td> </tr> <tr> <td><p>2010</p></td> <td><p>2.71%</p></td> </tr> <tr> <td><p>2009</p></td> <td><p>2.96%</p></td> </tr> <tr> <td><p>2008</p></td> <td><p>3.30%</p></td> </tr> <tr> <td><p>2007</p></td> <td><p>2.10%</p></td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span><p class=\"paywall-full-content invisible\"><em>Author's table; source Ycharts</em></p> <p class=\"paywall-full-content invisible\">As you can see, the dividend yield has been around 2.60%-3.00% most of the time if we ignore the period when the stock price dropped from 2012 to 2014. Sales were down at that time and earnings were not that exciting either. A few blockbusters later and revamped versions of their Monopoly and Transformers toys and Hasbro is back on the growth path.</p> <p class=\"paywall-full-content invisible\"><strong>Principle #2: If there is one metric, it's called dividend growth</strong></p> <p class=\"paywall-full-content invisible\">Speaking of which, dividend growth is the most important metric for a dividend investor in my opinion. The reason is simple; if a company is able to sustain high dividend growth for several years in a row, it means it also sustains strong sales and earnings growth. I'm well aware EPS is an accounting number and it can be \"played\" from one financial statement to another. However, you can't play with earnings forever. This is why I look at a 5-year range to see how the business has handled the latest economic cycle.</p> <p class=\"paywall-full-content invisible\">For Hasbro, we are talking about an annualized dividend growth rate of 16.38%. As you can see in the previous graph, the company aggressively increased its dividend from 2011 to 2013 and the growth is now back to a more stable level. Nonetheless, the payment increase for 2015 was 6.67%.</p> <p class=\"paywall-full-content invisible\"><strong>Principle #3: A dividend payment today is good, a dividend guaranteed for the next ten years is better</strong></p> <p class=\"paywall-full-content invisible\">Here again, it's always interesting to look at what happened in the past, but it doesn't tell you what will happen in the future. I remember not so long ago reading many good comments about Mattel (<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a>) before the company posted disappointing sales back in early 2014. Hasbro seems to manage their growth well as their payout ratio has never hit over 67% and is more likely stable around 50%-55%. This provides the business some room to grow the dividend payment without being stuck against the wall if it goes through a bad year. After all, we are talking about a cyclical business here.</p> <p class=\"paywall-full-content invisible\"><strong>Principle #4: The foundation of dividend growth stocks lies in its business model</strong></p> <p class=\"paywall-full-content invisible\">When you look at the 5-year revenue growth, you get a stagnating 1.01% annualized growth rate from 2009 to 2014. However, if you put the revenues in perspective and look at what recently happened (which is not part of the 5-year data), you get the following graph:</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/5/106145_14311112361880_rId9.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/5/106145_14311112361880_rId9_thumb.jpg\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em>Source: Ycharts</em></p> <p class=\"paywall-full-content invisible\">Sales for the latest Holiday Season were great and the most recent quarter (results were published on April 20, 2015), shows both sales and earnings growth beating analysts' estimates. While results have been slowed down by a strong US dollar, the fact that many blockbusters lead to more toys sales has helped the company.</p> <p class=\"paywall-full-content invisible\">The fear of seeing kids leave classic toys for the latest iPad or Play Station 4 really exists too. I'd stay very cautious about a company selling something that belongs more to the past then the future. This problem leads to another one; there are a small number of stores selling classic toys. Therefore, margins are getting hurt since Hasbro has to negotiate with a handful of behemoths such as Wal-Mart (<a href=\"https://seekingalpha.com/symbol/WMT\" title=\"Walmart Inc.\">WMT</a>), Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) and Toys 'R Us. The three of them account for 35% of Hasbro Sales.</p> <p class=\"paywall-full-content invisible\">At the moment, I'm not worried about the current business model as the products derived from movies will continue to be substantial in the upcoming years. Marvel is never done with Super Hero movies and the latest Avengers show that consumers are not done either. Disney is on a roll with another Frozen in production and the coming of Star Wars in December 2015. This will be a great Holiday Season for Hasbro once again, especially since the US economy is doing better lately.</p> <p class=\"paywall-full-content invisible\"><strong>What Hasbro Does With its Cash</strong></p> <p class=\"paywall-full-content invisible\">Maybe one of the reasons why investors were so patient with Hasbro's slow sales growth was due to the important dividend growth during the same period. Hasbro shows a 5-year annualized dividend growth of 16%. This is more than enough for any income seeking investor to keep the stock regardless if sales are up or not. In February 2015, it has announced another 6.97% increase of its quarterly dividend from $0.43 per share to $0.46 per share. Considering a payout ratio around 50%, it is more than reasonable to think that more dividend growth will happen in the years to come.</p> <p class=\"paywall-full-content invisible\">The company also buys shares through a 92M share buyback program from 2005. In 2013, management authorized HAS to repurchase another $500 million of shares. Hasbro has returned to investors a total of $2.1 billion over the past five years through share buybacks and dividend payments.</p> <p class=\"paywall-full-content invisible\">During their most recent quarter, the company generated $315 million in cash flow, building the reserve to $1.1 billion. During this quarter alone, 436,000 shares were repurchased.</p> <p class=\"paywall-full-content invisible\"><strong>Should You Buy HAS at this Value?</strong></p> <p class=\"paywall-full-content invisible\">Now, do you think Hasbro is still an interesting buy after the stock popped another 30% in 2015 and trades at its all-time high? Let's take a look at the past 10 years' multiple:</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/5/106145_14311112361880_rId10.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/5/106145_14311112361880_rId10_thumb.jpg\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">The stock doesn't look like a bargain right now. It is historically trading at a multiple under 20 and currently trades at 22.52. At first glance, it seems a bit high but there is definitely a growth potential in the upcoming years and I think the stock is priced accordingly. The hype around the latest positive financial reports helps maintain a higher stock valuation.</p> <p class=\"paywall-full-content invisible\">The second method I use to value a stock is the Dividend Discount Model (DDM). The dividend growth rate averaged 16% over the past 5 years, but I think this is a bit too optimistic for the future. Since we have good years to come, I will use a two-stage model calculation with a 10% dividend growth for the first 10 years and then using an expected 7.5% dividend growth is more reasonable. As a discount rate, I will expect 11% return on my investment since Hasbro is not the perfect straightforward investment I could hope for. Here's the value I get:</p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table border=\"1\" cellpadding=\"0\"> <colgroup> <col> <col> <col> <col> </colgroup> <tr><td colspan=\"4\"><p><strong>Calculated Intrinsic Value OUTPUT 15-Cell Matrix</strong></p></td></tr> <tr> <td> </td> <td colspan=\"3\"><p><strong>Discount Rate (Horizontal)</strong></p></td> </tr> <tr> <td><p><strong>Margin of Safety</strong></p></td> <td><p><strong>10.00%</strong></p></td> <td><p><strong>11.00%</strong></p></td> <td><p><strong>12.00%</strong></p></td> </tr> <tr> <td><p><strong>20% Premium</strong></p></td> <td><p>$117.02</p></td> <td><p>$82.96</p></td> <td><p>$64.07</p></td> </tr> <tr> <td><p><strong>10% Premium</strong></p></td> <td><p>$107.27</p></td> <td><p>$76.05</p></td> <td><p>$58.73</p></td> </tr> <tr> <td><p><strong>Intrinsic Value</strong></p></td> <td><p>$97.52</p></td> <td><p><strong>$69.14</strong></p></td> <td><p>$53.39</p></td> </tr> <tr> <td><p><strong>10% Discount</strong></p></td> <td><p>$87.77</p></td> <td><p>$62.22</p></td> <td><p>$48.05</p></td> </tr> <tr> <td><p><strong>20% Discount</strong></p></td> <td><p>$78.02</p></td> <td><p>$55.31</p></td> <td><p>$42.72</p></td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span><p class=\"paywall-full-content invisible\"><em>Source: </em><span><a href=\"https://dividendmonk.com/dividend-book/\" rel=\"nofollow\"><em>Dividend Monk's Dividend Toolkit</em></a></span></p> <p class=\"paywall-full-content invisible\">As you can see, the stock is not that overvalued considering a discount rate of 11%. It seems Hasbro is priced accordingly with its potential.</p> <p class=\"paywall-full-content invisible\"><strong>What I Would Do With HAS if I Had $10K in Hand… and what about Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>)?</strong></p> <p class=\"paywall-full-content invisible\">After writing this analysis, I could conclude Hasbro is an interesting company but not trading at an incredible value. The growth potential is definitely here, but the market has already priced everything in consideration. It is probably not the right time to invest in Hasbro and a future dip in the stock price will eventually happen. If you look at the company's stock price, it could be volatile from time to time.</p> <p class=\"paywall-full-content invisible\">As I have previously mentioned in this article, Hasbro's growth will be linked to future derivative products such as Frozen and Star Wars. Since both movies are coming from Disney, I would be tempted to buy DIS before HAS. You can read about my other post o<span>n <a href=\"https://seekingalpha.com/article/3042556-behind-a-very-low-dividend-yield-disney-shows-very-strong-growth\">DIS</a></span>.</p> <p class=\"paywall-full-content invisible\"><span><strong>What do you think: Hasbro or Disney?</strong></span></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\"><strong>Disclaimer:</strong> I hold shares of DIS and WMT and do not hold shares of HAS, MAT or TGT.</p>", "twitContent": "$HAS - Hasbro, The Growth Is In Licensing Products (And There Is More To Come). https://seekingalpha.com/article/3162306-hasbro-the-growth-is-in-licensing-products-and-there-is-more-to-come?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "21151", "type": "author"}}, "sentiments": {"data": []}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "1748", "type": "tag"}, {"id": "86", "type": "tag"}]}, "otherTags": {"data": [{"id": "9170", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/3162306-hasbro-the-growth-is-in-licensing-products-and-there-is-more-to-come", "canonical": "https://seekingalpha.com/article/3162306-hasbro-the-growth-is-in-licensing-products-and-there-is-more-to-come", "uriImage": "https://static.seekingalpha.com/uploads/2015/5/106145_14311112361880_rId8.jpg", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2015/5/106145_14311112361880_rId8.jpg"}}}, "included": [{"id": "21151", "type": "author", "attributes": {"company": null, "slug": "the-dividend-guy", "userId": 106145, "tagId": 9170, "bio": "My name is Mike and I’m the author of The Dividend Guy Blog & The Dividend Monk along with the owner and portfolio manager here at Dividend Stocks Rock (DSR). I earned my bachelor degree in finance-marketing, own a CFP title along with an MBA in financial services. Besides being a passionate investor, I’m also happily married with three beautiful children. I started my online venture to educate people about investing and to be able to spend more time with my family. <br> <br>I started my career in the financial industry back in 2003. I earned several promotions along with a good pile of diplomas. I had lots of fun working with clients in private banking for half a decade, but thought I could do more with my life. <br> <br>In 2016, I decided to take a leap of faith and left everything behind to travel across North America and Central America with my family. We drove through nine countries and stayed three months in Costa Rica before returning home. This was an eye-opening adventure that led me in 2017 to quit my job in the financial industry and pursue my dream; helping others with their personal finance through my investing websites. <br> <br>You just found the reason why I quit my suit & tie job!<br>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/000/106/145/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/000/106/145/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/000/106/145/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/000/106/145/extra_large_pic.png"}, "nick": "The Dividend Guy", "deactivated": null, "memberSince": 2007, "isRss": true, "contributorSince": 2007, "followersCount": 31753}, "relationships": {"user": {"data": {"id": "106145", "type": "user"}}, "userBioTags": {"data": [{"id": "81321", "type": "userBioTag"}, {"id": "81331", "type": "userBioTag"}, {"id": "81341", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/the-dividend-guy", "profileUrl": "/author/the-dividend-guy", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "1748", "type": "tag", "attributes": {"slug": "mat", "name": "MAT", "company": "Mattel, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MAT"}}, {"id": "86", "type": "tag", "attributes": {"slug": "dis", "name": "DIS", "company": "The Walt Disney Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/DIS"}}, {"id": "9170", "type": "tag", "attributes": {"slug": "the-dividend-guy", "name": "The Dividend Guy", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/the-dividend-guy"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}]}