{"data": {"id": "3261325", "type": "fullArticle", "attributes": {"publishOn": "2015-06-17T06:02:56-04:00", "isLockedPro": false, "commentCount": 24, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"eric-parnell-cfa": {"id": 11716, "slug": "eric-parnell-cfa", "kind": "common", "non_theme": true}, "cfa-charter-holders": {"id": 35582, "slug": "cfa-charter-holders", "kind": "general"}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "lf-defunct-894": {"id": 894, "slug": "lf-defunct-894", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "mat": {"id": 1748, "slug": "mat", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "early-look": {"id": 460745, "slug": "early-look", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Toy Wars: Mattel Vs. Hasbro", "summary": ["When it comes to business and investing, the toy business is no fun and games.", "Lately, Hasbro has looked the winner, while Mattel appears down and out when it comes to their respective share prices.", "But knowing that the toy business is a notoriously capricious enterprise, such divergences can also bring attractive investment opportunities."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2015-06-17T07:43:50-04:00", "isModerated": false, "closestTradingDate": "2015-06-17", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 1, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>The author is long MAT.</span> <span id=\"top-business-disclosure\"> The author wrote this article themselves, and it expresses their own opinions. The author is not receiving compensation for it (other than from Seeking Alpha). The author has no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>When it comes to business and investing, the toy business is no fun and games. Mattel and Hasbro are the two largest publicly traded toy companies in the U.S. Not only do these companies wage a daily battle on the product popularity front, but as publicly-traded entities, they also vie to attract potential shareholders to acquire a stake in their business. Lately, Hasbro has looked the winner while Mattel appears down and out when it comes to their respective share prices. But knowing that the toy business is a notoriously capricious enterprise, such divergences can also bring attractive investment opportunities.</p> <p><b>Hasbro vs. Mattel: Tale Of The Tape</b></p> <p>When considering this battle of toy industry titans, we will begin by taking a closer look at the details behind these two well-known companies.</p> <p>Mattel (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a></span>) is the largest toy company in the U.S. with a 17% share of domestic sales. Well-known toy brands from the company include Barbie, Hot Wheels, Fisher Price, American Girl and Mega Blocks and RoseArt among many others.</p> <p><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343944928165028-Eric-Parnell--CFA_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343944928165028-Eric-Parnell--CFA.jpg\" hspace=\"6\" vspace=\"6\" fetchpriority=\"high\"></a></span></p> <p>Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) is the second largest toy company in the U.S. with a 10% share of domestic sales. Well-known company brands include Nerf, Monopoly, Play-Doh, Playskool, Scrabble, Trivia Pursuit and Twister.</p> <p><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-1434394506329355-Eric-Parnell--CFA_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-1434394506329355-Eric-Parnell--CFA.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p>The stock price fortunes of these two companies have taken widely divergent paths in recent years. After moving in lockstep through 2013, the companies abruptly parted ways once the calendar flipped to 2014. For while, Hasbro shares have accelerated their move to the upside in the year and a half since, Mattel's stock price has moved decisively to the downside. Given how dramatic the stock price divergence has been between these two companies in recent years, it is reasonable to consider the following. Is such a dramatic shift justified given the underlying similarities of their businesses? And if not, does this recent split present an attractive opportunity in which<span class=\"paywall-full-content invisible\"> investors can capitalize?</span></p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343945200986967-Eric-Parnell--CFA_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343945200986967-Eric-Parnell--CFA.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><b>Hasbro vs. Mattel: A Fundamental Assessment - The Quantitative</b></p> <p class=\"paywall-full-content invisible\">We will begin by conducting a fundamental assessment of these two toy industry giants. Our first step will be to explore the financial health of both companies. In particular, we want to explore whether Mattel's stock price has taken a turn lower due to any potential concerns about its ability to maintain its current operations into the long term.</p> <p class=\"paywall-full-content invisible\">Both Mattel and Hasbro are in strong health from a liquidity standpoint. As of the end of 2014, Mattel has $3.186 billion in current assets versus $1.088 billion in current liabilities for a current ratio of 2.9. When backing out inventories of $562 million, Mattel still boasts a quick ratio of 2.4. And Mattel's cash ratio is 0.9. Hasbro has a similar look and feel in these regards. Hasbro has $2.719 billion in current assets versus $1.075 billion in current liabilities for a current ratio of 2.5. After excluding inventories of $340 million, Hasbro's quick ratio stands at 2.2. And Hasbro's cash ratio is a comparable 0.8. In short, Mattel and Hasbro look almost identical from a liquidity standpoint and neither company should have any trouble at all covering their operating expenses in the coming year.</p> <p class=\"paywall-full-content invisible\">What about from a solvency standpoint? As of the end of 2014, Mattel has total liabilities of $3.772 billion against total assets of $6.722 for a very reasonable debt ratio of 0.56. As for Hasbro, it has total liabilities of $3.024 billion against total assets of $4.532 for a somewhat higher but still reasonable debt ratio of 0.66. In terms of the ability to cover the interest payments on their debt, Mattel had operating profits in 2014 of $654 million, which was down meaningfully versus recent years but still covered the interest expense of $79 million by more than 8 times over. Hasbro, on the other hand, had operating profits of $635 million, which was solidly higher from recent years that covered a modestly higher interest expense of $93 million roughly 6 times over. And when adding back into the mix the sizeable depreciation and amortization for both, we see their coverage ratios for Mattel and Hasbro move meaningfully higher to more than 11 and 9 times over, respectively. So while Hasbro does have an edge in terms of recent revenue and profit trends, Mattel is not only the larger but also arguably the healthier of these two toy giants. Once again, both companies mark well in this regard.</p> <p class=\"paywall-full-content invisible\">Now that we have confirmed the financial health of these two firms, our next step is to consider how well each is running their respective businesses.</p> <p class=\"paywall-full-content invisible\">From an asset management standpoint, we see two companies that look very similar to one another. As of the end of 2014, Mattel generated $6.023 billion in sales on $6.722 billion in total assets for a total asset turnover of 0.90. Hasbro, on the other hand, generated $4.277 billion in sales on $4.532 billion in total assets for a total asset turnover of 0.94. In terms of operating efficiency, Mattel had 67.9 days sales in inventory and 66.2 days sales in receivables versus Hasbro with a fairly comparable 73.1 days sales in inventory and 93.5 days sales in receivables. In short, both Mattel and Hasbro by the numbers are operating with comparable efficiency with if anything a slight edge to Mattel.</p> <p class=\"paywall-full-content invisible\">Thus far, both Mattel and Hasbro appear evenly matched with a slight edge to Mattel. But it is on our next set of measures in the profitability where Hasbro has been setting itself apart in recent years.</p> <p class=\"paywall-full-content invisible\">Traditionally, Mattel has been the profitability leader among the two. But this has not been the case over the last couple of years.</p> <p class=\"paywall-full-content invisible\">Over the past decade, Mattel had been generating a return on equity in the 20% to 30% range, while Hasbro's ROE resided more in the 15% to 25%. But in 2014 and thus far in 2015, Mattel's ROE has fallen to the mid-teens while Hasbro's has jumped ahead to the high 20% range.</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343945353198915-Eric-Parnell--CFA_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343945353198915-Eric-Parnell--CFA.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Mattel in recent years produced operating margins in the 10% to 18% range and profit margins in the 6% to 14% range. By comparison, Hasbro's operating margins have typically been in the 10% to 15% range and profit margins in the 7% to 10% range. But once again since the start of 2014, Mattel's operating and profit margins have fallen to the low end of its recent historical range while Hasbro's have leapt to the top.</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-1434394926089502-Eric-Parnell--CFA_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-1434394926089502-Eric-Parnell--CFA.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343949398079667-Eric-Parnell--CFA_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343949398079667-Eric-Parnell--CFA.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Thus, profitability performance has been primary driver of the wide share price divergence between these two companies since the start of 2014. For while Hasbro has been performing well from a profitability standpoint in rising to the high end of its ranges, Mattel has been struggling in the same regard with profitability readings that have fallen toward the bottom of recent historical norms.</p> <p class=\"paywall-full-content invisible\">Of course, past performance is no indicator of the future. This leads us to the next important question. Given that both companies resemble each other very closely from a financial health and asset management perspective and that the primary recent difference between Mattel and Hasbro has been from a profitability standpoint, is the current stock price advantage being enjoyed by Hasbro sustainable, or are we likely to see an eventual recoupling of these share prices at some point in the future?</p> <p class=\"paywall-full-content invisible\"><b>Hasbro vs. Mattel: A Fundamental Assessment - The Qualitative</b></p> <p class=\"paywall-full-content invisible\">In assessing these two companies, it is worthwhile to take the next step and examine these companies from a qualitative perspective.</p> <p class=\"paywall-full-content invisible\">Mattel and Hasbro both benefit from operating in an industry that has inferior good characteristics. It's not as though people need toys and will buy more of them if their income declines, but it is due to the nature of exactly whom the products are being bought that give it their essential qualities. To explain this point, I'll keep it simple and personal. If the economy goes into recession, many will end up losing their jobs or will take a cut in pay. But for those that have young children, they are likely to first forgo purchases on themselves so that they can make sure they are able to buy what their kids want for their birthdays, for Christmas or any other gift-giving holiday that might apply. And many will do so even if it means taking on some debt to do it. Moreover, if times are really tight, it's a lot more manageable to buy a set of toys than the next hot game system that may cost many hundreds of dollars. For this reason, toys enjoy a unique recession protected quality.</p> <p class=\"paywall-full-content invisible\">Mattel and Hasbro also both enjoy reasonable competitive moat versus other competition. These are the two largest publicly traded companies in what is otherwise a widely fragmented global toy industry. Lego is the third major player, but they are privately held. Given that the industry deals with fairly capital intensive products in toys that require a lot of space on the store shelves at a limited number of stores like Wal-Mart (<a href=\"https://seekingalpha.com/symbol/WMT\" title=\"Walmart Inc.\">WMT</a>), Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) and Toys R Us, it would be fairly difficult for a major new entrant to immediately make its way into the market and quickly steal market share. As a result, when it comes to selling toys, it is primarily the three big players pitted against each other with Mattel and Hasbro the most directly head to head in the competitive trenches.</p> <p class=\"paywall-full-content invisible\">But with this moat idea in mind, it is worthwhile to take a quick aside to make sure that the toy industry is not facing any sort of obsolescence. After all, I know Olympia once was considered the premier typewriter and the Concord stagecoach was once the finest way to travel, but such great advantages only get you so far in a creatively destructive world.</p> <p class=\"paywall-full-content invisible\"><b>Considering The Competitive Threat From Digital Media &amp; Tablets</b></p> <p class=\"paywall-full-content invisible\">What about the competitive threat to Mattel and Hasbro from outside forces such as digital media and tablets? Will this not be the transformation that will ultimately bring down the traditional toy business. Indeed, the proliferation of media, tablets and apps has taken its measurable bite out of the toy business. But to assume that the toy makers will simply fade away under this competitive threat underestimates their ability to adapt. This is a threat that the toy companies have faced in the past, and they will likely face it again in the future. But if anything it provides the opportunity to become even more integrated with their core consumers than it ever has in the past.</p> <p class=\"paywall-full-content invisible\">To expand on my point about the potential advantages derived from the competitive threat posed by digital media and tablets, I will draw upon my own experience as a father of two young boys. They both regularly attend birthday parties (I went to two with my older son this past weekend alone), so I have had the opportunity through my observations as a parent to gather a meaningful sample size of information as to the toys that children are interested in today that I believe is at least reasonably representative of the broader child population. And it's not as though I'm trying to understand the application and demand of some high precision instrument that I've never seen before, as these are toys not unlike what I used to play with when I was a kid.</p> <p class=\"paywall-full-content invisible\">The following are my observations and conclusions. Yes, the kids like the digital media and the tablets. But once they get into a particular game, they want the merchandise to go along with it. Thus, they end up going to the toy store to collect the toys that go along with the game. I asked my older son yesterday which he liked better, the app for the Lego game \"Calling All Mixels\" that he's currently into right now or the toys that go along with the game. His response was the toys, because you can play with them. The game on the tablet sets the stage, whereas the toys let the kids carry out the make believe. Taking this one step further, the apps and the toy makers are increasingly integrating together. Anyone who has the Skylanders game in their house knows what I'm talking about. For it's not the Wii game system or the Skylander game and portal where the money is being spent, as this is simply the gateway into the game. Instead, it is the countless number of toys that are systematically introduced with each new incarnation of the game where the dollars are flowing.</p> <p class=\"paywall-full-content invisible\">So while digital media and tablets are cutting into the business, the toy makers are already adapting in response and have the opportunity to benefit in the long run once they fully figure it out. Toy makers faced the same threat with the advent of the personal computer and video game systems over the past several decades. They figured it out then and they will figure out again in the future when the next game-changing technology comes along.</p> <p class=\"paywall-full-content invisible\">One final anecdotal example to finish this point. In 2011, we purchased our older son a Leapster Explorer made by LeapFrog Entertainment (LF). He liked it so much that the next year in 2012 we purchased him the new LeapPad. And he liked that too. But that was nearly three years ago now. Last Christmas, my younger son had reached the age when we first bought our older son his Leapster. At first, we planned on buying him his own newest version of the game system. But after looking into it, we came to realize that we could now download educational and fun apps that were just as good if not better with a vastly greater variety on our old iPad from Apple (<a href=\"https://seekingalpha.com/symbol/AAPL\" title=\"Apple Inc.\">AAPL</a>) and save a lot of money to spend elsewhere for Christmas in the process. If our own personal evolution along those that we have heard from others are at all representative, it provides a good reason why the likes of Mattel and Hasbro are better to stay out of the digital product business and stick with the toys that go along with the digital media instead.</p> <p class=\"paywall-full-content invisible\"><b>Hasbro vs. Mattel: Identifying The Opportunity Set</b></p> <p class=\"paywall-full-content invisible\">Thus far, we have determined that both Mattel and Hasbro are financially sound companies with similar operating characteristics. Given their competitive positions in the toy industry and their ability to adapt to the digital media threat, both are likely to survive if not thrive into the foreseeable future, so we can effectively rule out the potential of both companies tumbling to zero the way some dot.com and financial companies have been known to do on occasion since the turn of the millennium.</p> <p class=\"paywall-full-content invisible\">This leads us to the critical question in the toy wars. Yes, Hasbro has vaulted ahead of industry leader Mattel recently from a profitability standpoint. And the share price performance of these two companies certainly reflects as much. But should we expect Hasbro to maintain this competitive advantage over Mattel into the long term?</p> <p class=\"paywall-full-content invisible\">To answer this question, we must first begin with the most basic principle associated with the toy business. Kids are the primary market for toy companies. And kids' tastes are about as capricious as they get. For what they like today can be something that they are completely indifferent about a week from now. One will purchase gifts for a 7-year old three months in advance of a holiday at their own peril, for the toys and games they are interested in will likely turnover six or seven times and recycle back through two or three times along the way before the big day finally arrives.</p> <p class=\"paywall-full-content invisible\">Why is this capriciousness so important? Because the toy business is notoriously cyclical for this very reason. A company could have the hottest of hot toys one season only to find that the kids have moved on and are now poking fun at this very same toy six months later. In its place will be some new toy that kids cannot do without. And more often than not it is a coveted item that the toy companies and industry experts in their finely tailored suits and ivory towers never saw coming.</p> <p class=\"paywall-full-content invisible\">Right now, Hasbro is the toast of the toy industry. It is making impressive inroads into digital media and boasts an appealing brand line-up that includes the Disney Princesses, the white hot Frozen franchise and the Marvel, Star Wars and Transformers merchandise. All of these factors have helped propel the company to the strong operating performance they have recently enjoyed.</p> <p class=\"paywall-full-content invisible\">Conversely, Mattel has been struggling. The company's product line-up including most notably its Barbie franchise has been gathering some dust and it has repeatedly come up on the short end on some key licensing agreement deals. And its recently poor operating performance that has seen margins tumble to the low end of their historical range has taken a bite out of free cash flow. And as the market should, it has rewarded this subpar performance by cutting its share price in half since the start of 2014.</p> <p class=\"paywall-full-content invisible\">Hasbro is in and Mattel is out. But this is just the latest spin in the history of the capricious toy business. For one does not have to venture far back into history to find periods when Mattel was the toast of Wall Street and Hasbro was the dog for similar reasons. This is simply the nature of the toy industry cycle. Will Hasbro maintain its recently blazing hot run well into the future? Perhaps, but chances are something new is going to come along soon that could turn the game upside down yet again. Will Mattel now remain perpetually stuck in the toy industry dumps? Maybe, but probably not, as it assumes that the company will do nothing to adapt.</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343949633465762-Eric-Parnell--CFA_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343949633465762-Eric-Parnell--CFA.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">What type of catalysts do we then look for in a company like Mattel to give us an indication that the tide may be starting to turn? First, we need to see that they get that they have a problem. And we can give them a check on this first point, as they recently fired now former CEO Bryan Stockton in recognition of this point. Second, the new management team needs to provide a turnaround plan. While the fact that the new leadership team has come from within including former board member and now CEO Christopher Sinclair has raised some understandable skepticism, they have sought to move quickly with a turnaround strategy that includes the types of digital media integration and product innovations is likely to define the next step in the evolution of the toy business. The third and most critical step is how well the company is able to execute its turnaround strategy. While this remains to be seen, a key advantage for Mattel is that it has the size, scale and cash flow generation to make it happen.</p> <p class=\"paywall-full-content invisible\"><b>A Case For Convergence</b></p> <p class=\"paywall-full-content invisible\">Hasbro has enjoyed better profitability than Mattel since the start of 2014. And Hasbro currently has the better product lineup than Mattel. But do these differentiations justify the roughly 80 percentage point differential in returns between the shares of these two companies in the very same toy industry since the start of last year? Almost certainly not, particularly given the structural similarities that continue to exist today between these two companies coupled with how cyclical and swift consumer preferences always change in the toy industry.</p> <p class=\"paywall-full-content invisible\">From a regression to the mean standpoint, Hasbro is set up to fall while Mattel is set up to rise. Both companies were moving in lockstep with the S&amp;P 500 Index from late 2012 through the start of 2014. Since that time, Hasbro has outperformed the S&amp;P 500 Index (<a href=\"https://seekingalpha.com/symbol/SPY\" title=\"SPDR® S&amp;P 500 ETF Trust\">SPY</a>) by a remarkable 56 percentage points, all of which has been accumulated since the start of the year. At the same time, Mattel has underperformed the S&amp;P 500 Index by an equally remarkable 70 percentage points, all of which once again has been accumulated since the start of last year. If Hasbro was rapidly gobbling up market share and Mattel was headed on its way to insolvency, perhaps such a divergence would make sense. But such is not at all the case today, as it instead an exaggeration of the traditional toy making cycle between two major competitors.</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343951434281912-Eric-Parnell--CFA_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343951434281912-Eric-Parnell--CFA.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">From a valuation standpoint, Hasbro also has a tougher road to travel going forward than Mattel. Yes, Hasbro has recently performed well, but the market is more than giving them credit for it. For example, Hasbro's price-to-earnings ratio at 22.8 is now running at the high end of its range including a 34% premium to its ten-year historical average. At first glance, it appears that Mattel may also be richly priced with a price-to-earnings ratio of 19.7 that is also a 30% premium to its ten-year average. But here is the key difference. Mattel's price-to-earnings ratio is based on net profits that have been more than cut in half since the start of 2014. Conversely, Hasbro's price-to-earnings ratio is based on net profits that have recently jumped to all-time highs. In short, Mattel has a much greater margin of error underlying their P/E ratio than Hasbro.</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343951645274546-Eric-Parnell--CFA_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343951645274546-Eric-Parnell--CFA.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Taking this one step further, it is worthwhile to examine Mattel and Hasbro using other valuation metrics. From a price-to-sales perspective, Hasbro currently has a price-to-sales ratio of 2.2, which is more than 60% above its historical average and well beyond the high end of its typical range. By comparison, Mattel has a price-to-sales ratio of 1.5, which is in the middle of its historical range and represents a 6% discount to its historical average.</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343951831107602-Eric-Parnell--CFA_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343951831107602-Eric-Parnell--CFA.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Another notable valuation reading is the price-to-book value ratio for both companies. Hasbro currently has a price-to-book ratio of 6.3 that is well above its historical range and nearly double its ten-year average. Mattel, on the other hand, has a price-to-book ratio of 3.3 that is once again right in the middle of its historical range and represents a 6% discount to its historical average.</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343951959005153-Eric-Parnell--CFA_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-14343951959005153-Eric-Parnell--CFA.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">What is notable in regards to these price-to-sales and price-to-book measures is that it was not that long ago in 2013 that Mattel stood on the very same perch for these readings that Hasbro stands today. And we have seen the punishment that Mattel shareholders have endured in the time since. This does not mean that Hasbro will have the same experience going forward, but what it does emphasize is that when the share price tide turns to the downside, lofty valuations can add significant salt to the wound.</p> <p class=\"paywall-full-content invisible\">Moving beyond valuation, Mattel also has an edge from an intangible standpoint. For example, if anyone is likely to get taken over right now, it is Mattel. If anyone is likely to be acquiring right now, it is Hasbro. If an activist is looking for a company to go and get involved, Mattel is a likely candidate, not Hasbro. And if any management team should have a sense of urgency to execute, it is Mattel's over Hasbro's.</p> <p class=\"paywall-full-content invisible\">Last but not least, Mattel has an advantage over Hasbro from a macro perspective. The U.S. stock market is currently in the seventh year of the third longest bull market in history. And stocks are accomplishing this feat in a post-crisis economy that has been lackluster at best. At some point, the bull market is going to end and a new bear market is going to begin. And while both Hasbro and Mattel by their existence as publicly traded common stocks are exposed to the systemic risk of the broader market, Hasbro due to its recent share price spurt and now lofty valuation is now facing far greater risk to the downside than Mattel whose shares have already shed as much as -50% over the last year and a half. In short, Hasbro has a lot more air to be taken out of it than Mattel does from a market risk standpoint at this stage.</p> <p class=\"paywall-full-content invisible\"><b>Bottom Line For The Next Battle In The Toy Wars</b></p> <p class=\"paywall-full-content invisible\"><b><em></em></b><b><span><a href=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-1434395221612686-Eric-Parnell--CFA_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/6/15/403065-1434395221612686-Eric-Parnell--CFA.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></b></p> <p class=\"paywall-full-content invisible\">Hasbro has been dominating Mattel in the toy wars over the last couple of years. But despite Hasbro's recent success and Mattel's unfolding turnaround efforts, we have arrived at a juncture where the risk-reward is now tilted far more in favor of Mattel and against Hasbro. And while this divergence could certainly continue into the short-term, gravity has a uncanny way bringing things back together before it's all said and done. And by these many measures, Mattel looks well positioned to rise while Hasbro appears at risk to fall as we move into the latest battle of the never ending toy wars.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\"><b>Disclosure</b>: This article is for information purposes only. There are risks involved with investing including loss of principal. Gerring Capital Partners makes no explicit or implicit guarantee with respect to performance or the outcome of any investment or projections made. There is no guarantee that the goals of the strategies discussed by Gerring Capital Partners will be met.</p>", "twitContent": "$HAS $MAT - Toy Wars: Mattel Vs. Hasbro. https://seekingalpha.com/article/3261325-toy-wars-mattel-vs-hasbro?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "21992", "type": "author"}}, "sentiments": {"data": [{"id": "157154", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}, {"id": "1748", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "894", "type": "tag"}]}, "otherTags": {"data": [{"id": "11716", "type": "tag"}, {"id": "35582", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "460745", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/3261325-toy-wars-mattel-vs-hasbro", "canonical": "https://seekingalpha.com/article/3261325-toy-wars-mattel-vs-hasbro", "uriImage": "https://static.seekingalpha.com/uploads/2015/6/15/403065-14343944928165028-Eric-Parnell--CFA_origin.jpg", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2015/6/15/403065-14343944928165028-Eric-Parnell--CFA_origin.jpg"}}}, "included": [{"id": "21992", "type": "author", "attributes": {"company": null, "slug": "eric-parnell-cfa", "userId": 403065, "tagId": 11716, "bio": "<p>Chief Market Strategist, <a href=\"https://greatvalleyadvisors.com/\">Great Valley Advisor Group</a></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/000/403/065/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/000/403/065/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/000/403/065/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/000/403/065/extra_large_pic.png"}, "nick": "Eric Parnell, CFA", "deactivated": null, "memberSince": 2009, "isRss": false, "contributorSince": 2008, "followersCount": 32174}, "relationships": {"user": {"data": {"id": "403065", "type": "user"}}, "userBioTags": {"data": [{"id": "17161", "type": "userBioTag"}, {"id": "17171", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/eric-parnell-cfa", "profileUrl": "/author/eric-parnell-cfa", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "1748", "type": "tag", "attributes": {"slug": "mat", "name": "MAT", "company": "Mattel, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MAT"}}, {"id": "894", "type": "tag", "attributes": {"slug": "lf-defunct-894", "name": "LF", "company": "LeapFrog Enterprises Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": true, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/LF-DEFUNCT-894"}}, {"id": "11716", "type": "tag", "attributes": {"slug": "eric-parnell-cfa", "name": "Eric Parnell, CFA", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/eric-parnell-cfa"}}, {"id": "35582", "type": "tag", "attributes": {"slug": "cfa-charter-holders", "name": "CFA charter-holders", "company": null, "tagKind": "Tags::SpecialType"}, "links": {"self": "/cfa/articles"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "460745", "type": "tag", "attributes": {"slug": "early-look", "name": "Early Look", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/early-look"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "157154", "type": "sentiment", "attributes": {"articleId": 3261325, "type": "bullish", "createdAt": "2015-06-17T06:02:56.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "3261325", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}