{"data": {"id": "3573586", "type": "fullArticle", "attributes": {"publishOn": "2015-10-15T04:26:39-04:00", "isLockedPro": false, "commentCount": 2, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"valuentum": {"id": 34650, "slug": "valuentum", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Cash-Rich Hasbro Continues To Benefit From Transition", "summary": ["Hasbro boasts strong licensing relationships with some powerful brands, and the firm has shaken off the stigma of its roots as a physical toy company.", "Though the trajectory of the company's fundamentals is decidedly positive, the timing of movie releases and the corresponding product lines can create inconsistent quarterly results.", "Hasbro has a fantastic dividend track record, and its outlook for dividend growth is very positive. We don't think things could be going better for the company.", "Let's take a look at the company's investment considerations as we walk through the valuation process and derive a fair value estimate for shares."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2015-10-15T04:26:39-04:00", "isModerated": false, "closestTradingDate": "2015-10-15", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />HAS is included in the Dividend Growth Newsletter portfolio.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><em>By Kyle VanWambeke</em></p> <p><em><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/10/12/933684-14446841796492887-Valuentum_origin.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/10/12/933684-14446841796492887-Valuentum.png\" hspace=\"6\" vspace=\"6\" fetchpriority=\"high\"></a></span></em></p> <p>Licensing giant <a href=\"https://files.shareholder.com/downloads/HAS/849835857x0x819559/8A09F66A-4137-45A9-88BA-C16F08E1AF90/Annual_Report_Website_FINAL.pdf\" rel=\"nofollow\">Hasbro</a> (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) continues to transition to an organization delivering global brand experiences, expanding from its roots as a physical toy manufacturer. Perhaps the envy of the toy-making business, Hasbro has a lucrative forward agreement with Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>) to manufacture the <em>Frozen</em> character figures, which continue to be extremely popular with young boys and girls alike. Making the action figures for upcoming blockbusters such as Star Wars, Transformers, and other popular movies offers upside potential in coming years, and strong licensing relationships continue to push the firm's margins ever-higher.</p> <p>Though arguably fundamentals could not be going better for the firm, the timing of big blockbuster movie releases has been a <a href=\"https://files.shareholder.com/downloads/HAS/849835857x0x839931/6BAA0F52-14DA-4F1B-AD07-175CD03974BB/Hasbro_Q2_2015_Earnings_Management_Remarks.pdf\" rel=\"nofollow\">challenge</a> for Hasbro. When movies are released, toy revenues for a given movie's merchandise rises significantly due to the promotion and publicity of the brand. Sometimes unforgiving, investors should be cognizant that quarterly performance could be lumpy and just part of the business. The physical toy industry continues to experience declining sales in developed countries, but Hasbro's licensing focus has mitigated this risk to a degree.</p> <p>Despite lagging toy sales and the potential for inconsistent results, <a href=\"https://files.shareholder.com/downloads/HAS/849835857x0x478557/48615F4C-B665-40EC-B5AC-447FAC08A38A/Hasbro_Investor_Presentation.pdf\\\" rel=\"nofollow\">Hasbro</a> remains a cash cow. The company continues to target operating cash flow of $500+ million each year, and this should help fund a consistent and growing dividend payout, which has advanced at an 18% CAGR during the past 10 years (its current yield is ~2.5%). Hasbro is currently included in the Dividend Growth Newsletter portfolio, and we assign it a rating of GOOD for both dividend safety and dividend growth potential.</p> <p>In this piece, let's take an in-depth look at Hasbro and derive a fair value estimate for shares.</p> <p><b><strong>Hasbro</strong></b><strong>'s</strong> <strong>Investment Considerations</strong></p> <p><img src=\"https://static.seekingalpha.com/uploads/2015/8/20/933684-14400444729546463-Valuentum.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p><strong>Investment Highlights</strong></p> <p>• Hasbro's products include toys/games, television programming, motion pictures and digital gaming. The firm owns well-known brands such as<span class=\"paywall-full-content invisible\"> Transformers, Nerf, Playskool, My Little Pony, G.I. Joe, Magic: The Gathering, and Monopoly. The company was founded in 1923.</span></p> <p class=\"paywall-full-content invisible\">• Though concerns over the demise of physical toys may not be completely unfounded in this digital age, Hasbro is less a toy company than it is a licensing firm. During 2014, high-margin entertainment and licensing revenue advanced 15%, while this segment's operating profit leapt 30%+.</p> <p class=\"paywall-full-content invisible\">• Hasbro is focused on re-igniting its world-class portfolio of brands. The company is targeting long-term revenue CAGR of 5%, operating profit to exceed revenue expansion, and operating cash flow to average roughly $500 million annually. The firm recently announced intentions to buy back a significant amount of stock.</p> <p class=\"paywall-full-content invisible\">• Hasbro's new strategic merchandising relationship with Disney Consumer Products for the Disney Princess and Frozen properties is a huge win, and we expect the company to benefit from the relationship for years to come.</p> <p class=\"paywall-full-content invisible\">• We're big fans of Hasbro's dividend growth potential. The company has been paying dividends since 1977, so its track record is fantastic. Dividend increases are on the horizon.</p> <p class=\"paywall-full-content invisible\"><strong>Business Quality</strong></p> <p class=\"paywall-full-content invisible\"><em>Note: Valuentum places considerable emphasis on a firm-specific discounted cash-flow based valuation process for each company it covers, the process shown later in this article. In the graph immediately below, we offer insight into a relative valuation assessment of the company using comparable companies, preferably direct competitors or industry peers. When such firms are not available or in existence, however, we use entities with similar revenue models or are tied to similar trends to offer as much insight as possible. For example, in the case of Hasbro, we use companies that are tied to leisure activities and exposed to changes in consumer discretionary spending to show how much investors may be willing to pay for these types of companies on a forward P/E and PEG basis.</em></p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2015/8/20/933684-14400444939664853-Valuentum.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><strong>Economic Profit Analysis</strong></p> <p class=\"paywall-full-content invisible\">In our opinion, the best measure of a firm's ability to create value for shareholders is expressed by comparing its return on invested capital with its weighted average cost of capital. The gap or difference between ROIC and WACC is called the firm's economic profit spread. Hasbro's 3-year historical return on invested capital (without goodwill) is 32.4%, which is above the estimate of its cost of capital of 9.9%. As such, we assign the firm a ValueCreation™ rating of EXCELLENT.</p> <p class=\"paywall-full-content invisible\">In the chart below, we show the probable path of ROIC in the years ahead based on the estimated volatility of key drivers behind the measure. The solid grey line reflects the most likely outcome, in our opinion, and represents the scenario that results in our fair value estimate. Hasbro is a strong economic profit generator.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2015/8/20/933684-14400445045234258-Valuentum.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2015/8/20/933684-1440044939044846-Valuentum.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><strong>Cash Flow Analysis</strong></p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2015/8/20/933684-14400445126298099-Valuentum.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Firms that generate a free cash flow margin (free cash flow divided by total revenue) above 5% are usually considered cash cows. Hasbro's free cash flow margin has averaged about 10.2% during the past 3 years. As such, we think the firm's cash flow generation is relatively STRONG.</p> <p class=\"paywall-full-content invisible\">The free cash flow measure shown above is derived by taking cash flow from operations less capital expenditures and differs from enterprise free cash flow (FCFF), which we use in deriving our fair value estimate for the company. At Hasbro, cash flow from operations increased about 0% from levels registered two years ago, while capital expenditures expanded about 1% over the same time period.</p> <p class=\"paywall-full-content invisible\"><strong>Valuation Analysis</strong></p> <p class=\"paywall-full-content invisible\">We're not playing any games with this portion of our analysis. Below we derive a fair value estimate for shares, the most important part of the valuation process.</p> <p class=\"paywall-full-content invisible\">Our discounted cash flow model indicates that Hasbro's shares are worth between $57-$85 each. <strong>Shares are currently trading at ~$74, in the upper half of our fair value range. This indicates that we feel there is more downside risk than upside potential associated with shares at this time, but we're still huge fans of the company on a fundamental basis, and it's dividend is certainly one that we like a lot.</strong></p> <p class=\"paywall-full-content invisible\">The margin of safety around our fair value estimate is derived from the historical volatility of key valuation drivers. The estimated fair value of $71 per share represents a price-to-earnings (P/E) ratio of about 22.2 times last year's earnings and an implied EV/EBITDA multiple of about 10.6 times last year's EBITDA.</p> <p class=\"paywall-full-content invisible\">Our model reflects a compound annual revenue growth rate of 5.4% during the next five years, a pace that is higher than the firm's 3-year historical compound annual growth rate of -0.1%. Our model reflects a 5-year projected average operating margin of 16.3%, which is above Hasbro's trailing 3-year average.</p> <p class=\"paywall-full-content invisible\">Beyond year 5, we assume free cash flow will grow at an annual rate of 2.8% for the next 15 years and 3% in perpetuity. For Hasbro, we use a 9.9% weighted average cost of capital to discount future free cash flows.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2015/8/20/933684-14400445246733413-Valuentum.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><em><img src=\"https://static.seekingalpha.com/uploads/2015/8/20/933684-14400445334759283-Valuentum.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></em></p> <p class=\"paywall-full-content invisible\"><em><em><span><a href=\"https://static.seekingalpha.com/uploads/2015/8/20/933684-14400445433325377-Valuentum_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/8/20/933684-14400445433325377-Valuentum.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></em></em></p> <p class=\"paywall-full-content invisible\"><strong>Margin of Safety Analysis</strong></p> <p class=\"paywall-full-content invisible\"><strong><img src=\"https://static.seekingalpha.com/uploads/2015/8/20/933684-14400445516989453-Valuentum.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></strong></p> <p class=\"paywall-full-content invisible\">Although we estimate the firm's fair value at about $71 per share, every company has a range of probable fair values that's created by the uncertainty of key valuation drivers (like future revenue or earnings, for example). After all, if the future was known with certainty, we wouldn't see much volatility in the markets as stocks would trade precisely at their known fair values.</p> <p class=\"paywall-full-content invisible\">In the graph above, we show this probable range of fair values for Hasbro. We think the firm is attractive below $57 per share (the green line), but quite expensive above $85 per share (the red line). The prices that fall along the yellow line, which includes our fair value estimate, represent a reasonable valuation for the firm, in our opinion.</p> <p class=\"paywall-full-content invisible\"><strong>Future Path of Fair Value</strong></p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2015/8/20/933684-1440044562345493-Valuentum.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">We estimate Hasbro's fair value at this point in time to be about $71 per share. As time passes, however, companies generate cash flow and pay out cash to shareholders in the form of dividends. The chart above compares the firm's current share price with the path of Hasbro's expected equity value per share over the next three years, assuming our long-term projections prove accurate.</p> <p class=\"paywall-full-content invisible\">The range between the resulting downside fair value and upside fair value in Year 3 represents our best estimate of the value of the firm's shares three years hence. This range of potential outcomes is also subject to change over time, should our views on the firm's future cash flow potential change.</p> <p class=\"paywall-full-content invisible\">The expected fair value of $91 per share in Year 3 represents our existing fair value per share of $71 increased at an annual rate of the firm's cost of equity less its dividend yield. The upside and downside ranges are derived in the same way, but from the upper and lower bounds of our fair value estimate range.</p> <p class=\"paywall-full-content invisible\"><strong>Wrapping Things Up</strong></p> <p class=\"paywall-full-content invisible\">Hasbro has more than its share of investment merits.</p> <p class=\"paywall-full-content invisible\">We think the firm is a solid dividend growth idea; its dividend has a strong track record and good outlook. The transition away from a traditional toy and game manufacturer has proved to be a great move for the company, as it has been able to set itself apart from its competitors with its extremely profitable licensing agreements.</p> <p class=\"paywall-full-content invisible\">As savvy investors know, however, timing is an important part of investing, and we'd prefer shares trading at a discount to intrinsic value for \"new money.\" In any case, we're still riding high in the Dividend Growth Newsletter portfolio with shares, letting this big winner run. Hasbro currently registers a 6 on the Valuentum Buying Index.</p> <p class=\"paywall-full-content invisible\"><strong>Performance</strong></p> <p class=\"paywall-full-content invisible\">In the spirit of transparency, we reveal the performance of the Valuentum Buying Index, our stock selection methodology, in a case study of the ratings spanning September 2013 through September 2014. Higher-rated entities (6-10) have been shown to outperform lower-rated entities (1-5). Past results are not a guarantee of future performance. Thank you for reading!</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2015/8/24/saupload_933684-14338051297578683-Valuentum.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\"><em>This article or report and any links within are for information purposes only and should not be considered a solicitation to buy or sell any security. Valuentum is not responsible for any errors or omissions or for results obtained from the use of this article and accepts no liability for how readers may choose to utilize the content. Assumptions, opinions, and estimates are based on our judgment as of the date of the article and are subject to change without notice. For more information about Valuentum and the products and services it offers, please contact us at</em> <em>info@valuentum.com</em><em>.</em></p>", "twitContent": "$HAS - Cash-Rich Hasbro Continues To Benefit From Transition. https://seekingalpha.com/article/3573586-cash-rich-hasbro-continues-to-benefit-from-transition?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "24491", "type": "author"}}, "sentiments": {"data": []}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "34650", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/3573586-cash-rich-hasbro-continues-to-benefit-from-transition", "canonical": "https://seekingalpha.com/article/3573586-cash-rich-hasbro-continues-to-benefit-from-transition", "uriImage": "https://static.seekingalpha.com/uploads/2015/10/12/933684-14446841796492887-Valuentum_origin.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2015/10/12/933684-14446841796492887-Valuentum_origin.png"}}}, "included": [{"id": "24491", "type": "author", "attributes": {"company": null, "slug": "valuentum", "userId": 933684, "tagId": 34650, "bio": "<p>We offer subscriptions and exclusive newsletters. Visit our website at www.valuentum.com for more information. Valuentum is an independent investment research publisher, offering premium equity reports and dividend reports, as well as commentary across all sectors/companies, a Best Ideas Newsletter (spanning market caps, asset classes), a Dividend Growth Newsletter, modeling tools/products, and more. Valuentum is based in the Chicagoland area. Valuentum is not a money manager, broker, or financial advisor. Valuentum is a publisher of financial information. Please read our Disclaimer that applies to all articles published on Seeking Alpha: https://www.valuentum.com/categories/20110613. Follow us on Twitter: @Valuentum</p>", "image": {"small": "https://static.seekingalpha.com/images/users_profile/000/933/684/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/000/933/684/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/000/933/684/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/000/933/684/extra_large_pic.png"}, "nick": "Valuentum", "deactivated": null, "memberSince": 2011, "isRss": false, "contributorSince": 2011, "followersCount": 17929}, "relationships": {"user": {"data": {"id": "933684", "type": "user"}}, "userBioTags": {"data": [{"id": "956533", "type": "userBioTag"}, {"id": "956534", "type": "userBioTag"}, {"id": "956535", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/valuentum", "profileUrl": "/author/valuentum", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "34650", "type": "tag", "attributes": {"slug": "valuentum", "name": "Valuentum", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/valuentum"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}]}