{"data": {"id": "4236035", "type": "fullArticle", "attributes": {"publishOn": "2019-01-28T13:54:24-05:00", "isLockedPro": false, "commentCount": 6, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"industrious-investor": {"id": 572286, "slug": "industrious-investor", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "ati": {"id": 2607, "slug": "ati", "kind": "common", "non_theme": true}, "industrial-goods": {"id": 17913, "slug": "industrial-goods", "kind": "common", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "metal-fabrication": {"id": 17927, "slug": "metal-fabrication", "kind": "common", "non_theme": true}, "materials": {"id": 15, "slug": "materials", "kind": "sector", "path": "/stock-ideas/basic-materials", "title": "Basic Materials", "sasource": "theme_breadcrumb"}}, "title": "Allegheny Technologies: Still Room To Grow", "summary": ["Allegheny's share price has done very well since the last time I wrote about it.", "Look at how each of the business segments has been performing since two years ago.", "Point out growth potential in many of the Allegheny's business ventures.", "Addressing some of the near term problems facing Allegheny Technologies.", "Go into detail about the company returning money back to shareholders."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2019-01-28T13:54:24-05:00", "isModerated": false, "closestTradingDate": "2019-01-28", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 4, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long ATI.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><strong>Introduction &amp; Stock Performance</strong></p> <p>Since I last wrote about Allegheny Technologies (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ATI\" title=\"ATI Inc.\">ATI</a></span>), the stock has done very well. Last time I wrote about the stock it was trading at $16.99 a share it currently trades at $26.63 a share that is a 53% gain over the past two years. During this time the S&amp;P 500 has had a return of about 17%, so ATI has significantly outperformed the broader stock market.</p> <p>In this article, I will be looking at if the company is still a good buy, and if it can continue this phenomenal growth for the coming years. First, I will take a look at each segment of the business, and see how profits have changed over the past two years. Then I will talk about what catalysts the business has moving forward. Then I will go into detail about some of the headwinds facing the company in the next couple of years. Throughout this article I will be referencing the <a href=\"https://seekingalpha.com/symbol/ATI/earnings\">earning call transcripts</a> from the past year.</p> <p><strong>Taking a Look at Segment Performance</strong></p> <p>The first segment to look at is the High-Performance Materials segment of ATI. In 2016 this segment performed profitably, but over the past two years you can see that the profit from this segment has more than doubled. This growth is very significant and reading through the earnings calls it is easy to see that management has plans to push this segments profitability even higher in coming years.</p> <p> <img src=\"https://static.seekingalpha.com/uploads/2019/1/27/48032762-1548637081943553.png\" data-width=\"639\" data-height=\"295\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></p> <p>In 2016 when I first wrote about ATI, the Flat Rolled Products segment of the company was noticeably the least exciting part of the company when it came to profits. However, over the past two years management has successfully turned this segment around in a big way. This segment, which had significant losses all throughout 2016, is now a profitable part of ATI’s<span class=\"paywall-full-content invisible\"> business. It now contributes nearly 100 million dollars a year to the company's in profits. This success is a clear indicator of how managements choice to transition the segment away from commodity products, and into higher value products has really paid off for shareholders.</span></p> <p class=\"paywall-full-content invisible\"> <img src=\"https://static.seekingalpha.com/uploads/2019/1/27/48032762-15486370615162287.png\" data-width=\"537\" data-height=\"334\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><strong>Future Growth Opportunities</strong></p> <p class=\"paywall-full-content invisible\">ATI has many growth opportunities ahead of it, but there are a few that I want to single out and discuss. The first opportunity has been quoted in nearly every earnings report I have read over the past two years, jet engines, in every report you can see how they are projecting this to grow. Over the next couple years, the next generation jet engine market is expected to continue to grow at a decent pace, and then it seems to level out to a slower growth rate. This will provide a solid increase in profits for the HPM segment of ATI’s business, and will be a solid earner for years to come.</p> <p class=\"paywall-full-content invisible\">The second opportunity that deserves mentioning is the company’s titanium investment casting business, which throughout 2018 has not been profitable. However, this is predicted to change going into 2019 and beyond. This segment should provide a very positive impact for the company given that titanium investment casting is a very high value-added manufacturing operation, and once it is running full steam it should allow the company to make significant profits off this new branch of their business.</p> <p class=\"paywall-full-content invisible\">The last thing that needs mentioned is their recent acquisition of Addaero an additive manufacturing company that produces parts needed in aerospace production. What makes this a fantastic acquisition is that ATI already creates powdered alloys that are used in the additive manufacturing process. This vertical integration should give them a significant advantage in this sector. This is also great moving forward as 3-D printing technology has several advantages to traditional manufacturing methods when producing certain parts in aerospace applications. This acquisition will allow Alleghany to acquire more customers in the aerospace industry and expand into even more product lines that should have great margins.</p> <p class=\"paywall-full-content invisible\"><strong>Headwinds Facing ATI</strong></p> <p class=\"paywall-full-content invisible\">There are a few things however that could cause ATI to struggle in the next few years. The one that is most evident is how trade policy can affect their business. The current United States trade policy has complicated some of ATI’s overseas deals that were going to positively impact profit at the company. Management is actively seeking exemption status from the tariffs as they affect them and seems confident that they can continue to grow profits regardless of trade policy. However, the current trade climate can significantly impact results moving forward.</p> <p class=\"paywall-full-content invisible\">The other headwind that needs mentioned is ATI’s pension plan. The company still has a way to go before this is fully funded. Although the money to fund the pension plan seems to be within ATI’s means to pay. Management has mention that it probably will not be settled completely until sometime early in the next decade. This means that significant amounts of the companies’ profits will have to go into the pension plan over the next few years opposed to going into new investments or back into shareholders pockets. The company is making the right moves to fix this issue, but this is a very large liability to the company moving forward in the next few years.</p> <p class=\"paywall-full-content invisible\"><strong>Future Dividends, and Share Buy Backs</strong></p> <p class=\"paywall-full-content invisible\">The next thing I want to point out is a quote from the Q2 2018 earnings call from Richard Harshman.</p> <p class=\"paywall-full-content invisible\"><em>“Finally, as you heard from Pat DeCourcy, ATI continues to anticipate solid free cash flow growth in 2018. We remain focused on balance sheet repair and will responsibly deploy cash to further reduce financial risk and to continue to lay the foundation for long-term profitable growth, as well as ultimately returning cash to our shareholders.”</em></p> <p class=\"paywall-full-content invisible\">This quote tells you exactly what Alleghany has in mind for the future. The company clearly has a desire to return money back to shareholders. Also, more importantly because of the steps they have taken over the past few years they should have more than enough free cash flow to start returning the money to shareholders. Then if this is not proof enough that it’s the company’s intention to start ether buying back shares or paying a dividend here is another quote from Patrick DeCourcy during the Q3 2018 earnings call.</p> <p class=\"paywall-full-content invisible\"><em>“We can turn then to measures to improve return to shareholders beyond that balance sheet improvement question and those who obviously be subject to discussion with Bob and the rest of the Board, here at ATI, but I think there would be a consideration of dividend potentially and then, potentially a buyback with that would be based on whether or not we think the stock is undervalued at the time.”</em></p> <p class=\"paywall-full-content invisible\">It seems to be the main thing holding back the company from returning money to shareholders is the pension obligation and after that is settled, and some other debts are paid off in the next few years I think it is fair to say Allegheny will begin to return money to shareholders.</p> <p class=\"paywall-full-content invisible\">In regard to how much this may actually be its hard to be a hundred percent sure, but for the sake of trying to analyze this let’s do a few calculations and see what is possible. After the pension is paid off, and some very conservative growth is considered, Allegheny should be able to profit somewhere between 200-300 million a year. Given that the company has around 125 mil shares outstanding that would put the EPS somewhere between 1.6 and 2.4. If they return 10% of that back to shareholders that would be about a .6% to %1 dividend yield at todays prices. Now this may seem lackluster, but it needs to be noted that these are extremely conservative numbers for future results and that the money returned could be significantly higher.</p> <p class=\"paywall-full-content invisible\"><strong>Conclusion</strong></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">To conclude I think Allegheny Technologies is a strong buy so long as the share price is below $30. The long-term outlook for this company is very good, and management seems to be doing all the right things to really see that investors are rewarded. There are a few things that could slow down ATI’s growth, but I am confident that management will be able to continue the company’s current positive momentum for years to come. It seems the company has done a great job transitioning themselves and they are going to become an even larger player in the specialty materials industry.</p>", "twitContent": "$ATI - Allegheny Technologies: Still Room To Grow. https://seekingalpha.com/article/4236035-allegheny-technologies-still-room-to-grow?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "102723", "type": "author"}}, "sentiments": {"data": [{"id": "6226", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2607", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "572286", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17913", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17927", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4236035-allegheny-technologies-still-room-to-grow", "canonical": "https://seekingalpha.com/article/4236035-allegheny-technologies-still-room-to-grow", "uriImage": "https://static.seekingalpha.com/uploads/2019/1/27/48032762-1548637081943553.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2019/1/27/48032762-1548637081943553.png"}}}, "included": [{"id": "102723", "type": "author", "attributes": {"company": null, "slug": "industrious-investor", "userId": 48032762, "tagId": 572286, "bio": "<p>Mechanical Engineer that likes to write about stocks in my spare time! Fundamental analysis mainly with a focus on industrial companies. I have also been active in crpto markets for a few years.   Hope you enjoy!</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/048/032/762/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/048/032/762/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/048/032/762/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/048/032/762/extra_large_pic.png"}, "nick": "Industrious Investor", "deactivated": null, "memberSince": 2016, "isRss": false, "contributorSince": 2017, "followersCount": 73}, "relationships": {"user": {"data": {"id": "48032762", "type": "user"}}, "userBioTags": {"data": [{"id": "909686", "type": "userBioTag"}, {"id": "909687", "type": "userBioTag"}, {"id": "909688", "type": "userBioTag"}, {"id": "909689", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/industrious-investor", "profileUrl": "/author/industrious-investor", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2607", "type": "tag", "attributes": {"slug": "ati", "name": "ATI", "company": "ATI Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "15", "type": "sector"}}}, "links": {"self": "/symbol/ATI"}}, {"id": "572286", "type": "tag", "attributes": {"slug": "industrious-investor", "name": "Industrious Investor", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/industrious-investor"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17913", "type": "tag", "attributes": {"slug": "industrial-goods", "name": "Industrial Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/industrial-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17927", "type": "tag", "attributes": {"slug": "metal-fabrication", "name": "Metal Fabrication", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/metal-fabrication"}}, {"id": "6226", "type": "sentiment", "attributes": {"articleId": 4236035, "type": "bullish", "createdAt": "2019-01-28T13:54:24.000-05:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4236035", "type": "article"}}, "tag": {"data": {"id": "2607", "type": "tag"}}}}]}