{"data": {"id": "4051501", "type": "fullArticle", "attributes": {"publishOn": "2017-03-02T12:04:51-05:00", "isLockedPro": false, "commentCount": 8, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"young-money-man": {"id": 150213, "slug": "young-money-man", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Thanks To Modern Masters 2017 Hasbro's Magic: The Gathering Will Have Its Best Sales Year Ever", "summary": ["Wizards has filled a sealed product with some of the most desirable cards in the prohibitively expensive Modern Format.", "The switch from a limited print run to an unlimited print run as evidenced from Eternal Masters will see this set outsell previous sets.", "The affordability of Modern as a format will open up renewed interest from the player base and expose more interest in the professional competitive game."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2017-03-04T10:36:37-05:00", "isModerated": false, "closestTradingDate": "2017-03-02", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I do preform personal property appraisals for clients who hold investment quality Magic: The Gathering trading cards.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><em>Magic: The Gathering</em> is one of a number of Hasbro brands (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) in its gaming division that is run by the wholly owned Wizards of The Coast. The property is a trading card game with a healthy secondary market, a professional tour, and a lot of upside in realms outside of physical trading cards. Here I want to make the point that one of their newest releases coming out this year will be their highest selling product yet.</p> <p>For some context, Hasbro has just raised their dividend 12% with 10+ years of consecutive dividend raises. It also beats it competitor Mattel in nearly every category. Finally, in what is largely considered a struggling market (toys), Hasbro has found ways to maneuver the market trends and continue to be profitable. The stock has presented long-term investors with a gift that keeps on giving. Now I expect <em>Magic: The Gathering</em> to give a little more.</p> <p><strong>The Modern Format and Modern Masters 2017 (MM3)</strong></p> <p>Modern is one of the most expensive and prohibitive formats for The <em>Magic: The Gathering</em> game. It is not uncommon for players to have decks valued at several hundred dollars in the secondary market and the most competitive of these to be valued at more than a grand. The barriers to entry are tough and customers have long complained of this inability to play.</p> <p><img src=\"https://static.seekingalpha.com/uploads/2017/3/2/3821041-14884721488495028.jpg\" alt=\"Two Female Fans of Magic The Gathering Dress in Cosplay - Photo by William Tung\" hspace=\"6\" vspace=\"6\" data-width=\"640\" data-height=\"480\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></p> <p><em>Two Female Fans of Magic The Gathering Dress in Cosplay - Photo by William Tung</em></p> <p>The result was a release of products known as <em>Modern Masters</em>. Each sold very well for Wizards as a premium product, often retailing for two or three times the MSRP of a standard legal set release. Still complaints remained that print runs were too low and had little impact on the secondary market prices of cards.</p> <p>Enter 2017 and this<span class=\"paywall-full-content invisible\"> year's </span><em class=\"paywall-full-content invisible\">Modern Masters</em><span class=\"paywall-full-content invisible\"> (MM3) is likely going to be the highest selling Wizards product ever. There is no set print run for a set that contains all of the most desirable cards from the </span><em class=\"paywall-full-content invisible\">Modern</em><span class=\"paywall-full-content invisible\"> format. That said, Hugh McMullen, of Wizards of The Coast has informed me that there are no plans to reprint this release after the initial run. Cards that only saw one printing and were considered necessary for almost every deck at </span><em class=\"paywall-full-content invisible\">Friday Night Magic</em><span class=\"paywall-full-content invisible\"> will now all be released in an accessible print release.</span></p> <p class=\"paywall-full-content invisible\">Obviously this will decrease secondary market prices on those cards and open a whole new demographic of players to the Modern Format who before could not afford to play. This is a huge step forward for Wizards in integrating this game and introducing it to more long-term customers.</p> <p class=\"paywall-full-content invisible\">Marketing for this set release was well done and created quite a stir in the <em>Magic: The Gathering</em> community. The talking heads of Youtube with loyal followings of 100,000+ subscribers each voiced concern for the lack of \"spoilers\" and the distaste for another limited print run set that was going to do little for the secondary market.</p> <p class=\"paywall-full-content invisible\">Now during the last week of February and the first week of March Wizards has spoiled some of the most desirable cards in the format, one after another, each of which could have made a powerful impact on potential sales for this product.</p> <p class=\"paywall-full-content invisible\">The announcement of the inclusion of such staples as <em>Snapcaster Mage</em>, <em>Damnation</em>, and 'Fetchlands' were enough to threaten record-breaking sales. These are cards that nearly every player wants copies of that retail on the secondary market for $20-150 each.</p> <p class=\"paywall-full-content invisible\">The inclusion of such secondary market staples cards such as <em>Path to Exile</em> and <i>Inquisition of Kozilek</i> at uncommon rarity (meaning they will appear more frequently in packs) has sent this set over the edge. As the list of desirable spoilers keeps releasing players are getting more confident about presale's of this product.</p> <p class=\"paywall-full-content invisible\">Yesterday, one of the most coveted cards in the game <em>Liliana of the Veil</em> was spoiled as included in this set. The inclusion of more staples like these keeps adding to a higher sales figure. As the days leading up to release continue with spoilers expect more and more presale's.</p> <p class=\"paywall-full-content invisible\">March 17, 2017 is scheduled as the release date for this phenomenal product and will kick off an altogether monumental year for the brand.</p> <p class=\"paywall-full-content invisible\"><strong>Other 2017 Releases of Note</strong></p> <p class=\"paywall-full-content invisible\"><em>Amokhet</em> follows on April 28, 2017 to be added to the standard format releases. It is an Egyptian themed set that has already created significantly more social media excitement with a teasing storyline that features characters of the brand's past and the hero's of the <em>Gatewatch</em> threatened by a powerful <em>Planeswalker</em> Dragon, <em>Nicol Bolas</em>. The expansion <em>Hour of Devastation</em> will follow on July 14, 2017.</p> <p class=\"paywall-full-content invisible\">There are a couple of supplemental products that may threaten to be just as big of duds as last year's <em>Planeschase Anthology</em> and <em>Conspiracy: Take the Crown</em>. In both cases they were severely overprinted and overpriced during a time when customers were already bombarded with <em>Eternal Masters</em> and <em>Eldritch Moon</em> last year.</p> <p class=\"paywall-full-content invisible\"><em>Commander Anthology,</em> due to release on June 9th 2017 will likely mimic last year's <em>Planeschase Anthology</em> in design, product packaging, and quality of reprints. However it will likely be priced much more appropriately. Still it is dangerously sandwiched between a <em>MM3</em> and the <em>Hour of Devastation</em> release. It is worth mentioning that the summer is typically the worst season for <em>Magic: The Gathering</em> sales.</p> <p class=\"paywall-full-content invisible\"><em>Commander</em> is a growling popular format that continues to attract customers via <em>Commander Preconstructed Decks</em>. Interestingly these decks have an MSRP that is often above $50 and give players an excellent introduction to the format without being the no longer produced and lowly Intro decks. This format attracts much a different players and continues to grow year-after-year.</p> <p class=\"paywall-full-content invisible\">In the very next week of June 2017 Wizards will release <em>Nicol Bolas: Archenemy</em>. Like <em>Commander</em> it is a completely different format with different rules that encourage multi-player scenarios in which players can team up to defeat an <em>Archenemy.</em> Again, it is way too close to release of other more noteworthy products and would be better suited for a holiday release as both this product and the preceding one would make for great gifts for players of this game.</p> <p class=\"paywall-full-content invisible\"><strong>Conclusion</strong></p> <p class=\"paywall-full-content invisible\">The <em>Magic: The Gathering</em> and other franchise brands <em>NERF</em> and <em>Play-Doh</em> saw a 2% year-over-year growth in 2016. It was not specifically mentioned in the fourth quarter snapshot, leaving me to believe the unpopular supplemental products brought the whole picture down. Keep in mind that is with four standard sets releasing in the same year.</p> <p class=\"paywall-full-content invisible\">Cumulatively Hasbro is one healthy company with a slew of brands in different formats and targeted at different demographics throughout the world posting their best year yet. <a href=\"https://seekingalpha.com/article/4043199-hasbro-continues-to-impress-gotten-ahead-of\" target=\"_blank\">Matt Litalien believes the stock is currently overvalued according to a historical P/E ratio of 17.9</a>. It is not unlikely that they will continue to post positive results for 2017 but there are several other catalysts within the <em>Magic: The Gathering</em> brand that need to inject some cash into the property for it to make a more noticeable difference to the stock price for those who are thinking of initiating a position in Hasbro for 2017.</p> <p class=\"paywall-full-content invisible\">I am still waiting on more information on the <a href=\"https://seekingalpha.com/article/3600446-foxs-magic-gathering-movie-franchise-will-enable-hasbro-to-sell-trading-cards-for-years\" target=\"_blank\"><em>Magic: The Gathering</em> movie franchise that will be produced by Fox</a>. Entertainment and licensing only composes 5% revenue currently. Social media chatter believes the prospect of a movie to be a bust as there has been little to no information on the progress of filming. So too they thought the release of <em>Modern Masters 2017</em> was going to be worthless. Imagine if Wizards uses the same strategy of downplaying until they get so close to the release date and bombard fans with the news. They could enjoy a healthy boost in that division.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">The same can be said for <em>Magic Digital Next</em>. Little has been revealed on this new product and a lot is riding on it for long-term growth of <em>Magic: The Gathering</em> as it competes with brands like <em>Hearthstone</em> for customers in the digital gaming marketplace. As stated, Hasbro has a healthy place in the market and is continually bucking the trend against physical toy sales. <em>Magic Digital Next</em> needs to establish itself soon in order to compete with toys and games of the future. My next article will analyze what this product could be, the potential target audience, and what kind of sales or marketing penetration Hasbro could get out of this avenue.</p>", "twitContent": "$HAS - Thanks To Modern Masters 2017 Hasbro's Magic: The Gathering Will Have Its Best Sales Year Ever. https://seekingalpha.com/article/4051501-thanks-to-modern-masters-2017-hasbros-magic-gathering-will-best-sales-year-ever?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "64263", "type": "author"}}, "sentiments": {"data": [{"id": "184841", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "150213", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4051501-thanks-to-modern-masters-2017-hasbros-magic-gathering-will-best-sales-year-ever", "canonical": "https://seekingalpha.com/article/4051501-thanks-to-modern-masters-2017-hasbros-magic-gathering-will-best-sales-year-ever", "uriImage": "https://static.seekingalpha.com/uploads/2017/3/2/3821041-14884721488495028.jpg", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2017/3/2/3821041-14884721488495028.jpg"}}}, "included": [{"id": "64263", "type": "author", "attributes": {"company": null, "slug": "young-money-man", "userId": 3821041, "tagId": 150213, "bio": "My Seeking Alpha articles should not be confused as investment advice, but are simply my opinions. I like to look at small pieces to the puzzle that others are ignoring to their benefit or demise. I am attracted the the quirky stories and divisions within a company.  I do not chart or crunch the numbers, leaving that to the experts. I attempt to find the obvious that many lose sight of and keep emotional investing to the curb.<br><br>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/003/821/041/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/003/821/041/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/003/821/041/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/003/821/041/extra_large_pic.png"}, "nick": "Young Money Man", "deactivated": null, "memberSince": 2012, "isRss": false, "contributorSince": 2014, "followersCount": 36}, "relationships": {"user": {"data": {"id": "3821041", "type": "user"}}, "userBioTags": {"data": [{"id": "760566", "type": "userBioTag"}, {"id": "760586", "type": "userBioTag"}, {"id": "760596", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/young-money-man", "profileUrl": "/author/young-money-man", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "150213", "type": "tag", "attributes": {"slug": "young-money-man", "name": "Young Money Man", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/young-money-man"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "184841", "type": "sentiment", "attributes": {"articleId": 4051501, "type": "bullish", "createdAt": "2017-03-02T12:04:51.000-05:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4051501", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}