{"data": {"id": "4084705", "type": "fullArticle", "attributes": {"publishOn": "2017-06-29T07:30:00-04:00", "isLockedPro": false, "commentCount": 16, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"sa-investing-groups": {"id": 569331, "slug": "sa-investing-groups", "kind": "common", "non_theme": true}, "lutz-muller": {"id": 102761, "slug": "lutz-muller", "kind": "common", "non_theme": true}, "editors-picks": {"id": 1302, "slug": "editors-picks", "kind": "general", "path": "/editors-picks", "title": "Editors' Picks"}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "atvi-defunct-12194": {"id": 12194, "slug": "atvi-defunct-12194", "kind": "common", "non_theme": true}, "ea": {"id": 1243, "slug": "ea", "kind": "common", "non_theme": true}, "five": {"id": 46751, "slug": "five", "kind": "common", "non_theme": true}, "ncbdy": {"id": 146293, "slug": "ncbdy", "kind": "common", "non_theme": true}, "shldq-defunct-850": {"id": 850, "slug": "shldq-defunct-850", "kind": "common", "non_theme": true}, "tkhiy-defunct-132161": {"id": 132161, "slug": "tkhiy-defunct-132161", "kind": "common", "non_theme": true}, "gme": {"id": 1290, "slug": "gme", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "mat": {"id": 1748, "slug": "mat", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "interviews": {"id": 7314, "slug": "interviews", "kind": "general"}, "author-marketing": {"id": 574918, "slug": "author-marketing", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "inbound-marketing": {"id": 576165, "slug": "inbound-marketing", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Investing In Toys Is Serious Business", "summary": ["The worldwide toy market is currently pretty healthy.", "The toy industry is fairly insulated from the mall meltdown, and there are still viable places for brick-and-mortar toy sales.", "Exclusive information can help you be a better investor in the toy sector, where there's a lot of noise in a vast space and key data isn't always readily available."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2017-08-01T16:16:18-04:00", "isModerated": false, "closestTradingDate": "2017-06-29", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": true, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />Lutz Muller has no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given that any particular security, portfolio, transaction or investment strategy is suitable for any specific person. The author is not advising you personally concerning the nature, potential, value or suitability of any particular security or other matter. You alone are solely responsible for determining whether any investment, security or strategy, or any product or service, is appropriate or suitable for you based on your investment objectives and personal and financial situation. The author is an employee of Seeking Alpha. Any views or opinions expressed herein may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>When you look at the contrast between Hasbro’s (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) high-flying stock price ($110.82 as of this writing) and Mattel’s (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a></span>) mediocre $20.69 (also at time of writing), it’s easy to see which one the market favors. However, it’s not always that easy. Despite its light-hearted nature, investing in the toy industry isn’t child’s play. Successful strategies require vigilance and careful analysis of copious amounts of information from different sources that aren’t always readily available. The toy industry spans all four corners of the globe, and staying on top of the latest and greatest from all of the players in the space is serious business. Absent an obvious scenario like Hasbro vs. Mattel, having an expert in your back pocket to help suss out the winners in such a noisy and vast space is a good strategy.</p> <p>With that in mind, we invited <a href=\"https://seekingalpha.com/author/lutz-muller?source=mp_newsletter_intro\">Lutz Muller</a> to join the Marketplace Roundtable. While a newer author to the Marketplace with the service <a href=\"https://seekingalpha.com/author/lutz-muller/research?source=mp_newsletter_intro\">Business Intel on Toys</a>, Lutz is a noted expert in the toy and video game industries. He served as CEO at five different toy manufacturers, has lived on five continents, and speaks six languages. He has been sharing his insights on toy stocks on Seeking Alpha since 2013. Lutz joined us to talk about the current state of the toy industry, why it’s important to look at the industry from a global perspective, and share his perspective on toy sales vis-a-vis the mall meltdown.</p> <p><strong>Seeking Alpha:</strong> Your coverage of the toy industry spans the globe. What is the overall state of the toy industry today?</p> <p><strong>Lutz Muller, author of Business Intel on Toys:</strong> It is, in fact, pretty good. Historically, the toy market worldwide grew since the beginning of this century in unit terms somewhere between 1% and 2% per year, which is about in line with population growth.</p> <p>However, the picture was totally different in dollar terms. The toy market both in the U.S. and internationally basically stagnated between 2005 and 2013 due to migration of production from high cost countries [e.g., the U.S. and Europe] to low-cost countries [e.g., China], which resulted in lower costs and drove prices down, hence affecting dollar sales.</p> <p>This was exacerbated by the 2007 recession and its aftermath. The downturn in economic activity between 2007 and 2013 hit the lower to lower-middle income groups particularly hard and forced them into sharp cuts in discretionary spending – e.g., toys, where they either stopped buying altogether or substituted.</p> <p>Things started changing in 2014. One was the economic recovery. Things started to improve in 2014, and toy purchases as well as other discretionary spending have come back since then. Secondly, the downward price spiral came to an end about the same time. Chinese labor costs had been increasing since about 2005, but this had been cushioned by increased manufacturing efficiencies. By 2014, this was no longer possible and this affected the cost of goods of toys and hence their pricing, which in turn led to higher dollar sales. Thirdly, there were what I call precursor events – events that you could not foresee. In late 2014, it was Frozen; in 2015, it was Star Wars; in 2016 you saw a continued impact from both, and now early 2017, you have fidget spinners.</p> <p>Each precursor event added about 2% to the organic growth rate and resulted in market expansion in the U.S. in the neighborhood of 5% to 6% for 2014, 2015, and 2016, and is now forecast to continue into 2017. Internationally, you had and have pretty much the same picture, particularly in the very large European markets.</p> <p><strong>SA:</strong> What are the benefits to investors of worldwide coverage, vs. regionally or even country-by-country? Originally, that was part of the first question, and I decided to make it a standalone question. So I meant that you focus on the toy industry worldwide, and so I was wondering what the benefit is of doing so, vs. having a narrower regional or national focus instead? Why look at the toy industry on a global scale?</p> <p><strong>LM:</strong> The reason for this is that the toy companies are engaged in a worldwide business. Remember that licenses account for about one-third of the toy market worldwide. If you are just strong in the U.S., then you are unlikely to get a top license – e.g. Star Wars from Disney/Lucas or D.C. Super Hero Girls from Warner. These licenses will go to those companies that are strong worldwide because licensors prefer to deal with one company globally. Also, if, for instance, you are active only in Japan, then you are in a pretty tough place because the market is going south there. This is why Takara (<a href=\"https://seekingalpha.com/symbol/TKHIY\">TKHIY</a>) and Bandai (<a href=\"https://seekingalpha.com/symbol/NCBDY\" title=\"BANDAI NAMCO Holdings Inc.\">OTCPK:NCBDY</a>), both very strong Japanese toy companies, are trying their level best to expand their reach to markets outside Japan. In short, if you are not a factor in the U.S. [the world’s largest single toy market] and are not making progress in China [the world’s second largest toy market], then you are nobody as far as IP or product licensors are concerned.</p> <p>This is how the worldwide market breaks out:</p> <p><img src=\"https://static.seekingalpha.com/uploads/2017/6/28/47713063-1498690240038643.png\" width=\"618\" height=\"425\" data-width=\"618\" data-height=\"425\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></p> <p><strong><em>S</em>A:</strong> When it comes to toymakers, what criteria should investors pay attention to? How are toy stocks different from stocks in other industries? What would you tell an investor who’s considering investing in the toy industry for the first time?</p> <p><strong>LM:</strong> I think that the single most important metric to consider is innovation as measured by the number of new products you bring to the marketplace each year. What is often forgotten is that half of the toy SKUs you see on the shelves this year did not exist last year. You deal with a very demanding, capricious and powerful consumer group – kids between two and nine – and if you do not consistently bring out new and exciting toys, you are toast. The buyers will cut back on your shelf space, you will lose market share, and eventually, you will be tossed from the major retailers.</p> <p>The second most important metric is market share – is it growing or declining in the key markets such as the U.S., Europe, and Asia? Declining market shares have two serious consequences for the company. One is that the licensors will not renew the licenses on which you depend to make a living. The second is that the market share you lose is one another guy is gaining, and then he is the one who gets the shelf space and the support from the retailers, not you. Naturally, SEC filings and earnings calls are important for investors in the company because they give you a good sense of past history, but both can be misleading if relied upon in isolation.</p> <p><strong>SA:</strong> Back in March, you took a rather <a href=\"https://seekingalpha.com/article/4059492-gamestop-will-probably-survive-in-longer-term\">realistic look</a> at the state of GameStop (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/GME\" title=\"GameStop Corp.\">GME</a></span>). You aptly pointed out a steady decline in sales, and its challenges as an entirely brick and mortar company. However, one bright spot, you observed, might be its Collectibles business. You wrote that “Collectibles are a very good choice for GameStop's long-term strategy and hence for its inclusion in the video game store space...” You also mentioned that keeping a sharp eye on expenses and reducing store count might help extend GameStop’s life. This author recently <a href=\"https://seekingalpha.com/article/4083718-gamestop-i-cant-get-taste-of-blockbuster-out-of-mouth\">wrote</a> that while GameStop can still turn things around, the clock is ticking, particularly due to its ties to the beleaguered malls market. What’s your take? Do you still believe there’s a viable future for GameStop? Why or why not?</p> <p><strong>LM:</strong> GameStop, in its current business model, is fighting two unstoppable forces. One is the ongoing move from brick-and-mortar stores to digital. Consumers, particularly the young who are the core of GameStop’s customers, are moving towards online purchasing at an accelerating pace.</p> <p>The second is that the publishers of games – the Electronic Arts (<a href=\"https://seekingalpha.com/symbol/EA\" title=\"Electronic Arts Inc.\">EA</a>) and Activision (<a href=\"https://seekingalpha.com/symbol/ATVI\">ATVI</a>) of this world – are increasingly promoting direct sales to consumers and, in so doing, are cutting GameStop out of the picture.</p> <p>With declining new software sales, GameStop’s most profitable business – used games – will automatically decline as well since it is new software that feeds the used game market. GameStop will likely keep the new hardware business, the consoles, but this is where profit margins are at their most narrow – 10% if you are lucky, compared to about 50% for used games and 20% for new software.</p> <p>GameStop’s management is recognizing this and hence their efforts to diversify their business away from video games into collectibles on one hand and non-game retail – Simply Mac, Spring Mobile and Cricket – on the other. There are a couple of basic problems with this strategy. One is that their collectibles effort, while extraordinarily clever, takes place in their existing video game retail stores, which continue to depend on their success in selling games. Collectibles are a totally different business and the stores are not staffed to do a good job with both, and so they end up with really not doing one for either.</p> <p>The second is that all their new initiatives are brick-and-mortar based. If you assume that e-commerce is the unstoppable retail force of today and tomorrow then this, indeed, is the wrong strategy to pursue.</p> <p>To answer your question, can GameStop survive? The answer, in my opinion, is “probably not” unless they manage to square the circle, get rid of their GameStop stores, move their video game business online, and emerge as a retail conglomerate that is specialized in a variety of niches with stores that cater only to those niches.</p> <p><strong>SA:</strong> Speaking of consumers’ waning enthusiasm for shopping malls, does that impact the toy industry, since many toy companies tend to be present on the same properties as malls, and if so how? What does it mean for investors? Do you see all toy sales eventually coming from online stores?</p> <p><strong>LM:</strong> If you look at where toys are sold today, this is the one product category that is pretty much insulated from the coming mall meltdown. This is how market share stacks up today in the U.S.:</p> <p><span><a href=\"https://static.seekingalpha.com/uploads/2017/6/28/47713063-1498690348515566_origin.png\" rel=\"lightbox\" data-width=\"673\" data-height=\"304\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2017/6/28/47713063-1498690348515566.png\" width=\"640\" height=\"289\" data-width=\"640\" data-height=\"289\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p>Note that Amazon’s market shares include both First Party and Third Party vendors. Also, note that the market shares shown include not only a retailer’s brick-and-mortar sales but also their online sales.</p> <p>In the short- to medium-term, toy companies are pretty safe from the inevitable destruction of the Mall retail model. Virtually all of their retailers are not mall-based with the exception of Sears/Kmart (<a href=\"https://seekingalpha.com/symbol/SHLD\" title=\"VictoryShares Protect America ETF\">SHLD</a>) and the small Mom+Pop stores shown under “Others.”</p> <p>However, if you look at how sales have developed between brick-and-mortar on one side and online on the other, this is the picture: <span><a href=\"https://static.seekingalpha.com/uploads/2017/6/28/47713063-14986904056993752_origin.png\" rel=\"lightbox\" data-width=\"716\" data-height=\"196\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2017/6/28/47713063-14986904056993752.png\" width=\"640\" height=\"175\" data-width=\"640\" data-height=\"175\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\" loading=\"lazy\"></a></span>As you can see, Brick and Mortar toy sales are in fact declining. In the case of Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>), we are already looking at the lowest shelf space devoted to toys in the last week of June compared to the status in the same week going all the way back to 2008.</p> <p>No, not all the toy sales will end up online. There is a place for two brick-and-mortar models. One is the model epitomized by ToysRUs - the place where kids want to go because TRU has the best assortment, and you can touch and browse and select toys at your leisure. The other is where assortment is very frugal and prices very low – e.g. Dollar stores and particularly Five Below (<a href=\"https://seekingalpha.com/symbol/FIVE\" title=\"Five Below, Inc.\">FIVE</a>). This is where the low and lower-middle consumers go because there is a Dollar store just around the corner everywhere, and you cannot beat the prices because many of the toys are close-outs and fantastic value. Wal-Mart (<a href=\"https://seekingalpha.com/symbol/WMT\" title=\"Walmart Inc.\">WMT</a>) may qualify for this partly because of the store’s overall price and assortment profile. In other words, you go there for other stuff and get toys because you are there anyway.</p> <p><strong>SA:</strong> You write two complementary monthly newsletters that provide an outlook on the toy industry - the Toy Manufacturer Newsletter, and the Toy Supply Chain Newsletter. Why are these relevant for investors, and why are they important to read?</p> <p><strong>LM:</strong> Whether you invest your own money or somebody else’s, you compete with the best and sharpest minds in the world. Remember, if you buy, you buy from somebody who is selling. The guy who sells does that for a reason – he thinks the stock will go down. You buy because you think it will go up. You will win if you know something the other guy does not.</p> <p>That is where these two newsletters come in. Klosters has its own U.S.-based retailer panel that provides insights into shelf space, inventory levels, sell-through, market shares and other data points. Klosters draws its data and conclusions based on feedback from 28 leading retailers located in 17 key markets that’s provided on an ongoing basis. All this is reported at the end of each month in these two newsletters containing data that is at most two weeks old. There is no magic to it – anybody can do it who has more than 30 years’ senior executive experience in the toy space, who has contacts on five continents because he lived on them and speaks the languages, and who works on gathering insights and information 24/7. You can do it yourself or you can spend $150/month and get two reports that give you all you need to know.</p> <p><strong>SA:</strong> Any predictions about the toy industry, and/or toy stocks in general, as we head into the second half of the year and the holiday retail season?</p> <p><strong>LM:</strong> Toys To Life will not go away, fidget spinners will likely hit the dust, Hasbro will continue to grow, and Mattel will continue to struggle.</p> <p>Thanks to <a href=\"https://seekingalpha.com/author/lutz-muller?source=mp_newsletter_end\">Lutz</a> for joining the Marketplace Roundtable. You can check out his author page to read more of his work or check out <a href=\"https://seekingalpha.com/author/lutz-muller/research?source=mp_newsletter_end\">Business Intel on Toys</a> for $1200/year.</p> <p>Sign up for the SA Marketplace Roundtable above or below to get all of our roundtables in your inbox. We published a weeklong Energy series earlier this month and are going to explore a few other interesting topics and formats over coming months, and it's a great way to stay on top of Marketplace developments.</p> <div class=\"before_last_paragraph-piano-placeholder\"></div><p><strong>Coming next:</strong> Casey Hoerth on dividend stocks.<span><span><span></span></span></span></p>", "twitContent": "$GME $HAS $MAT - Investing In Toys Is Serious Business. https://seekingalpha.com/article/4084705-investing-in-toys-is-serious-business?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "102107", "type": "author"}}, "sentiments": {"data": [{"id": "189177", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "1290", "type": "tag"}, {"id": "4040", "type": "tag"}, {"id": "1748", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "12194", "type": "tag"}, {"id": "1243", "type": "tag"}, {"id": "46751", "type": "tag"}, {"id": "146293", "type": "tag"}, {"id": "850", "type": "tag"}, {"id": "132161", "type": "tag"}]}, "otherTags": {"data": [{"id": "569331", "type": "tag"}, {"id": "102761", "type": "tag"}, {"id": "1302", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "7314", "type": "tag"}, {"id": "574918", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "576165", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": [{"id": "48741", "type": "author"}]}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4084705-investing-in-toys-is-serious-business", "canonical": "https://seekingalpha.com/article/4084705-investing-in-toys-is-serious-business", "uriImage": "https://static.seekingalpha.com/uploads/2017/6/28/47713063-1498690240038643.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2017/6/28/47713063-1498690240038643.png"}}}, "included": [{"id": "102107", "type": "author", "attributes": {"company": null, "slug": "sa-investing-groups", "userId": 47713063, "tagId": 569331, "bio": "<p>The <a href=\"https://seekingalpha.com/marketplace\"></a><a href=\"https://seekingalpha.com/marketplace\">Seeking Alpha Investing Groups</a> is our platform for investing research and guidance. Services are led by individual authors and feature communities of investors with similar interests focused on a given investment style and approach. It enables investors to get guidance and ideas that suits their needs so they can take their investing to the next level. Contact us at <a href=\"https://premiumauthors@seekingalpha.com\"></a><a href=\"marketplace@seekingalpha.com\">marketplace@seekingalpha.com</a> if you'd like to apply to launch an Investing Groups service. Interested in signing up for a Marketplace service? Check out all our services <a href=\"https://seekingalpha.com/marketplace\">here</a>. For any questions about SA's Investing Groups, contact <a href=\"https://subscriptions@seekingalpha.com\">subscriptions@seekingalpha.com</a>. We'd be happy to hear from you.</p><p>This account will be used to highlight these authors and offer insights into investing from the authors to any interested users. Follow this account if you'd like to hear what's going on with the SA Investing Groups!</p>", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/047/713/063/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/047/713/063/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/047/713/063/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/047/713/063/extra_large_pic.png"}, "nick": "SA Investing Groups", "deactivated": null, "memberSince": 2016, "isRss": false, "contributorSince": 2016, "followersCount": 17612}, "relationships": {"user": {"data": {"id": "47713063", "type": "user"}}, "userBioTags": {"data": []}, "authorResearch": {"data": null}}, "links": {"self": "/author/sa-investing-groups", "profileUrl": "/author/sa-investing-groups", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "48741", "type": "author", "attributes": {"company": null, "slug": "lutz-muller", "userId": 435974, "tagId": 102761, "bio": "Lutz is an acknowledged expert on the toy space. His clients include one of the top three U.S. banks and one of the top three non-public toy companies worldwide. Between 1984 and 2002, Lutz was the CEO at five different manufacturing companies catering to U.S. and international mass retailers. He's lived on five continents and speaks six languages.<br><br><p><br></p><p>He started his business intelligence consulting practice in 2003 and he derives his information from three primary sources. The first is his proprietary retailer panel, which includes Wal-Mart, Target, J C Penney, Kohl's, Gamestop, Dollar General, Barnes + Noble and Learning Express. This panel provides him with sell-through data, shelf space changes, inventory levels and other pertinent metrics governing the major companies and products active in the two industry categories. The second is national buyers at 30 leading retailers in 17 large country markets. These provide color on trends and issues that have a bearing on the major manufacturers and products in the two industry categories. The last is mainly Chinese third-party manufacturers who provide insights into supply and inventory issues affecting the major companies or products in the two industry categories.<br><br></p><p>Lutz consults with banks and hedge funds, and hence does not trade in any stocks associated with companies active in the spaces he focuses on. Lutz also is a monthly contributor to Seeking Alpha. He also publishes a monthly Toy Newsletter, which can be found on his website, www.klosterstrading.com.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/000/435/974/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/000/435/974/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/000/435/974/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/000/435/974/extra_large_pic.png"}, "nick": "Lutz Muller", "deactivated": null, "memberSince": 2009, "isRss": true, "contributorSince": 2013, "followersCount": 905}, "relationships": {"user": {"data": {"id": "435974", "type": "user"}}, "authorResearch": {"data": null}}, "links": {"self": "/author/lutz-muller", "profileUrl": "/author/lutz-muller", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "1290", "type": "tag", "attributes": {"slug": "gme", "name": "GME", "company": "GameStop Corp.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/GME"}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/HAS"}}, {"id": "1748", "type": "tag", "attributes": {"slug": "mat", "name": "MAT", "company": "Mattel, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MAT"}}, {"id": "12194", "type": "tag", "attributes": {"slug": "atvi-defunct-12194", "name": "ATVI", "company": "Activision Blizzard, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": true, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/ATVI-DEFUNCT-12194"}}, {"id": "1243", "type": "tag", "attributes": {"slug": "ea", "name": "EA", "company": "Electronic Arts Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/EA"}}, {"id": "46751", "type": "tag", "attributes": {"slug": "five", "name": "FIVE", "company": "Five Below, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/FIVE"}}, {"id": "146293", "type": "tag", "attributes": {"slug": "ncbdy", "name": "NCBDY", "company": "BANDAI NAMCO Holdings Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "OTCMKTS", "fundTypeId": 8, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/NCBDY"}}, {"id": "850", "type": "tag", "attributes": {"slug": "shldq-defunct-850", "name": "SHLDQ", "company": "Sears Holdings Corp.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "OTCMKTS", "fundTypeId": 0, "isDefunct": true, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/SHLDQ-DEFUNCT-850"}}, {"id": "132161", "type": "tag", "attributes": {"slug": "tkhiy-defunct-132161", "name": "TKHIY", "company": "Takara Holdings, Inc. ADR", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "OTCMKTS", "fundTypeId": 0, "isDefunct": true, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/TKHIY-DEFUNCT-132161"}}, {"id": "569331", "type": "tag", "attributes": {"slug": "sa-investing-groups", "name": "SA Investing Groups", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/sa-investing-groups"}}, {"id": "102761", "type": "tag", "attributes": {"slug": "lutz-muller", "name": "Lutz Muller", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/lutz-muller"}}, {"id": "1302", "type": "tag", "attributes": {"slug": "editors-picks", "name": "Editors' Picks", "company": null, "tagKind": "Tags::SpecialType"}, "links": {"self": "/listing/editors-picks"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "7314", "type": "tag", "attributes": {"slug": "interviews", "name": "Interviews", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/interviews"}}, {"id": "574918", "type": "tag", "attributes": {"slug": "author-marketing", "name": "Author Marketing", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/author-marketing"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "576165", "type": "tag", "attributes": {"slug": "inbound-marketing", "name": "Inbound Marketing", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-marketing"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "189177", "type": "sentiment", "attributes": {"articleId": 4084705, "type": "bullish", "createdAt": "2017-06-29T07:30:00.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4084705", "type": "article"}}, "tag": {"data": {"id": "1290", "type": "tag"}}}}]}