{"data": {"id": "4086626", "type": "fullArticle", "attributes": {"publishOn": "2017-07-10T10:17:25-04:00", "isLockedPro": false, "commentCount": 3, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"lutz-muller": {"id": 102761, "slug": "lutz-muller", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "tkhiy-defunct-132161": {"id": 132161, "slug": "tkhiy-defunct-132161", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Is Takara Tomy In Hasbro's Gunsights?", "summary": ["Takara Tomy is losing one of its best licenses, and its revenue outlook is negative for the next two years.", "The company has failed in its effort over the past six years to diversify from a declining Japanese toy market.", "The company has incurred massive losses since 2012.", "It has hence become a takeover target and this possibly from the side of Hasbro."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2017-07-10T13:05:54-04:00", "isModerated": false, "closestTradingDate": "2017-07-10", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>A few weeks ago, I had a conversation with an old friend of mine, a senior buyer at a large Japanese toy retailer, who asked me whether I had seen the announcement about Pokemon pulling its license from Takara Tomy (TKHIY) and giving it to Wicked Cool Toys Company as of July 2018. I said that I had, and the follow-up question was whether I thought it likely that one of the two large American toy companies would buy <span>Takara Tomy. Japanese executives are not in the habit of asking flippant questions, and this one made me think that there could in fact something major be happening and meriting further investigation.</span></p> <p>First, some background.</p> <p>In a Toy News Magazine article dated April 6, 2011, I said that:</p> <blockquote class=\"quote\"><p><em>“Takara Tomy is buying RC2 and challenging the leading US and European toy manufacturers on their own turf. With this move the company is transforming itself from a local giant into one with a decent presence in all major markets and a viable competitor to Mattel, Spin Master and JAKKS. I have omitted Hasbro from that statement because there are ties between the two companies effectively ruling out competition between them</em>.”</p></blockquote> <p>There was a solid reason why <span>Takara Tomy was anxious to diversify away from its home market. Japan toy sales have been declining for since 2010 due to negative population growth, a trend that is unlikely to reverse itself in a hurry:</span></p> <p><img src=\"https://static.seekingalpha.com/uploads/2017/7/9/435974-14996143026290996.png\" width=\"482\" height=\"289\" data-width=\"482\" data-height=\"289\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></p> <p><em>Source: Yano Research Institute</em></p> <p><span></span></p> <p>It now behooves us to have a look at what <span>Takara Tomy has done with its Learning Curve acquisition and how it fared in its quest to leverage its mainly Japanese toy business into a worldwide presence. This is its revenue history:</span></p> <p><img src=\"https://static.seekingalpha.com/uploads/2017/7/9/435974-1499614444248106.png\" width=\"482\" height=\"289\" data-width=\"482\" data-height=\"289\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p><em>Source: Annual Reports and Klosters Retailer Panel Data</em></p> <p>Given the yen’s choppy exchange rate<span class=\"paywall-full-content invisible\"> history, it would probably be useful to look at its North American and European sales in dollar terms:</span></p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2017/7/9/435974-14996146382329628.png\" width=\"482\" height=\"289\" data-width=\"482\" data-height=\"289\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><em>Source: Annual Reports and Klosters Retailer Panel Data</em></p> <p class=\"paywall-full-content invisible\">The only area where <span>Takara Tomy is showing some progress is China as shown under Asia (excl. Japan).</span></p> <p class=\"paywall-full-content invisible\">Not so surprisingly, the company did not do too well in profitability terms either:</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2017/7/9/435974-14996147556641338.png\" width=\"482\" height=\"289\" data-width=\"482\" data-height=\"289\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><em>Source: Annual Reports</em></p> <p class=\"paywall-full-content invisible\">When you look at the second chart, you will notice that the Learning Curve acquisition resulted in a sharp bump in revenues in North America and Europe in 2011. This was a one-time event, and there were continuous revenue declines thereafter. The company failed to develop its avowed geographical diversification strategy and in fact squandered the Learning Curve opportunity totally.</p> <p class=\"paywall-full-content invisible\">Its Japanese business, by far its largest, shows a very choppy picture with sharp declines forecasted for the 2017 and 2018 fiscal years.</p> <p class=\"paywall-full-content invisible\">The 2017 projections are based on Retailer Panel sell-through data in the U.S. and national buyer feedback around the world up to end of June. As for 2018, the forecast takes into account the loss of the Pokemon franchise mentioned in the first paragraph above. To demonstrate just how important Pokemon is today to <span>Takara Tomy, this is how the brand stacks up within the company’s revenue in the United States at the end of June:</span></p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2017/7/9/435974-14996148898170877.png\" width=\"482\" height=\"289\" data-width=\"482\" data-height=\"289\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><em>Source: Klosters Retailer Panel</em></p> <p class=\"paywall-full-content invisible\">In other words, you can expect about one-quarter of Takara Tomy’s revenue to go west in 2018, and this is not only in the U.S. but also in Europe and the better part of Asia.</p> <p class=\"paywall-full-content invisible\">So, given this performance and outlook - and assuming that the Japanese buyer is right in insinuating that somebody could be angling for <span>Takara Tomy - who would have the heft and the desire to buy this company?</span></p> <p class=\"paywall-full-content invisible\">There are not too many candidates. One is Mattel (<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a>) but the company has its hands full in trying to stabilize its own business and is unlikely to want to add to its many problems at this stage. Another is Spin Master, but the company does not today have the resources both in terms of staff and finance to swallow a whale as large as <span>Takara Tomy. Then, there is of course Bandai (<a href=\"https://seekingalpha.com/symbol/NCBDY\" title=\"BANDAI NAMCO Holdings Inc.\">OTCPK:NCBDY</a>), but a <span>Takara Tomy acquisition would only add to its already large market share in Japan without getting anything of significance elsewhere.</span></span></p> <p class=\"paywall-full-content invisible\">Which leavens Hasbro and this would make a lot of sense for a number of reasons:</p> <p class=\"paywall-full-content invisible\"><strong>1. Hasbro is looking for a large acquisition</strong></p> <p class=\"paywall-full-content invisible\">There were talks between Hasbro and Mattel last year to determine whether a merger between the two companies was feasible. My buyer contacts think these talks were initiated by Hasbro and eventually terminated because Mattel simply did not want to go there. This suggests to me that Hasbro is indeed looking for a large acquisition and <span>Takara Tomy would most certainly fit this bill. Also, Hasbro can be expected to look for significant synergies and cost savings in any acquisition and <span>Takara Tomy would be very likely to provide this.</span></span></p> <p class=\"paywall-full-content invisible\"><strong>2. Buying <span>Takara Tomy would resolve a number of messy issues for Hasbro</span></strong></p> <p class=\"paywall-full-content invisible\">It is not widely known that both the Transformers IP as well as Beyblades are owned by <span>Takara Tomy and were licensed to Hasbro on a worldwide basis except Japan where Tomy has the exclusivity and China, Korea and Taiwan where the two companies co-exist. While on the surface neat and tidy, this split has led to a number of problems. The most glaring one was the recent launch of Beyblade Burst where <span>Takara Tomy sold its version of Beyblades in the U.S. whereas Hasbro sold its own and different product in Canada. Also, third-party sellers often take advantage of this situation whereby they buy the Tomy Transformers products from Japanese wholesalers and resell them in places such as India. This geographical separation also has the result that Tomy’s Transformers differ materially from the same product developed by Hasbro. A merger of the two companies would straighten out these problems.</span></span></p> <p class=\"paywall-full-content invisible\"><strong>3. Tomy’s business would add strength to Hasbro where it is very weak</strong></p> <p class=\"paywall-full-content invisible\">One of Hasbro’s weakest areas is its Preschool business. Currently, it has about 20% of the U.S. market compared to Fisher-Price’s more than 40%. Adding Tomy would increase this market share to an estimated 25%. Also, Hasbro is not participating in the Toys To Life category where Lego Dimensions is representing an increasing threat to its Action Figure business. Adding Tomy’s very recent entry, the Lightseekers, would take care of this issue.</p> <p class=\"paywall-full-content invisible\"><strong>4, Buying <span>Takara Tomy would make Hasbro a significant player in China</span></strong></p> <p class=\"paywall-full-content invisible\">At this point, Hasbro is not really a factor in China - the world’s second largest toy market. The company has a market share of about 1% and is facing a very aggressive Mattel which has just entered into three strategic alliances there - with Alibaba (<a href=\"https://seekingalpha.com/symbol/BABA\" title=\"Alibaba Group Holding Limited\">BABA</a>) focusing on brick-and-mortar retailers, with Babytree on educational services and the Fosun Group (<a href=\"https://seekingalpha.com/symbol/FOSUY\" title=\"Fosun International Limited\">OTCPK:FOSUY</a>) for access to the Club Med kids’ clubs in China. Hasbro, on the other hand, concluded two years ago a strategic alliance with the Alpha Group whereby Alpha would support Hasbro in China in return for Hasbro establishing Alpha in Europe and North America. Neither effort has gained much traction, and there are increasing indications that Alpha is now going on its own sweet way in both “Hasbro” territories.</p> <p class=\"paywall-full-content invisible\">In contrast, <span>Takara Tomy is doing well in China and has now about the same market share as Hasbro. The company, for instance, has the top three Action Figure properties in the country whilst Hasbro is way down the list. By acquiring <span>Takara Tomy, Hasbro would double its Chinese business overnight. It would, in addition, acquire a very efficient sales and marketing operation which it currently really does not have.</span></span></p> <p class=\"paywall-full-content invisible\"><strong>5. The combination of Takara Tomy’s position in Japan and Hasbro’s entrepreneurial philosophy could be expected to stabilize their Japanese business.</strong></p> <p class=\"paywall-full-content invisible\">The license agreement mentioned under Pt 2 also stipulates that <span>Takara Tomy is the exclusive seller of all Hasbro products in Japan. Takara Tomy’s faltering performance in its home market has a direct negative effect on Hasbro’s license income. More importantly, the agreement as it stands forces Hasbro into the role of passive bystander in the world’s third largest toy market. All of this must be a major concern to Hasbro and one which a merger would resolve immediately. More importantly, you could expect that the combination of Takara Tomy’s dominant market position and Hasbro’s entrepreneurial skills would be instrumental in reversing an accelerating negative market share trend.</span></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Whilst there is absolutely no guarantee that Hasbro is in fact contemplating buying <span>Takara Tomy or that such an effort would succeed, two things appear to be fairly clear. One is that such an acquisition would be beneficial for both companies. The other is that without such a move, <span>Takara Tomy is likely to continue struggling.</span></span></p>", "twitContent": "$HAS $TKHIY-DEFUNCT-132161 - Is Takara Tomy In Hasbro's Gunsights?. https://seekingalpha.com/article/4086626-is-takara-tomy-in-hasbros-gunsights?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "48741", "type": "author"}}, "sentiments": {"data": []}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}, {"id": "132161", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "102761", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4086626-is-takara-tomy-in-hasbros-gunsights", "canonical": "https://seekingalpha.com/article/4086626-is-takara-tomy-in-hasbros-gunsights", "uriImage": "https://static.seekingalpha.com/uploads/2017/7/9/435974-14996143026290996.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2017/7/9/435974-14996143026290996.png"}}}, "included": [{"id": "48741", "type": "author", "attributes": {"company": null, "slug": "lutz-muller", "userId": 435974, "tagId": 102761, "bio": "Lutz is an acknowledged expert on the toy space. His clients include one of the top three U.S. banks and one of the top three non-public toy companies worldwide. Between 1984 and 2002, Lutz was the CEO at five different manufacturing companies catering to U.S. and international mass retailers. He's lived on five continents and speaks six languages.<br><br><p><br></p><p>He started his business intelligence consulting practice in 2003 and he derives his information from three primary sources. The first is his proprietary retailer panel, which includes Wal-Mart, Target, J C Penney, Kohl's, Gamestop, Dollar General, Barnes + Noble and Learning Express. This panel provides him with sell-through data, shelf space changes, inventory levels and other pertinent metrics governing the major companies and products active in the two industry categories. The second is national buyers at 30 leading retailers in 17 large country markets. These provide color on trends and issues that have a bearing on the major manufacturers and products in the two industry categories. The last is mainly Chinese third-party manufacturers who provide insights into supply and inventory issues affecting the major companies or products in the two industry categories.<br><br></p><p>Lutz consults with banks and hedge funds, and hence does not trade in any stocks associated with companies active in the spaces he focuses on. Lutz also is a monthly contributor to Seeking Alpha. He also publishes a monthly Toy Newsletter, which can be found on his website, www.klosterstrading.com.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/000/435/974/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/000/435/974/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/000/435/974/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/000/435/974/extra_large_pic.png"}, "nick": "Lutz Muller", "deactivated": null, "memberSince": 2009, "isRss": true, "contributorSince": 2013, "followersCount": 905}, "relationships": {"user": {"data": {"id": "435974", "type": "user"}}, "userBioTags": {"data": [{"id": "110303", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/lutz-muller", "profileUrl": "/author/lutz-muller", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "132161", "type": "tag", "attributes": {"slug": "tkhiy-defunct-132161", "name": "TKHIY", "company": "Takara Holdings, Inc. ADR", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "OTCMKTS", "fundTypeId": 0, "isDefunct": true, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/TKHIY-DEFUNCT-132161"}}, {"id": "102761", "type": "tag", "attributes": {"slug": "lutz-muller", "name": "Lutz Muller", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/lutz-muller"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}]}