{"data": {"id": "4104268", "type": "fullArticle", "attributes": {"publishOn": "2017-09-05T16:36:30-04:00", "isLockedPro": false, "commentCount": 15, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"alt-perspective": {"id": 572081, "slug": "alt-perspective", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "lgf.a": {"id": 99, "slug": "lgf.a", "kind": "common", "non_theme": true}, "lgf.b": {"id": 571805, "slug": "lgf.b", "kind": "common", "non_theme": true}, "nflx": {"id": 97, "slug": "nflx", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "mat": {"id": 1748, "slug": "mat", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro: Value Has Emerged", "summary": ["The share price of Hasbro has undergone a correction ostensibly due to some profit-taking after it hit an intra-day record high in July.", "The share price of Hasbro has now dipped significantly below the consensus price target and its fair value calculated based on its historical multiples.", "There has been some disappointment over its unsuccessful bid for Lions Gate, but there have also been positive developments.", "If you have been waiting to add to your positions or initiate one, the opportunity has emerged."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2017-09-06T01:56:43-04:00", "isModerated": false, "closestTradingDate": "2017-09-06", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long DIS.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I have no positions in Hasbro, but may initiate a Long position in HAS over the next 72 hours.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<h3>Introduction</h3> <p>The share price of Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) has undergone a correction in the past two months, ostensibly due to some profit-taking after it hit an intra-day record high on July 21st, the last trading day before its Q2 results announcement. While it has rebounded somewhat, the last closing price ($98.34) is still 15.4% lower than the peak achieved less than two months ago. The fall pales in comparison with Mattel's (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a></span>) 23.8% decline in the same period. Nevertheless, this has to factor in the earnings beat at Hasbro versus the earnings disappointment at Mattel, and the apparently brighter prospects at Hasbro compared to Mattel in the coming quarters. For years, the share price of Hasbro had generally reached the consensus price target after dipping. In the past month, however, it dropped sharply below the prevailing consensus target at $109.77. While this is not a fool-proof indication of undervaluation, it piqued my interest to investigate whether the correction of this magnitude is justified. In the subsequent sections, I explain why the sell-down appears overdone.</p> <p><img src=\"https://static.seekingalpha.com/uploads/2017/9/5/saupload_05521fb849cc6c8850f69f9ab8179863.png\" class=\"sa-ycharts-img\" alt=\"Chart\" data-width=\"635\" data-height=\"366\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"><em>HAS data by YCharts</em></p> <h3>Hasbro Studios - Potential Waiting to be Unlocked</h3> <p>Hasbro has not been resting on its laurels following the success of its Transformers franchise and tailwinds from its lucrative licensing agreements with Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>). On July 31, <a href=\"https://media.netflix.com/en/press-releases/hasbro-and-netflix-announce-new-original-series-stretch-armstrong-and-the-flex-fighters\" rel=\"nofollow\">Hasbro announced</a> that a new teenage superhero animated series will premiere on Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a>). The kids series named <em>Stretch Armstrong and the Flex Fighters</em> is created in-house by Hasbro Studios and is the first Hasbro brand to receive a Netflix original series order. Besides earning from the viewership, Hasbro is certainly expected to profit from the consumer interest in the associated toys such as the Stretch Armstrong doll originally introduced in 1976 where in the plot it could \"stretch from its original size of fifteen<span class=\"paywall-full-content invisible\"> inches to four or five feet.\" Hasbro did not mention any other spin-off businesses but I suppose a movie series and related computer games could eventually exploit the popularity of the Netflix series.</span></p> <p class=\"paywall-full-content invisible\">Hasbro has also decided to make a strategic shift into film financing. Its animated movie \"My Little Pony\" would be the <a href=\"https://www.latimes.com/business/hollywood/la-fi-ct-hasbro-ambitions-20170321-story.htm\" rel=\"nofollow\">first that is fully financed</a> under its Allspark movie label. The company explained that by doing so it would be able to \"release and market films with greater flexibility.\" \"My Little Pony\" incidentally will be released by Lions Gate (<a href=\"https://seekingalpha.com/symbol/LGF.A\" title=\"Lions Gate Entertainment Corp.\">LGF.A</a>)(<a href=\"https://seekingalpha.com/symbol/LGF.B\" title=\"Lions Gate Entertainment Corp.\">LGF.B</a>), the entertainment and media company that Hasbro had pursued a deal with. Having greater control over the film business would benefit the toy division as there can be better collaboration and coordination to ensure success in the complementary launch of the movie and the accompanying toys.</p> <h3 class=\"paywall-full-content invisible\">Hasbro Is Not Trading at a Premium Even As It Is Expanding Its Market Share</h3> <p class=\"paywall-full-content invisible\">Post-Q2 earnings of Hasbro, I wrote an article highlighting why Mattel and Jakks Pacific (<a href=\"https://seekingalpha.com/symbol/JAKK\" title=\"JAKKS Pacific, Inc.\">JAKK</a>) <a href=\"https://seekingalpha.com/article/4091180-hasbro-results-portend-weakness-mattel-and-jakks-pacific\">could see further weakness</a>. In the earnings call of Hasbro, CEO Brian Goldner indicated that the market share of Hasbro expanded as the company achieved a revenue growth more than double that of the industry. This reasoning was validated when Mattel reported another weak set of results a few days later.</p> <p class=\"paywall-full-content invisible\">In the coming quarters, Hasbro is expected to continue expanding its market share. Hasbro is the clear beneficiary of a number of movies to be screened in the next few months as compared to Mattel due to its slew of licensing agreements. As Hasbro captures more of the industry revenue, it certainly deserves to trade at a premium over its peers. However, that is hardly the case. Despite its brighter prospects and fundamentals, it is trading at a very similar EV/EBITDA ratio as Mattel (12.40 versus 12.03, respectively).</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2017/9/5/saupload_8bed04bc7cac7749cb26a56c602f12d5.png\" class=\"sa-ycharts-img\" alt=\"Chart\" data-width=\"635\" data-height=\"366\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"><em>HAS EV to EBITDA (TTM) data by YCharts</em></p> <h3 class=\"paywall-full-content invisible\">Research Models Suggest The Fundamentals of Hasbro Surpassed Mattel in 2014 and Has Continued to Strengthen</h3> <p class=\"paywall-full-content invisible\">Academics have over the years performed extensive research to uncover models that can predict the future of companies. There are several models that focus on foretelling the probability of failures or bankruptcies. The formula in the models was developed with extensive back testing. In this investigation, I used Fulmer H Factor, Springate Score, and Sustainable Growth. While the models were generally meant for predicting the probability of bankruptcy, the metrics employed in the model calculations (e.g. Average Total Debt/Total Equity, Average Working Capital/Average Total Debt) are essentially used in the fundamental analysis in some form or another. YCharts' <a href=\"https://ycharts.com/glossary/terms/fulmer_h_score\" rel=\"nofollow\">glossary stated</a> that the Fulmer H Factor model \"can certainly be used as a guide to understand which stocks may be safer, and which may be less safe.\" Hence, although recognizing the limitations, the model is a neat method to compare the metrics of two or more companies. In the case of Hasbro and Mattel, the model was the first among the three models to indicate the divergence between the two toy companies. Since reflecting the relative \"safety\" of Hasbro over Mattel in mid-2014, the model has churned out a pattern that corresponded with the share price movements of the two toy companies.</p> <p class=\"paywall-full-content invisible\">A simpler model, the <a href=\"https://ycharts.com/glossary/terms/springate_score\" rel=\"nofollow\">Springate Score</a>, employs the use of only four out of nineteen common financial ratios to determine the likelihood of firms failing. It similarly reflected the divergence, albeit slightly delayed from the Fulmer H Factor model. If an even more direct approach is preferred, the <a href=\"https://ycharts.com/glossary/terms/sustainable_growth_rate\" rel=\"nofollow\">Sustainable Growth Rate</a> comes to mind. It is derived by the multiplication of the Return on Equity with the Retention Ratio (the opposite of the payout ratio). Again, the divergence is reflected in the Sustainable Growth Rate chart. In addition, the output suggests that Hasbro could grow as much as 18% before it needs to borrow more money to fund its growth. On the other hand, Mattel would have to deleverage at its current growth rate.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2017/9/5/saupload_e7c931ab4a2e041a2e79d19a9dab6d07.png\" class=\"sa-ycharts-img\" alt=\"Chart\" data-width=\"635\" data-height=\"534\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"><em>HAS data by YCharts</em></p> <p class=\"paywall-full-content invisible\">Using a more commonly used method, the share price of Hasbro has also been trading below the fair value based on the average of its <a href=\"https://ycharts.com/glossary/terms/pe_value\" rel=\"nofollow\">P/E Value</a> and <a href=\"https://ycharts.com/glossary/terms/ps_value\" rel=\"nofollow\">P/S Value</a>. The P/E Value is calculated by multiplying the trailing-twelve-months EPS with the annual median price of each of the past five years and dividing it by the EPS for the corresponding year. The P/S Value is calculated by multiplying the trailing-twelve-months (TTM) sales per share figure with the 3-year historical average of the annual median Price/Sales ratios. Since the 2Q of 2016 Hasbro has traded below its fair value, but the gap has widened considerably in recent weeks. Note that the fair value, currently at $124.20, is likely to increase further after the 3Q results as both the TTM sales and EPS are expected to be higher.</p> <p class=\"paywall-full-content invisible\">On the other hand, Mattel traded above its fair value (calculated using the above-mentioned method) since the 2H of 2015 and through much of 2017. The ongoing correction has finally brought its share price below the calculated fair value. Nevertheless, the current fair value at $17.41 would be revised downwards if Mattel reports weaker sales figures or EPS in the coming results announcement.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2017/9/5/saupload_a9ca25ba2316c8e88e157f2395b8872f.png\" class=\"sa-ycharts-img\" alt=\"Chart\" data-width=\"635\" data-height=\"450\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"><em>HAS data by YCharts</em></p> <h3 class=\"paywall-full-content invisible\">Risk Factors - Movie Flops &amp; Weak Viewership of its Netflix Show</h3> <p class=\"paywall-full-content invisible\">With much of the revenue growth opportunity hinging on the success of the movies, the key risk, of course, is that the movies fail to achieve good ratings. A flop at the box office would negatively impact follow-on interest in the related toys and movie merchandise. Similarly, if viewership for the first show it partnered with Netflix proves to be disappointing, then we should expect shareholders of Hasbro who are lacking confidence in the company to promptly abandon their shares and depress the share price.</p> <p class=\"paywall-full-content invisible\">Hasbro could also face heightened competition from new video and computer games if those become more addictive and more of its customers turn to those forms of entertainment instead. Games with augmented reality or virtual reality might catch on with the improvement in technology and <a href=\"https://www.knowyourmobile.com/android/24406/google-arcore-vs-apple-arkit-ios-11-vs-android-oreo\" rel=\"nofollow\">increasing support for developers</a> by the big players, Google (<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a>)(<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>) and Apple (<a href=\"https://seekingalpha.com/symbol/AAPL\" title=\"Apple Inc.\">AAPL</a>).</p> <h3 class=\"paywall-full-content invisible\">Conclusion</h3> <p class=\"paywall-full-content invisible\">The share price of Mattel has been on a downtrend, given unabated business deterioration. Its dividend cut exacerbated investor bearishness over its shares. However, what's ailing Mattel does not automatically impact Hasbro even though they are in the same industry. On the contrary, Hasbro is in the pink of health as it has undertaken proactive initiatives to grow revenue. Yet, it has been trading below its historical valuations and the gap has widened considerably in recent weeks. It is also trading at an EV/EBITDA ratio that is almost on par with Mattel. There has been some disappointment over its unsuccessful bid for Lions Gate but there have also been positive developments. Hasbro has inked an agreement with Netflix to premiere a new original animated series on the streaming service. With the price appreciation in the recent years, it is understandable that some investors have chosen to take profit on Hasbro. Nevertheless, if you have been waiting to add to your positions or initiate one in a company yielding 2.32% on a five-year dividend growth of 68.2%, the opportunity has emerged.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\"><em>Note from author: Thank you for reading. My articles revolve around a subject or angle that I feel might have been overlooked. If you would like <a href=\"https://seekingalpha.com/author/alt-perspective\">more of such articles</a> and wish to be informed as soon as they are published, please click on the \"Follow\" button below the title near the top of this page and check the \"Get email alerts.\" If you have additional insights on the topic or contrasting views, please kindly share them in the comments section for further discussion. Please also provide your feedback in the comments. Your constructive inputs would help me craft better articles to aid in your analysis.</em></p>", "twitContent": "$HAS $MAT - Hasbro: Value Has Emerged. https://seekingalpha.com/article/4104268-hasbro-value-emerged?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "102639", "type": "author"}}, "sentiments": {"data": [{"id": "192101", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}, {"id": "1748", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "99", "type": "tag"}, {"id": "571805", "type": "tag"}, {"id": "97", "type": "tag"}]}, "otherTags": {"data": [{"id": "572081", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4104268-hasbro-value-emerged", "canonical": "https://seekingalpha.com/article/4104268-hasbro-value-emerged", "uriImage": "https://static.seekingalpha.com/uploads/2017/9/5/saupload_05521fb849cc6c8850f69f9ab8179863.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2017/9/5/saupload_05521fb849cc6c8850f69f9ab8179863.png"}}}, "included": [{"id": "102639", "type": "author", "attributes": {"company": null, "slug": "alt-perspective", "userId": 44555366, "tagId": 572081, "bio": "<p>I am honored to have been categorized as a 5-Star financial expert and ranked among the top 2% of financial bloggers on TipRanks in 2017/18. For a period, I was among the top 3 “Opinion Leaders” for Insider Ownership and Services, as well as top 5 for Long Ideas and Fund Holdings. I am an avid reader of market news and company publications with the aim of improving my investment acumen. I enjoy expressing my findings and opinions through writings. My appreciation and understanding of business strategies improved to a whole new level since completing an MBA (Distinction) from a FT100 MBA school. I have worked in companies with businesses that span multiple industries, according me with the exposure to a myriad of sectors.</p><p>Check out my Author's Picks and over 190 Editor's Picks, among the highest in Seeking Alpha, if not the most.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/044/555/366/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/044/555/366/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/044/555/366/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/044/555/366/extra_large_pic.png"}, "nick": "ALT Perspective", "deactivated": null, "memberSince": 2015, "isRss": false, "contributorSince": 2017, "followersCount": 19098}, "relationships": {"user": {"data": {"id": "44555366", "type": "user"}}, "userBioTags": {"data": [{"id": "985876", "type": "userBioTag"}, {"id": "985877", "type": "userBioTag"}, {"id": "985878", "type": "userBioTag"}, {"id": "985879", "type": "userBioTag"}, {"id": "985880", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/alt-perspective", "profileUrl": "/author/alt-perspective", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "1748", "type": "tag", "attributes": {"slug": "mat", "name": "MAT", "company": "Mattel, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MAT"}}, {"id": "99", "type": "tag", "attributes": {"slug": "lgf.a", "name": "LGF.A", "company": "Lions Gate Entertainment Corp.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/LGF.A"}}, {"id": "571805", "type": "tag", "attributes": {"slug": "lgf.b", "name": "LGF.B", "company": "Lions Gate Entertainment Corp.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/LGF.B"}}, {"id": "97", "type": "tag", "attributes": {"slug": "nflx", "name": "NFLX", "company": "Netflix, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/NFLX"}}, {"id": "572081", "type": "tag", "attributes": {"slug": "alt-perspective", "name": "ALT Perspective", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/alt-perspective"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "192101", "type": "sentiment", "attributes": {"articleId": 4104268, "type": "bullish", "createdAt": "2017-09-05T16:36:30.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4104268", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}