{"data": {"id": "4114269", "type": "fullArticle", "attributes": {"publishOn": "2017-10-18T11:30:34-04:00", "isLockedPro": false, "commentCount": 7, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"the-dividend-bro": {"id": 558046, "slug": "the-dividend-bro", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-quick-picks-lists": {"id": 17428, "slug": "dividend-quick-picks-lists", "kind": "breadcrumb", "path": "/dividends/dividend-quick-picks", "title": "Dividend Quick Picks", "sasource": "theme_breadcrumb"}, "utx-defunct-2436": {"id": 2436, "slug": "utx-defunct-2436", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}}, "title": "2 Dividend Paying Companies Worth Considering", "summary": ["United Technologies is on the cusp of becoming a Dividend Champion.", "UTX gets 46% of its revenues from aftermarket services. This offers the company a lot of reoccurring revenue.", "Hasbro's stock has performed very well this year, as the company trails just rival Mattel in the toy sector.", "HAS has licensing agreements with key film series like Star Wars, Frozen and Marvel."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2017-10-18T19:23:05-04:00", "isModerated": false, "closestTradingDate": "2017-10-18", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long DIS.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>When I'm not playing peek-a-boo with my 4-month old son, watching my Michigan based sport teams or teaching students the finer points of dodge ball, I'm researching stocks that my wife and I own or could possibly own in the future. The most important thing that I am looking for in a stock I want to own is the stability of the company's business. Are its products in demand? Is there a reason their products are sought after? After that, I want to make sure that the company has a history of dividend growth, with attractively yearly increases. I don't require that the stocks we own in the March to Freedom fund have a set number of years of dividend growth, I just want to see some sort of commitment to rewarding shareholders with annual raises. In my research, I've started looking at the following stocks for purchase.</p> <p><strong>United Technologies</strong> (<a href=\"https://seekingalpha.com/symbol/UTX\">UTX</a>)</p> <span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <tr> <td><p>Current Yield</p></td> <td><p># Years div growth</p></td> <td><p>5 Year Div Growth Rate</p></td> </tr> <tr> <td><p>2.35%</p></td> <td><p>24</p></td> <td><p>7.00%</p></td> </tr> <tr> <td><p>CFRA 12-month price target</p></td> <td><p>CFRA Fair Value</p></td> <td><p>Morningstar Fair Value</p></td> </tr> <tr> <td><p>$133</p></td> <td><p>$123.47</p></td> <td><p>$134</p></td> </tr> <tr> <td><p>F.A.S.T Graphs Current PE</p></td> <td><p>F.A.S.T Graphs 5 Year Avg PE</p></td> <td><p>Price Target</p></td> </tr> <tr> <td><p>18</p></td> <td><p>16</p></td> <td><p>Under $134</p></td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p>United Technologies has four main operating segments. The largest of the 4 segments is the Climate, Control and Security division, or CCS. CCS was responsible for 29% of last year' sales and according to CFRA, is the leading provider for HVAC and refrigeration in the world. 55% of this divisions sales come from outside the United States. CCS's Carrier products are used for climate control systems for residential, commercial and industrial customers. UTX's security and fire safety products are found around the globe, providing intruder alarms, control systems and video surveillance for both commercial and retail purposes. Some of the company's fire safety products include portable fire extinguishers and detectors as well as fixed fire suppression safety<span class=\"paywall-full-content invisible\"> systems.</span></p> <p class=\"paywall-full-content invisible\">Otis, which made up 21% of last year's sales, is the world's largest maker of elevators and escalators. With 2.5 million installed elevators and escalators around the world, Otis has allowed UTX to capitalize on the economic growth and urbanization of emerging markets. As these economies grow stronger, the need for building construction should grow. An added benefit to this large install base is that these products will need aftermarket care. When the elevators and escalators require service, Otis provides the service. This creates a reoccurring revenue for UTX.</p> <p class=\"paywall-full-content invisible\">UTX's Pratt &amp; Whitney division is a major supplier of aircraft engines. This division makes up more than a quarter of the company's sales (26%). Pratt &amp; Whitney produces engines for wide and narrow-body airplanes. P&amp;W also supplies engines used in military fighter planes and transport aircraft. With almost 13,000 commercial engines and 7,500 military engines in use today, UTX has a large pool of engines that will need to be repaired and replaced over time. As with Otis, P&amp;W provides after-market care, which allows UTX to accrue more revenue as engines require maintenance.</p> <p class=\"paywall-full-content invisible\">Aerospace systems account for 24% of sales and supplies aerospace products for diversified industries around the globe. Products from this division include: electric power generation, management and distribution systems, flight and engine control systems, engine components, surveillance and reconnaissance systems and many other technologically advanced items. These products are used for commercial, military, space and undersea purposes. As with the company's other division, products sold from the aerospace segment require repair and updating. The following graphic from the company's web site sums up the breakdown of sales for United Technologies.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2017/10/1104349_15082801764522_rId5.png\" rel=\"lightbox\" data-width=\"836\" data-height=\"375\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2017/10/1104349_15082801764522_rId5_thumb.jpg\" data-width=\"640\" data-height=\"287\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></span></p> <p class=\"paywall-full-content invisible\">Altogether, 54% of United Technologies' sales are from the selling or products, with 46% of sales coming from aftermarket repairs and updating. Being a world leader in all four of the company's main segments means that UTX's products are the first choice by many businesses. I also really like that the company has such a large stream of reoccurring revenue. These products need to be repaired from time to time and customers are going to seek out the company that originally installed the product to repair it.</p> <p class=\"paywall-full-content invisible\">On 9/4/2017, United Technologies agreed to purchase Rockwell Collins (<a href=\"https://seekingalpha.com/symbol/COL\">COL</a>) for $30 billion in cash, stock and debt. Morningstar and CFRA predict that the deal should close in the 3 rd quarter of 2018. Rockwell Collins provides products such as avionics systems, cockpit controls, navigation and in-flight entertainment systems found in commercial and military aircraft. Many of these products require maintenance for the life of the craft. We will probably hear more about this purchase when United Technologies releases its 3 rd quarter earnings report on 10/24/2017.</p> <p class=\"paywall-full-content invisible\">With another year of dividend growth, United Technologies' dividend growth streak will reach 25 years. This will make the company a \"Dividend Champion\". A pretty impressive feat for the industrial company. The average dividend raise over the past 5 years is 7%, with the most recent increase coming in at 6.06%.</p> <p class=\"paywall-full-content invisible\">Looking at F.A.S.T. Graphs you can see that the stock of UTX currently sports a price to earnings multiple of 18. The average PE over the past 5 years has been 16, making the stock of UTX overvalued by more than 11% today. CFRA sets a $133 price target, putting the stock at almost 12% undervalued based off Monday's closing price of $119.01. CFRA's fair value is $123.47, making the stock 3.75% undervalued. Morningstar is a bit more bullish, saying they see fair value of UTX stock at $134. By this measure, the stock is currently trading at a 12.60% discount to fair value. Average these numbers out and I find shares of United Technologies to be 4.25% undervalued. The company is within striking distance of becoming a Dividend Champion and as such, I would be willing to overpay to acquire shares of UTX. Any price under $134 and I'd be comfortable buying shares of United Technologies.</p> <p class=\"paywall-full-content invisible\"><strong>Hasbro</strong> (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>)</p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <tr> <td><p>Current Yield</p></td> <td><p># Years div growth</p></td> <td><p>5 Year Div Growth Rate</p></td> </tr> <tr> <td><p>2.35%</p></td> <td><p>14</p></td> <td><p>11.60%</p></td> </tr> <tr> <td><p>CFRA 12-month price target</p></td> <td><p>CFRA Fair Value</p></td> <td><p>Morningstar Fair Value</p></td> </tr> <tr> <td><p>$110</p></td> <td><p>$90.90</p></td> <td><p>$98</p></td> </tr> <tr> <td><p>F.A.S.T Graphs Current PE</p></td> <td><p>F.A.S.T Graphs 5 Year Avg PE</p></td> <td><p>Price Target</p></td> </tr> <tr> <td><p>19.7</p></td> <td><p>16.7</p></td> <td><p>Under $101</p></td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2017/10/1104349_15082801764522_rId6.png\" data-width=\"575\" data-height=\"171\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Hasbro trails only Mattel (<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a>) in terms of sales for leisure and entertainment goods. Hasbro produces many well-known toy brands, such as Transformers, G.I. Joe, Nerf, Battleship, Play-Doh, My Little Pony, Monopoly, Playskool and Magic: The Gathering. The company also has licensing agreements with Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>) for popular films such as The Avengers, Spider-Man, Star Wars and Frozen. HAS also has the rights to produce Sesame Street related items. Hasbro licenses the rights to these characters, films and comics to makers of apparel, publishing and home goods. These items are not products that compete with Hasbro's, so the company is able to earn royalty income from t-shirts, backpacks and lunch boxes without risking their products to cannibalization from another toy company.</p> <p class=\"paywall-full-content invisible\">Hasbro's has four major product categories: boys' toys (37% of revenues), games (27% of revenues), girls' toys (24% of revenue) and preschool toys (12% of revenues). By expanding operations into China, Brazil and other countries, Hasbro has become a global leader in the toy manufacturing business. Almost half (49%) of revenues come from international operations.</p> <p class=\"paywall-full-content invisible\">As children around the world are moving away somewhat from traditional toys in favor of electronic devices and games, Hasbro has done well to keep up these trends. In a deal with Electronic Arts (<a href=\"https://seekingalpha.com/symbol/EA\" title=\"Electronic Arts Inc.\">EA</a>), games for mobile phones and game consoles are being developed based on the company's popular products, such as G.I. Joe, Nerf and Monopoly. By focusing on digital gaming, HAS is positioned to keep up with the modern child's playtime choices while also promoting its key brands. In a separate deal with Discovery Communications (<a href=\"https://seekingalpha.com/symbol/WBD\">DISCK</a>), Hasbro has a 40% stake in \"The Hub\", a family friendly television network that provides programming based off of Hasbro's toy lines. These two deals allow Hasbro to bring their products into the homes of children across the country while also keeping up with their interests. By exposing them to the company's games and products in a digital platform, Hasbro stands to reap the benefits of what are essentially advertisements for their goods.</p> <p class=\"paywall-full-content invisible\">As you can see from the image from Google Finance, Hasbro's stock has performed much better this year than its chief rival Mattel. Hasbro's stock is up almost 25% year to date, while Mattel's stock has lost more than 43%% (it should be noted that Hasbro is down 16% from its 52-week high of $116.20).</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2017/10/1104349_15082801764522_rId7.png\" rel=\"lightbox\" data-width=\"734\" data-height=\"378\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2017/10/1104349_15082801764522_rId7_thumb.jpg\" data-width=\"640\" data-height=\"330\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">The popularity of Hasbro's products along with the company's ability to adapt in a changing toy landscape has me considering purchasing the stock. I'm looking forward to the company's earnings release on 10/20/2017 for more information into the state of Hasbro's business.</p> <p class=\"paywall-full-content invisible\">Hasbro has raised their dividend for 14 consecutive years. A company that is willing to make the commitment to increase their dividend for a long period of time is one that I want to partner with. The average raise over the past 5 years has been well north of 11%, with the most recent raise coming in at 11.76%. That is the highest raise since 2013. This is something dividend growth investors should take note of. Shares currently yield 2.35%.</p> <p class=\"paywall-full-content invisible\">F.A.S.T. Graphs says the current PE of 19.7 is about 15.23% above the 5 year average PE of 16.7. CFRA sees a 1-year price target of $110, which would make the stock 13.25% undervalued based on the 10/16/2017 closing price of $97.13. CFRA's fair value is $90.90, which means shares are trading at a 6.4% premium to fair value. Morningstar places a $98 fair value on the stock. This means Morningstar sees the stock at just about fairly valued. Average these numbers out and I find the stock of Hasbro to be almost 2% overvalued. With more than a decade of dividend growth behind it, I am willing to over pay for Hasbro to the tune of 5% over fair value. Any price under $101 and I would consider buying shares of HAS.</p> <h3 class=\"paywall-full-content invisible\"><strong>Conclusion</strong></h3> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">United Technologies and Hasbro might compete in wildly different sectors of the economy, but both have products and goods that customers like. Both sell their products to countries around the world. United Technologies has a large install base for many of its goods, providing for ample opportunity to earn reoccurring revenue for the updating and repairing that these products require over time. Hasbro has used digital media and games to help bring their toys and games to children all over the world. We don't yet own either of these companies, but they are definitely on our watch list for purchase. Feel free to leave a comment below. If you enjoyed this article, please consider hitting the \"follow\" button at the top of the page. Thank you for reading.</p>", "twitContent": "$UTX-DEFUNCT-2436 $HAS - 2 Dividend Paying Companies Worth Considering. https://seekingalpha.com/article/4114269-2-dividend-paying-companies-worth-considering?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "98446", "type": "author"}}, "sentiments": {"data": []}, "primaryTickers": {"data": [{"id": "2436", "type": "tag"}, {"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "558046", "type": "tag"}, {"id": "17428", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4114269-2-dividend-paying-companies-worth-considering", "canonical": "https://seekingalpha.com/article/4114269-2-dividend-paying-companies-worth-considering", "uriImage": "https://static.seekingalpha.com/uploads/2017/10/1104349_15082801764522_rId5.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2017/10/1104349_15082801764522_rId5.png"}}}, "included": [{"id": "98446", "type": "author", "attributes": {"company": null, "slug": "the-dividend-bro", "userId": 1104349, "tagId": 558046, "bio": "<p>I've written about investing for Seeking Alpha since 2015 and for Sure Dividend since 2018. I focus primarily on owning shares of companies that have demonstrated long histories of dividend growth. These types of companies have largely proven successful at raising dividends through multiple recessionary periods, a sign that their business models are strong enough to withstand a downturn in the economy. </p><p>We are long: </p><p>Energy: CVX </p><p>Finance: JPM AFL MA V TD</p><p>Industrials: LMT MMM HON CMI GD RTX CAT SWK UPS</p><p>Teleco: T VZ</p><p>Consumer Staples: KO PG GIS PEP MKC DG COST UL</p><p>Consumer Discretionary: SBUX DIS NKE TGT VFC MCD HD LOW</p><p>Tech: MSFT APPL CSCO ADP GOOGL</p><p>Healthcare : ABBV ABT JNJ CVS SYK PFE AMGN </p><p>REITs: O WPC</p><p>Utilities: D SO NEE DUK</p><p>CEF: BME ETV</p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/001/104/349/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/001/104/349/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/001/104/349/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/001/104/349/extra_large_pic.png"}, "nick": "The Dividend Bro", "deactivated": null, "memberSince": 2012, "isRss": false, "contributorSince": 2015, "followersCount": 4531}, "relationships": {"user": {"data": {"id": "1104349", "type": "user"}}, "userBioTags": {"data": [{"id": "920306", "type": "userBioTag"}, {"id": "920307", "type": "userBioTag"}, {"id": "920308", "type": "userBioTag"}, {"id": "920309", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/the-dividend-bro", "profileUrl": "/author/the-dividend-bro", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2436", "type": "tag", "attributes": {"slug": "utx-defunct-2436", "name": "UTX", "company": "United Technologies Corporation", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": true, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/UTX-DEFUNCT-2436"}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/HAS"}}, {"id": "558046", "type": "tag", "attributes": {"slug": "the-dividend-bro", "name": "The Dividend Bro", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/the-dividend-bro"}}, {"id": "17428", "type": "tag", "attributes": {"slug": "dividend-quick-picks-lists", "name": "Dividend Quick Picks & Lists", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-quick-picks-lists"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}]}