{"data": {"id": "4125870", "type": "fullArticle", "attributes": {"publishOn": "2017-11-17T07:08:50-05:00", "isLockedPro": false, "commentCount": 20, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"alt-perspective": {"id": 572081, "slug": "alt-perspective", "kind": "common", "non_theme": true}, "m-n-a": {"id": 532656, "slug": "m-n-a", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "mat": {"id": 1748, "slug": "mat", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "macro-view": {"id": 12627, "slug": "macro-view", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro-Mattel Merger: Key Stumbling Blocks", "summary": ["Mattel has rejected the initial takeover proposal by Hasbro on price and antitrust concerns.", "I laid out the arguments against antitrust as a stumbling block and suggest the new executive team at Mattel would be the actual obstacle.", "As a shareholder of Hasbro, I would prefer not to see such a buy-at-all-cost scenario due to apparently stiff challenges at Mattel, which might not be easy to overcome."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2017-11-17T07:08:50-05:00", "isModerated": false, "closestTradingDate": "2017-11-17", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long DIS, HAS.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<div> <h3>Hasbro's Latest Takeover Approach For Mattel</h3> <p>The Wall Street Journal <a href=\"https://www.wsj.com/articles/hasbro-makes-takeover-approach-to-mattel-1510351281\" rel=\"nofollow\">reported </a>late Friday (November 10, 2017) that Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) made a takeover proposal for Mattel (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a></span>). This was confirmed yesterday when Reuters reported that Mattel has rejected the overture. The reasons given were rather diplomatic. First, it was the expected “offer is too low” factor. The second reason was also rather logical, which was the possible objection to a deal by the regulators on anti-competitive grounds. Such responses were anticipated and discussed every time there were speculations of a merger/acquisition between the two toy powerhouses.</p> <h3>A Recap Of Past Discussions</h3> <p>In February this year, rumors of a merger started floating around. I wrote about how such speculations had been <a href=\"https://seekingalpha.com/article/4044771-hasbro-mattel-merger-speculation-will-barbie-say-yes-to-g-i-joe\">surfacing now and then as early as 1996</a>. At that time, Mattel was the larger of the two and it was the willing party. Alan Hassenfeld, then chairman at Hasbro, was accused of complicating the transaction through political maneuvers and premature comments to the media. The deal was eventually called off. Fast forward to February 2017, Mattel was trading at around $26 per share and its enterprise value was just $2.3 billion lower than Hasbro or 82 percent of the latter.</p> <p>Any deal then could still be arguably considered as a merger of equals based on EV, even though several operating metrics such as ROIC clearly attributed Hasbro as the leader by far. Recently, the EV gap widened to $4.3 billion before narrowing to $3.5 billion at the time of writing following the share price jump after the takeover news.</p> <img src=\"https://static.seekingalpha.com/uploads/2017/11/16/saupload_7313d15bfdccec6ca757152973063b66.png\" class=\"sa-ycharts-img\" alt=\"Chart\" data-width=\"635\" data-height=\"366\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"><a href=\"https://ycharts.com/companies/HAS/enterprise_value\" rel=\"nofollow\">HAS Enterprise Value</a> data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a><h3>The Perennial Antitrust Concerns</h3> <p>Inevitably, the issue of antitrust concerns would crop up as the key spoiler in a merger (or acquisition) between Hasbro and Mattel. Thus, it is not surprising the possibility has already been analyzed ad-infinitum. Companies with<span class=\"paywall-full-content invisible\"> vested interest such as Disney (</span><a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\" class=\"paywall-full-content invisible\">DIS</a><span class=\"paywall-full-content invisible\">) could lobby against an M&amp;A between Hasbro and Mattel given that a combined entity would, to a great extent, increase its negotiation power as a toymaker.</span></p> <p class=\"paywall-full-content invisible\">However, the deeper concern for the brand owners is the shrinking pool of neutral toymakers. For instance, <a href=\"https://www.usatoday.com/story/life/movies/2014/09/24/hasbro-frozen-dolls/16161025/\" rel=\"nofollow\">Disney dumped Mattel</a> as a maker of its Princesses doll business because of Mattel's conflict of interest given its own Barbie line. With Hasbro's predominantly boys' toys offerings, Disney felt the company would be more willing to focus on its products. Thus, Hasbro got Disney's doll business. If Hasbro acquires Mattel successfully, the Barbie-Princesses conflict would resurface again. Hasbro would be hard-pressed to convince Disney that it would prioritize the latter's products over its own.</p> <p class=\"paywall-full-content invisible\">Another vocal group would be retailers as they are already having a hard time thanks to the e-commerce onslaught. Particularly, for Toys 'R' Us with its additional <a href=\"https://seekingalpha.com/article/4105059-hasbro-mattel-implications-woes-facing-lego-toys-r-us?source=all_articles_title\">self-inflicted woes</a> due to its high debt burden following its leveraged buyout in 2005, it would be expected to voice its strong concern over such a deal.</p> <p class=\"paywall-full-content invisible\">Nevertheless, I am leaning to the camp believing that the regulators would be kinder to the two U.S. corporations given the changed “child entertainment” landscape. Kids nowadays have so many options to occupy their time. There are, of course, highly engaging digital avenues such as mobile games and videos. Digital game developers have been upping their game (pun intended) where adults and children alike could be absorbed into their games for hours.</p> <p class=\"paywall-full-content invisible\">It is the same for videos where binge-watching has become common, particularly thanks to the prescient recommendations by YouTube (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>)(<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a>). Kids would generally continue watching the television or any screens for that matter for as long as their parents allow them to. YouTube would keep auto-playing the next video, which would almost always be something that is captivating to the kids.</p> <p class=\"paywall-full-content invisible\">In what is apparently a recent phenomenon, parents are <a href=\"https://www.straitstimes.com/singapore/education/starting-from-pre-school-parents-sending-kids-for-classes-in-race-to-keep-up\" rel=\"nofollow\">increasingly</a> sending their children for enrichment activities. This is a result of the <a href=\"https://www.straitstimes.com/opinion/tuition-has-become-an-educational-arms-race\" rel=\"nofollow\">hyper-competitive</a> employment market and parents felt the obligation to be <a href=\"https://books.google.com.sg/books?id=2YkkDQAAQBAJ&amp;printsec=frontcover\" rel=\"nofollow\">proactive </a>in <a href=\"https://eric.ed.gov/?id=EJ779545\" rel=\"nofollow\">preparing</a> their children for the future. This further reduces the available time kids have to play with physical toys. Recall that U.S. President Donald Trump campaigned to allow lower-income families to <a href=\"https://blogs.edweek.org/edweek/campaign-k-12/2017/11/trump_campaign_promises_one_year_choice_education_department.html\" rel=\"nofollow\">fund accounts</a> for \"child enrichment activities\" with money from the Earned Income Tax Credit.</p> <p class=\"paywall-full-content invisible\">Given such multi-angled pressures on the toy market, I believe regulators would pass a deal between Hasbro and Mattel when it comes to judgment time. Furthermore, President Trump's <a href=\"https://www.wsj.com/articles/donald-trumps-pro-business-stance-inspires-but-economic-growth-isnt-assured-1483551580\" rel=\"nofollow\">pro-business stance</a> and America-First policy should support a stronger Hasbro-Mattel entity if the proponents can argue the need to do so to compete better against global entertainment giants such as Denmark's Lego and Japan's Nintendo (<a href=\"https://seekingalpha.com/symbol/NTDOY\">OTCPK:NTDOY</a>)(<a href=\"https://seekingalpha.com/symbol/NTDOF\">OTCPK:NTDOF</a>).</p> <p class=\"paywall-full-content invisible\">There are also new formidable upstarts such as Chinese robot maker, UBTech Robotics, which makes even a combined Hasbro-Mattel entity look less intimidating. The company makes humanoid robots such as the US$300 Star Wars First Order Stormtrooper Robot, which was <a href=\"https://www.scmp.com/tech/start-ups/article/2120046/chinese-maker-star-wars-robot-close-raising-us400m-largest-funding\" rel=\"nofollow\">developed</a> in partnership with Disney. Disney owns Lucasfilm, the film and television production company behind the Star Wars franchise.</p> <p class=\"paywall-full-content invisible\">Users can download mobile phone apps, an app for an augmented reality game linked to the robots. UBTech Robotics was reported to be close to completing its series C funding round led by Tencent (<a href=\"https://seekingalpha.com/symbol/TCEHY\">OTCPK:TCEHY</a>)(<a href=\"https://seekingalpha.com/symbol/TCTZF\">OTCPK:TCTZF</a>), which could value the Shenzhen-based company at about $4 billion. A staggering amount for a pre-IPO company.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2017/11/16/44555366-1510861285530551.jpg\" alt=\"UBTech Robotics Star Wars First Order Stormtrooper\" width=\"476\" height=\"434\" data-width=\"476\" data-height=\"434\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\">(Source: UBTech Robotics)</p> <h3 class=\"paywall-full-content invisible\">Mattel’s Inhibitions For A Deal</h3> <p class=\"paywall-full-content invisible\">CEO Margo Georgiadis is new to the job. She was appointed just in January this year. It won’t look good on the former Google executive if she has to leave prematurely without proving herself capable of turning Mattel around. Hence, she might put on a persuasive pitch somehow to the board of directors to reject a sale to Hasbro or any other companies. To her favor, the executives and the directors are expected to show a natural disdain for a deal at a time when the company is apparently being undervalued by the market.</p> <p class=\"paywall-full-content invisible\">In April when the share price was $22.60, I argued that despite her likely reluctance, it was in her interest to initiate talks with Hasbro for a <a href=\"https://seekingalpha.com/article/4064315-mattel-worsening-performance-necessitates-merger-hasbro?source=all_articles_title\">merger before a further deterioration</a> in her bargaining power as Mattel's market valuation continued to decline:</p> <blockquote class=\"paywall-full-content invisible\"><p>\"While Mattel's share price has already seen several rounds of bloodletting, unless it can reverse the inventory-revenue antagonistic trend mentioned earlier, profit boosts from sporadic events such as Cars 3 might prove ephemeral and unconvincing for investors to pile into the stock.\"</p></blockquote> <p class=\"paywall-full-content invisible\">Half a year passed and the inventory-revenue antagonistic movement actually worsened at Mattel. In other words, inventories continued to rise even as the revenue declined. The management can give whatever explanation for this phenomenon but any logical person would know this cannot be desirable for the business. The company had previously said an inventory buildup in the second quarter was partly <a href=\"https://seekingalpha.com/article/4064315-mattel-worsening-performance-necessitates-merger-hasbro\">due to the Disney movie</a>, Cars 3, which was screened in the theaters from June.</p> <p class=\"paywall-full-content invisible\">However, the situation did not improve in the third quarter and, in fact, the inventory level jumped to a record high. How much of the inventory is due to unsaleable merchandise is unknown but it is definitely something that the company should fix in its bid to make the company more attractive to investors and consequently derive a higher valuation before it considers a sale.</p> <img src=\"https://static.seekingalpha.com/uploads/2017/11/16/saupload_8a353ab41c9ca47743ef4dd79152671a.png\" class=\"sa-ycharts-img paywall-full-content invisible\" alt=\"Chart\" data-width=\"635\" data-height=\"366\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"><a href=\"https://ycharts.com/companies/MAT/revenues_ttm\" rel=\"nofollow\" class=\"paywall-full-content invisible\">MAT Revenue (TTM)</a><span class=\"paywall-full-content invisible\"> data by </span><a href=\"https://ycharts.com\" rel=\"nofollow\" class=\"paywall-full-content invisible\">YCharts</a><p class=\"paywall-full-content invisible\">I have previously <a href=\"https://seekingalpha.com/article/4085447-mattel-hasbro-merger-getting-improbable\">cited cultural differences </a>as a potential stumbling block to a merger/acquisition for the two toy titans. In April, Richard Dickson, the President and Chief Operating Officer of Mattel, described Margo's short stint then as already having an \"immediate impact on our strategic thinking, our operational execution and our culture\" during the first quarter 2017 earnings conference call.</p> <p class=\"paywall-full-content invisible\">Staff morale at Mattel could be adversely impacted in the event of another cultural change so quickly if Hasbro's current takeover bid is successful. However, I view the slate of new executives raring to prove their capabilities to be a stronger factor in rejecting a deal. The chief technology officer, chief communication officer, and chief people officer are all appointed only recently.</p> <h3 class=\"paywall-full-content invisible\">Conclusion</h3> <p class=\"paywall-full-content invisible\">Hasbro's motivation for an acquisition at this moment is obvious. Its valuation has reached new heights this year while Mattel plumbed to new multi-year lows. Hence, in terms of the valuation gap, this year is proving to be the best time for a deal. The impetus to do so is getting clearer by the day. Competition of kids' attention is intensifying and the entertainment options are not only limited to physical toys. Gadget makers still in startup mode are already coming in strong at Hasbro's target customers. Therefore, a key obstacle to a potential M&amp;A - a blockage on antitrust grounds by regulators - would probably be a weak one.</p> <p class=\"paywall-full-content invisible\">On the other hand, a rejection by Mattel's new executive team raring to prove themselves would be the more likely reason for a failed deal. That is unless Hasbro can offer the shareholders a compelling valuation for Mattel that the board of directors cannot refuse. As a shareholder of Hasbro, I would prefer not see such a buy-at-all-cost scenario happening in light of the deteriorating metrics at Mattel despite ongoing efforts to turnaround the company, suggesting stiff challenges at the toymaker, which might not be easy to overcome.</p> <p class=\"paywall-full-content invisible\"><strong>Do you agree?</strong> Share your thoughts with the Seeking Alpha community!</p> <p class=\"paywall-full-content invisible\">A<em>uthor's Note: Thank you for reading. If you would like a refreshing take on stocks that you own or are interested in, <a href=\"https://seekingalpha.com/author/alt-perspective\">try looking here</a>. If you wish to be informed as soon as they are published, please click on the \"Follow\" button below the title.</em></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\"><em>If you like this article, please let me know by leaving a comment. Otherwise, kindly provide constructive feedback to help me craft better articles to aid in your analysis.</em></p> </div>", "twitContent": "$HAS $MAT - Hasbro-Mattel Merger: Key Stumbling Blocks. https://seekingalpha.com/article/4125870-hasbro-mattel-merger-key-stumbling-blocks?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "102639", "type": "author"}}, "sentiments": {"data": []}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}, {"id": "1748", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "572081", "type": "tag"}, {"id": "532656", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "12627", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4125870-hasbro-mattel-merger-key-stumbling-blocks", "canonical": "https://seekingalpha.com/article/4125870-hasbro-mattel-merger-key-stumbling-blocks", "uriImage": "https://static.seekingalpha.com/uploads/2017/11/16/saupload_7313d15bfdccec6ca757152973063b66.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2017/11/16/saupload_7313d15bfdccec6ca757152973063b66.png"}}}, "included": [{"id": "102639", "type": "author", "attributes": {"company": null, "slug": "alt-perspective", "userId": 44555366, "tagId": 572081, "bio": "<p>I am honored to have been categorized as a 5-Star financial expert and ranked among the top 2% of financial bloggers on TipRanks in 2017/18. For a period, I was among the top 3 “Opinion Leaders” for Insider Ownership and Services, as well as top 5 for Long Ideas and Fund Holdings. I am an avid reader of market news and company publications with the aim of improving my investment acumen. I enjoy expressing my findings and opinions through writings. My appreciation and understanding of business strategies improved to a whole new level since completing an MBA (Distinction) from a FT100 MBA school. I have worked in companies with businesses that span multiple industries, according me with the exposure to a myriad of sectors.</p><p>Check out my Author's Picks and over 190 Editor's Picks, among the highest in Seeking Alpha, if not the most.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/044/555/366/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/044/555/366/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/044/555/366/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/044/555/366/extra_large_pic.png"}, "nick": "ALT Perspective", "deactivated": null, "memberSince": 2015, "isRss": false, "contributorSince": 2017, "followersCount": 19098}, "relationships": {"user": {"data": {"id": "44555366", "type": "user"}}, "userBioTags": {"data": [{"id": "985876", "type": "userBioTag"}, {"id": "985877", "type": "userBioTag"}, {"id": "985878", "type": "userBioTag"}, {"id": "985879", "type": "userBioTag"}, {"id": "985880", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/alt-perspective", "profileUrl": "/author/alt-perspective", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "1748", "type": "tag", "attributes": {"slug": "mat", "name": "MAT", "company": "Mattel, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MAT"}}, {"id": "572081", "type": "tag", "attributes": {"slug": "alt-perspective", "name": "ALT Perspective", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/alt-perspective"}}, {"id": "532656", "type": "tag", "attributes": {"slug": "m-n-a", "name": "M&A", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=m-n-a"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "12627", "type": "tag", "attributes": {"slug": "macro-view", "name": "Macro View", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/macro-view"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}]}