{"data": {"id": "4127585", "type": "fullArticle", "attributes": {"publishOn": "2017-11-25T08:58:52-05:00", "isLockedPro": false, "commentCount": 18, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"lutz-muller": {"id": 102761, "slug": "lutz-muller", "kind": "common", "non_theme": true}, "dis": {"id": 86, "slug": "dis", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "mat": {"id": 1748, "slug": "mat", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Why The Mattel/Hasbro Merger Will In All Likelihood Not Happen", "summary": ["Whilst there are economic benefits to this merger, the forces against it are many and  strong.", "Mattel executives, Company shareholders, Disney, the EU Competition Directorate and the national buyers all are likely to be in opposition.", "While Hasbro might eventually win out, it would probably take it years to accomplish this victory."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2017-11-25T08:58:52-05:00", "isModerated": false, "closestTradingDate": "2017-11-27", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>There are a number of factors arguing for the economic benefits of this merger - cost synergies, supply chain economics, enhanced market position, better negotiating leverage, greater license opportunities - but it appears that the forces arrayed against it are too powerful to let it go through. These anti-merger forces are, in short, the top Mattel (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a></span>) executives themselves, the Mattel shareholders, Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>), the European Union and the national buyers of the leading retailers.</p> <h3><strong>Mattel Executives</strong></h3> <p>With the exception of Richard Dickson [the COO] and Peter Gibbons [EVP and Chief Supply Officer] all other top executives have two things in common. One is that they do not know toys from a bar of soap and the second is that they have just been hired and are complete greenhorns as far as their new employer is concerned. This includes the entire top floor - starting with Margo Georgiadis, the CEO, who came on board from Google in February and who in turn hired the CFO, the CTO, the Chief HR person and the Chief Communications Officer in the last few months. They all know that they are toast if taken over since they have nothing to offer which Hasbro does not already have in abundance.</p> <p>As a result, they will fight tooth and nail to thwart this merger.</p> <h3><strong>Shareholder Opposition</strong></h3> <p>Whilst you would assume that the owners of Mattel shares should be overjoyed to have Hasbro buying the company, this is a fallacy. Yes, they would be happy if the price offered would be somewhere close to what the company's share price was only a year ago. If it is not, you can expect very aggressive pushback from shareholders. To quote a much more knowledgeable person than I - \"Both companies would benefit from a merger, but Mattel stockholders might oppose a deal that values the company on its<span class=\"paywall-full-content invisible\"> depressed stock price,\" said Erik Gordon, a professor at the University of Michigan's Ross School of Business.</span></p> <p class=\"paywall-full-content invisible\">To put numbers to this issue - on October 30, 2017, when the rumors first surfaced, the share price stood at $13.12 and this compares to the $30.46 a year earlier. It is unlikely that Hasbro will in fact be able to even get close to this number since there are three significant factors not yet included in the most recent Mattel Balance Sheet. One is the ToysRUs bankruptcy where Mattel's pre-chapter receivables stand at $135 million. People at ToysRUs have mentioned that they do not see a settlement of pre-DIP receivables at much more than 25 cents in the Dollar. If accurate, and if Mattel had no insurance to cover this loss, they could be hit to the tune of $100 million.</p> <p class=\"paywall-full-content invisible\">The second factor is the MGA Entertainment lawsuit against Mattel. The jury trial in connection with the Trade Secret Misappropriation case is scheduled for next year and, given the recent history of the case, there is a good chance that MGA will win again. Given the fact that MGA's claim is for about $ 1billion this could materially affect next year's earnings.</p> <p class=\"paywall-full-content invisible\">You have two mandates colliding. Mattel shareholders will expect a very high price per share because this is what the company is inherently worth given its brands, its retailer reach worldwide, its supply chain skills, its sales expertise, and its many pretty undervalued other assets. On the other hand, Hasbro shareholders will expect a price that takes into account real earnings and real cash flow over the next twelve to twenty-four months and this means a very low number.</p> <p class=\"paywall-full-content invisible\">In short, expectations and reality may just not be compatible in this particular case.</p> <h3 class=\"paywall-full-content invisible\"><strong>Opposition from the side of Disney</strong></h3> <p class=\"paywall-full-content invisible\">Disney has consistently opposed any move from the side of Hasbro that could reduce its leverage over its main licensee. This has been shown very clearly on two occasions. One was Hasbro's attempt to buy <span>DreamWorks Animation. This was at the same time the negotiations regarding the transfer of the Princess license were ongoing. Disney made it very clear that this transfer was not going to happen if Hasbro persisted in its efforts to buy <span>DreamWorks. Not so surprisingly, Hasbro stopped them and thus got the Princess license. The second time this happened was this year when Hasbro was thinking of buying Lions Gate. Lions Gate is the largest and most successful film studio in North America and its acquisition would have given Hasbro access to film making and hence film licenses independent of Disney. Disney also vetoed this particular deal.</span></span></p> <p class=\"paywall-full-content invisible\">A merger with Mattel would give Hasbro access to major Warner IPs now held by Mattel - Superman, Batman, Wonder Woman, DC Super Hero Girls, Justice League, Fantastic Beasts - and hence would again represent an alternative to Disney's movie brands. It is very likely, therefore, that Disney would also in this instance do everything in their power to stop this merger.</p> <h3 class=\"paywall-full-content invisible\"><strong>Antitrust Opposition</strong></h3> <p class=\"paywall-full-content invisible\">There is the possibility that the Federal Trade Commission would, under the current Administration, oppose the merger but I rate this as somewhat unlikely given their ongoing crusade against regulations affecting business activities. .</p> <p class=\"paywall-full-content invisible\">No, the real veto lies with the European Union and the possible merger of Hasbro and Mattel would clearly be in the province of the EU Competition Directorate headed by Margrethe Vestager. The criterion is that any merger between two companies in a horizontal or vertical competitive relationship, with sales worldwide exceeding Euro 5 billion worldwide or an EU wide turnover of each of the two firms of Euro 250 million or higher, would be investigated by the EU Commission rather than the Monopolies Commission of a member State.</p> <p class=\"paywall-full-content invisible\">There has been a recent example for what can happen, albeit on a much smaller scale and hence restricted to the Authority of a member State - the United Kingdom - in the case of the Leapfrog/VTech merger. Firstly, the U.K. Competition and Markets Authority ordered that any activity designed to merge the two companies had to cease and be reversed until a final finding had been issued. This put a total and worldwide stop to the merger. Finally, the same Authority allowed the merger to proceed after an investigation that lasted for nine months.</p> <p class=\"paywall-full-content invisible\">You can assume that the EU Competition Authority will, too, force a complete halt to any activity designed to put the two companies under one hat and this worldwide. Secondly, you can assume that their deliberations would take as long as, if not longer than what happened in the case of Leapfrog. Finally, according to my sources, the odds are that the final verdict will be negative unless the two companies divest major parts of their business in the Fashion Doll and the Action Figure spaces. In other words, the Competition Directorate will <span>likely prohibit the merger if no adequate remedies to the competition concerns have been proposed by the merging parties. Such a decision could of course be appealed to the Luxembourg-based <em>European</em> Court of Justice. However, this court in most cases tends to side with the Commission rather than the litigant companies.</span></p> <p class=\"paywall-full-content invisible\">In all this, we must not underrate the influence of European toy companies in this issue. Lego, Simba and Geobra/Playmobil are totally opposed to a merger between Hasbro and Mattel as they see this as an existential threat to their business. They will do whatever it takes to stop this merger from happening.</p> <p class=\"paywall-full-content invisible\">Whatever the final outcome may be, the time frame for an appeal to the European Court of Justice is measured in years rather than months and the current Hasbro management is likely to reach retirement age well before they see the end result.</p> <h3 class=\"paywall-full-content invisible\"><strong>Buyer Opposition</strong></h3> <p class=\"paywall-full-content invisible\">National buyers at the large toy retailers - Wal-Mart (<a href=\"https://seekingalpha.com/symbol/WMT\" title=\"Walmart Inc.\">WMT</a>), Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>), ToysRUs, Carrefour and others - dislike monopolies of any kind. The reason is that a monopoly by a vendor lessens the leverage the retailer has in terms of pricing power, promotional allowances, payment terms and so forth. The most recent example of what can happen is in the case of the Leapfrog/VTech merger.</p> <p class=\"paywall-full-content invisible\">Up to that point, the Learning aisle was completely taken by the two companies and the retailers had no problem with this because they saw two competitors vying for their favor and an advantage in terms of shelf position and shelf space. Once it became clear that this merger was going to happen and the two competitors were combining forces, the retailers - presumably independently of each other - began to try to level the playing field again. They did so by luring major toy manufacturers into the Preschool space - Mattel, Spin Master, Melissa &amp; Doug and others - inviting them to bring appropriate products into the Learning aisle.</p> <p class=\"paywall-full-content invisible\">The two companies announced on February 5, 2016, that they had entered into the agreement that VTech would acquire Leapfrog. And this is what happened in terms of shelf space at Wal-Mart, Target and ToysRUs before and after this announcement:</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2017/11/23/435974-15114843456211696.png\" data-width=\"565\" data-height=\"108\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\" fetchpriority=\"high\"></p> <p class=\"paywall-full-content invisible\">Source: Klosters Retailer Panel</p> <p class=\"paywall-full-content invisible\">And this is how things looked in detail on 11/25/2017:</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2017/11/23/435974-15114843751978662.png\" data-width=\"370\" data-height=\"431\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Source: Klosters Retailer Panel</p> <p class=\"paywall-full-content invisible\">What would be the choices the retailers have in the case of a Hasbro/Mattel merger? For one, they could give Lego and Playmobil shelf space in the Action Figure aisle. Secondly, they could invite Simba - whose Steffi Love range is phenomenally successful in Europe - to enter the Fashion Doll space in the U.S. Whatever the retailers finally would choose to do, they would definitely not allow the Hasbro/Mattel combo to monopolize the key toy spaces in their stores.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">In summary, I believe that the odds are stacked against this merger going through anytime soon.</p>", "twitContent": "$HAS $MAT - Why The Mattel/Hasbro Merger Will In All Likelihood Not Happen. https://seekingalpha.com/article/4127585-why-mattel-hasbro-merger-will-in-all-likelihood-not-happen?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "48741", "type": "author"}}, "sentiments": {"data": []}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}, {"id": "1748", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "86", "type": "tag"}]}, "otherTags": {"data": [{"id": "102761", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4127585-why-mattel-hasbro-merger-will-in-all-likelihood-not-happen", "canonical": "https://seekingalpha.com/article/4127585-why-mattel-hasbro-merger-will-in-all-likelihood-not-happen", "uriImage": "https://static.seekingalpha.com/uploads/2017/11/23/435974-15114843456211696.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2017/11/23/435974-15114843456211696.png"}}}, "included": [{"id": "48741", "type": "author", "attributes": {"company": null, "slug": "lutz-muller", "userId": 435974, "tagId": 102761, "bio": "Lutz is an acknowledged expert on the toy space. His clients include one of the top three U.S. banks and one of the top three non-public toy companies worldwide. Between 1984 and 2002, Lutz was the CEO at five different manufacturing companies catering to U.S. and international mass retailers. He's lived on five continents and speaks six languages.<br><br><p><br></p><p>He started his business intelligence consulting practice in 2003 and he derives his information from three primary sources. The first is his proprietary retailer panel, which includes Wal-Mart, Target, J C Penney, Kohl's, Gamestop, Dollar General, Barnes + Noble and Learning Express. This panel provides him with sell-through data, shelf space changes, inventory levels and other pertinent metrics governing the major companies and products active in the two industry categories. The second is national buyers at 30 leading retailers in 17 large country markets. These provide color on trends and issues that have a bearing on the major manufacturers and products in the two industry categories. The last is mainly Chinese third-party manufacturers who provide insights into supply and inventory issues affecting the major companies or products in the two industry categories.<br><br></p><p>Lutz consults with banks and hedge funds, and hence does not trade in any stocks associated with companies active in the spaces he focuses on. Lutz also is a monthly contributor to Seeking Alpha. He also publishes a monthly Toy Newsletter, which can be found on his website, www.klosterstrading.com.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/000/435/974/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/000/435/974/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/000/435/974/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/000/435/974/extra_large_pic.png"}, "nick": "Lutz Muller", "deactivated": null, "memberSince": 2009, "isRss": true, "contributorSince": 2013, "followersCount": 905}, "relationships": {"user": {"data": {"id": "435974", "type": "user"}}, "userBioTags": {"data": [{"id": "110303", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/lutz-muller", "profileUrl": "/author/lutz-muller", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "1748", "type": "tag", "attributes": {"slug": "mat", "name": "MAT", "company": "Mattel, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MAT"}}, {"id": "86", "type": "tag", "attributes": {"slug": "dis", "name": "DIS", "company": "The Walt Disney Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/DIS"}}, {"id": "102761", "type": "tag", "attributes": {"slug": "lutz-muller", "name": "Lutz Muller", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/lutz-muller"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}]}