{"data": {"id": "4286648", "type": "fullArticle", "attributes": {"publishOn": "2019-08-19T13:52:02-04:00", "isLockedPro": false, "commentCount": 26, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"valuentum": {"id": 34650, "slug": "valuentum", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "utilities": {"id": 55, "slug": "utilities", "kind": "sector", "path": "/stock-ideas/utilities", "title": "Utilities ", "non_theme": true, "sasource": "theme_breadcrumb"}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "electric-utilities": {"id": 18029, "slug": "electric-utilities", "kind": "common", "non_theme": true}}, "title": "Dominion Energy Slows Down Payout Growth And We Are Still On The Sidelines", "summary": ["If the US Fed continues cutting interest rates, the utility industry should be a major beneficiary given that the space is largely capital market dependent.\n        ", "In this piece, we cover the nature of the utility industry's financials and how that impacts Dominion Energy Inc.\n        ", "Dominion Energy is slowing down its forecasted payout growth rate to allow for better dividend coverage over time as its operating EPS is expected to grow at a faster rate.\n        ", "For now, we are keeping shares of D on our radar but are staying on the sidelines.\n        "], "structuredInsights": null, "isPaywalled": false, "lastModified": "2019-08-19T13:52:02-04:00", "isModerated": false, "closestTradingDate": "2019-08-19", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 18, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />This article or report and any links within are for information purposes only and should not be considered a solicitation to buy or sell any security. Valuentum is not responsible for any errors or omissions or for results obtained from the use of this article and accepts no liability for how readers may choose to utilize the content. Assumptions, opinions, and estimates are based on our judgment as of the date of the article and are subject to change without notice.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921222518265_origin.png\" rel=\"lightbox\" data-width=\"1109\" data-height=\"832\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921222518265.png\" alt=\"A close up of a map Description automatically generated\" width=\"573\" height=\"430\" data-width=\"640\" data-height=\"480\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></span></p> <p>Image Source: Dominion Energy Inc – <a href=\"https://s2.q4cdn.com/510812146/files/doc_presentations/2019/03/2019-03-25-DE-IR-investor-meeting-general-session-vTCII-website-version.pdf\" rel=\"nofollow\">IR Presentation</a></p> <p><em>By Callum Turcan</em></p> <p>Dominion Energy Inc (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>) is a massive electric and natural gas utility in America that primarily operates in the rate-regulated part of this industry, with some exposure to more conventional market forces via its Cove Point LNG export terminal in Maryland and its merchant power generation segment. Please note that the cash flows of rate regulated utilities are very stable and that these utilities can borrow heavily to grow their rate regulated asset base at leverage levels most industries couldn’t handle outside of say, the REIT or oil and gas infrastructure space.</p> <p>We like Dominion’s shift towards rate regulated utilities and its decent yield, with shares of D yielding 4.7% as of this writing. However, please note management is slowing down Dominion Energy's payout growth rate to allow for a more sustainable dividend policy over time, a strategy we will cover in this article. We are still on the sidelines for now as we are waiting for further signs of how the US Fed plans to proceed given that utilities would be major beneficiaries of lower interest rates.</p> <h2>Background Info on Utilities and Dominion Energy’s Financials</h2> <p>Rate regulated utilities grow by issuing a combination of debt and equity to fund capital expenditure budgets that usually consume most (if not all) of the internally generated funds those companies produce (defined as net operating cash flows). Equity issuances are required to balance out the capital structure of those utility companies as debt issuances alone can quickly lead to leverage problems. For the most part, the capital expenditure budgets of growing utilities are going towards cash flow generating projects, with the regulatory environment ensuring those cash flows are strong enough to support investment in the space.</p> <p>Ultimately, the goal of the utility is<span class=\"paywall-full-content invisible\"> to grow operating EPS (a non-GAAP measure the industry enjoys using) by expanding their rate base while keeping shareholder dilution as tame as possible, with rising operating EPS making per share dividend growth possible. Rising net debt loads grow in tandem with EBITDA generation, allowing for leverage ratios to remain manageable over time assuming everything goes according to plan.</span></p> <p class=\"paywall-full-content invisible\">The rate regulated projects utilities are investing in include anything from adding smart meters to the electricity grid, upgrading natural gas distribution infrastructure and replacing old pipelines, building out new electricity transmission lines and replacing old networks, and constructing new power generating assets in rate regulated electricity markets (as some power markets in the US are “regulated” and some are “deregulated”). Note that power generation projects in “deregulated” regions/states can have their future expected cash flows secured through PPAs, power purchase agreements, which often is the case with green energy projects.</p> <p class=\"paywall-full-content invisible\">From 2006 to 2019 (based on management’s estimates), Dominion Energy sees the rate regulated or like-rate regulated side of its business growing from ~40% to ~95% of total operating income generation as you can see in the graphic below. Total operating income has almost doubled during this period. Please note that ~65 - 70% of Dominion Energy's total operating income comes from rate regulated utilities, ~25 - 30% comes from gas transmission &amp; storage assets that are either regulated by FERC or have stable enough cash flow profiles to be \"regulated-like\" assets (in the eyes of management, we will cover that in more detail later on), and the remainder comes from power generation assets under long-term contracts. </p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921227998266_origin.png\" rel=\"lightbox\" data-width=\"1109\" data-height=\"832\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921227998266.png\" alt=\"A picture containing screenshot Description automatically generated\" width=\"626\" height=\"470\" data-width=\"640\" data-height=\"480\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Image Shown: Dominion Energy has effectively become a near-pure-play on rate regulated natural gas and electric utilities in America. Image Source: Dominion Energy – <a href=\"https://s2.q4cdn.com/510812146/files/doc_presentations/2019/03/2019-03-25-DE-IR-investor-meeting-general-session-vTCII-website-version.pdf\" rel=\"nofollow\">IR Presentation</a></p> <p class=\"paywall-full-content invisible\">While the financial performance of the Cove Point LNG export terminal will clearly be impacted by market forces over the long term, note that some of that risk has been mitigated by Dominion Energy securing the capacity of the project “under long-term fixed reservation fee agreements” but that doesn’t completely remove market pricing risk. From Dominion Energy’s <a href=\"https://s2.q4cdn.com/510812146/files/doc_downloads/annual_meeting/2019/03/Annual-Report-on-Form-10-K.pdf\" rel=\"nofollow\">2018 10-K</a> filing;</p> <blockquote class=\"paywall-full-content invisible\"><p>Cove Point’s gas transportation, LNG import and storage operations, as well as the Liquefaction Project’s capacity are contracted primarily under long-term fixed reservation fee agreements. However, in the future Cove Point may compete with other independent terminal operators as well as major oil and gas companies on the basis of terminal location, services provided and price. Competition from terminal operators primarily comes from refiners and distribution companies with marketing and trading arms. In addition, Cove Point’s Liquefaction Project may face competition on a global scale as international customers explore other options to meet their energy needs.</p></blockquote> <p class=\"paywall-full-content invisible\">Now let’s pivot to Dominion Energy’s cash flow situation. Down in the graphic below is a look at Dominion Energy’s cash flow statement from 2016 to 2018. Note that net operating cash flows were less than capital expenditures in 2016 and 2017, but Dominion Energy did post positive free cash flows in 2018 (when net operating cash flows exceeded capital expenditures). Its annual dividend commitment averaged a bit over $1.9 billion during this three-year period and stood at $2.2 billion in 2018 (outpacing $0.5 billion in free cash flow that year, highlighting Dominion Energy’s need to retain access to capital markets).</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921228318808_origin.png\" rel=\"lightbox\" data-width=\"654\" data-height=\"773\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921228318808.png\" width=\"495\" height=\"585\" alt=\"\" data-width=\"640\" data-height=\"756\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Image Shown: Dominion Energy’s growth strategy leaves little if any free cash flow to cover its annual dividend commitments, which is why the company needs to retain access to capital markets. Image Source: Dominion Energy – <a href=\"https://s2.q4cdn.com/510812146/files/doc_downloads/annual_meeting/2019/03/Annual-Report-on-Form-10-K.pdf\" rel=\"nofollow\">2018 10-K</a> with additions from the author</p> <p class=\"paywall-full-content invisible\">Moody’s Corporation (<a href=\"https://seekingalpha.com/symbol/MCO\" title=\"Moody's Corporation\">MCO</a>) reaffirmed Dominion Energy’s investment grade Baa2 credit rating for its unsecured debt back in <a href=\"https://www.moodys.com/research/Moodys-affirms-Dominion-and-VEPCO-stable-outlooks--PR_392776\" rel=\"nofollow\">December 2018</a> with a stable outlook, but we caution that rating agency noted in early-March 2019 that the troubles facing Dominion Energy and Duke Energy Corporation’s (<a href=\"https://seekingalpha.com/symbol/DUK\" title=\"Duke Energy Corporation\">DUK</a>) Atlantic Coast Pipeline <a href=\"https://atlanticcoastpipeline.com/about/default.aspx\" rel=\"nofollow\">project</a> pose a risk to Dominion Energy’s credit profile. The <a href=\"https://investors.dominionenergy.com/fixed-income/dominion-energy/default.aspx\" rel=\"nofollow\">big three</a> agencies all rate Dominion Energy’s unsecured debt as investment grade (Baa2/BBB/BBB+) with stable outlooks, indicating the company should retain relatively easy access to capital markets as things stand today. A lower interest rate environment, courtesy of the US Fed in particular, could be a major boon for Dominion Energy (with room for upside if rates keep moving lower as Dominion Energy's cost of debt will likely move lower as well).</p> <p class=\"paywall-full-content invisible\">Dominion Energy plans to put downward pressure on its annual operating and maintenance expenses over the next few years through productivity improvements and by keeping its headcount contained as you can see if the graphic below. That should help pad its financial performance going forward and may assist in keeping leverage levels contained (assuming the company's EBITDA generation firms up due to the cost savings and other operational improvements). We are very supportive of utilities that are constantly looking for ways to improve their financial performance, even if it is \"just\" along the margins. </p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-1565894253137842_origin.png\" rel=\"lightbox\" data-width=\"1109\" data-height=\"832\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-1565894253137842.png\" width=\"640\" height=\"480\" data-width=\"640\" data-height=\"480\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span>Image Shown: An overview of how Dominion Energy plans to keep operating expenses contained going forward. Image Source: Dominion Energy - <a href=\"https://s2.q4cdn.com/510812146/files/doc_presentations/2019/03/2019-03-25-DE-IR-investor-meeting-general-session-vTCII-website-version.pdf\" rel=\"nofollow\">IR Presentation</a></p> <h2 class=\"paywall-full-content invisible\">Dividend Overview</h2> <p class=\"paywall-full-content invisible\">On <a href=\"https://investors.dominionenergy.com/news/press-release-details/2019/Dominion-Energy-Announces-Second-Quarter-Earnings/\" rel=\"nofollow\">July 31</a>, Dominion Energy reported second quarter earnings for 2019. Management reiterated guidance for $4.05 - $4.40 in operating EPS in 2019 noting that “year-to-date results and our second half outlook are supportive of our existing 2019 operating earnings guidance” in the press release. For reference, Dominion Energy generated $4.05 in operating EPS in <a href=\"https://investors.dominionenergy.com/news/press-release-details/2019/Dominion-Energy-Announces-Fourth-Quarter-and-Full-Year-2018-Earnings-Provides-Atlantic-Coast-Pipeline-Update/default.aspx\" rel=\"nofollow\">2018</a>, indicating that management expects decent annual growth (~4%) at the midpoint of guidance in 2019. Using its latest annualized dividend payout, Dominion Energy expects to support a coverage ratio (operating EPS dividend by dividend per share) of ~87% in 2019.</p> <p class=\"paywall-full-content invisible\">That doesn’t leave room for payout growth in excess of operating EPS growth, which is why going forward, Dominion Energy expects to grow its payout by 2.5% annually over the coming years as you can see in the graphic below. Dominion Energy’s dividend per share will grow at a slower rate than its expected operating EPS growth, allowing for its payout ratio to move materially lower over time (towards the low 70s%).</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921232810447_origin.png\" rel=\"lightbox\" data-width=\"1109\" data-height=\"832\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921232810447.png\" alt=\"A screenshot of a cell phone Description automatically generated\" width=\"626\" height=\"470\" data-width=\"640\" data-height=\"480\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Image Shown: Dominion Energy is sharply slowing down its dividend per share growth going forward, versus historical levels, to allow for better payout coverage over time as its operating EPS is expected to grow at a faster rate. Image Source: Dominion Energy – <a href=\"https://s2.q4cdn.com/510812146/files/doc_presentations/2019/03/2019-03-25-DE-IR-investor-meeting-general-session-vTCII-website-version.pdf\" rel=\"nofollow\">IR Presentation</a></p> <p class=\"paywall-full-content invisible\">Dominion Energy exited June 2019 with $40.6 billion in total debt on the books, versus a cash pile of $0.4 billion on hand, giving the firm a net debt load of $40.2 billion. Again, we want to highlight that Dominion Energy can manage large capital investments, its dividend commitments, and its large debt load by retaining relatively easy access to capital markets as debt can be refinanced and cash flow shortfalls can be met by outside funds (via equity/debt issuances).</p> <h2 class=\"paywall-full-content invisible\">Looking Ahead</h2> <p class=\"paywall-full-content invisible\">Going forward, management has identified ~$26 billion in growth capital investments from 2019 – 2023 as you can see in the graphic below. Investments in electric utilities represents the majority of that growth runway, with gas utility investments representing the remainder.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921233644292_origin.png\" rel=\"lightbox\" data-width=\"1109\" data-height=\"832\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921233644292.png\" alt=\"A screenshot of a cell phone Description automatically generated\" width=\"626\" height=\"470\" data-width=\"640\" data-height=\"480\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Image Shown: Dominion Energy expects to investment between $4.0 - $6.0 billion annually in growth capital investments over the next five years. Image Source: Dominion Energy – <a href=\"https://s2.q4cdn.com/510812146/files/doc_presentations/2019/03/2019-03-25-DE-IR-investor-meeting-general-session-vTCII-website-version.pdf\" rel=\"nofollow\">IR Presentation</a></p> <p class=\"paywall-full-content invisible\">A growing rate base, which Dominion Energy sees expanding to ~$64 billion by 2023 from ~$45 billion in 2018, is expected to provide for mid-single-digit operating EPS CAGR over the coming years as you can see in the graphic below. Long-term, management is targeting a 5%+ CAGR for Dominion Energy’s operating EPS.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921237628176_origin.png\" rel=\"lightbox\" data-width=\"1109\" data-height=\"832\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921237628176.png\" alt=\"A screenshot of a cell phone Description automatically generated\" width=\"626\" height=\"470\" data-width=\"640\" data-height=\"480\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Image Shown: Management expects Dominion Energy will generate decent mid-single-digit operating EPS growth over the coming years. Image Source: Dominion Energy – <a href=\"https://s2.q4cdn.com/510812146/files/doc_presentations/2019/03/2019-03-25-DE-IR-investor-meeting-general-session-vTCII-website-version.pdf\" rel=\"nofollow\">IR Presentation</a></p> <h2 class=\"paywall-full-content invisible\">Concluding Thoughts</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Shares of D are trading near (but not above) the upper end of our fair value range, derived through our rigorous discounted free cash flow analysis, indicating that while Dominion Energy isn’t overpriced the market is pricing in an optimistic future now that it appears the US Fed is likely to continue cutting interest rates. We are keeping Dominion Energy on our radar as the market is likely to generously reward utilities as one of the few sources of yield in a low interest rate environment.</p>", "twitContent": "$D - Dominion Energy Slows Down Payout Growth And We Are Still On The Sidelines. https://seekingalpha.com/article/4286648-dominion-energy-slows-down-payout-growth-and-are-still-on-sidelines?source=tweet ", "innerMarketing": "", "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "24491", "type": "author"}}, "sentiments": {"data": [{"id": "60481", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "34650", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "18027", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "18029", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4286648-dominion-energy-slows-down-payout-growth-and-are-still-on-sidelines", "canonical": "https://seekingalpha.com/article/4286648-dominion-energy-slows-down-payout-growth-and-are-still-on-sidelines", "uriImage": "https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921222518265_origin.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2019/8/15/933684-15658921222518265_origin.png"}}}, "included": [{"id": "24491", "type": "author", "attributes": {"company": null, "slug": "valuentum", "userId": 933684, "tagId": 34650, "bio": "<p>We offer subscriptions and exclusive newsletters. Visit our website at www.valuentum.com for more information. Valuentum is an independent investment research publisher, offering premium equity reports and dividend reports, as well as commentary across all sectors/companies, a Best Ideas Newsletter (spanning market caps, asset classes), a Dividend Growth Newsletter, modeling tools/products, and more. Valuentum is based in the Chicagoland area. Valuentum is not a money manager, broker, or financial advisor. Valuentum is a publisher of financial information. Please read our Disclaimer that applies to all articles published on Seeking Alpha: https://www.valuentum.com/categories/20110613. Follow us on Twitter: @Valuentum</p>", "image": {"small": "https://static.seekingalpha.com/images/users_profile/000/933/684/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/000/933/684/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/000/933/684/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/000/933/684/extra_large_pic.png"}, "nick": "Valuentum", "deactivated": null, "memberSince": 2011, "isRss": false, "contributorSince": 2011, "followersCount": 17929}, "relationships": {"user": {"data": {"id": "933684", "type": "user"}}, "userBioTags": {"data": [{"id": "956533", "type": "userBioTag"}, {"id": "956534", "type": "userBioTag"}, {"id": "956535", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/valuentum", "profileUrl": "/author/valuentum", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "55", "type": "sector"}}}, "links": {"self": "/symbol/D"}}, {"id": "34650", "type": "tag", "attributes": {"slug": "valuentum", "name": "Valuentum", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/valuentum"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "18027", "type": "tag", "attributes": {"slug": "utilities", "name": "Utilities", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/utilities"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "18029", "type": "tag", "attributes": {"slug": "electric-utilities", "name": "Electric Utilities", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/electric-utilities"}}, {"id": "60481", "type": "sentiment", "attributes": {"articleId": 4286648, "type": "neutral", "createdAt": "2019-08-19T13:52:02.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4286648", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}