{"data": {"id": "4287624", "type": "fullArticle", "attributes": {"publishOn": "2019-08-23T14:12:03-04:00", "isLockedPro": false, "commentCount": 56, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"global-dividends": {"id": 578784, "slug": "global-dividends", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "utilities": {"id": 55, "slug": "utilities", "kind": "sector", "path": "/stock-ideas/utilities", "title": "Utilities ", "non_theme": true, "sasource": "theme_breadcrumb"}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "electric-utilities": {"id": 18029, "slug": "electric-utilities", "kind": "common", "non_theme": true}}, "title": "Dominion Energy's Dividend Needs Clarification", "summary": ["Dominion Energy's dividend is under constant scrutiny because of the sheer mass of debt on the balance sheet.", "To complicate matters, the stock trades at an incredibly high multiple relative to both the sector and peers.", "Q2 earnings saw better than expected operating EPS, with the benefit coming from weather.", "While leverage itself is not a risk because of the company's structure, the dividend simply isn't covered by cash flow."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2019-08-23T14:12:03-04:00", "isModerated": false, "closestTradingDate": "2019-08-23", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 18, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Dominion Energy (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>) has been hailed as a safe-haven in the current market, but I'm not so sure that's the proper description for this particular company. The company trades at an extremely expensive valuation and doesn't have sufficient cash flow to cover the dividend, which is more than twice the broader market's yield. Investors need to approach this stock with caution and preferably avoid. There are better options in the space if investors are seeking a safe-haven asset to properly decrease systematic risk at this time.</p> <p><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/22/saupload_d64e126a-9c54-4f9e-97c7-2827dc2ee086-large16x9_ImportedfromLakana.jpg\" rel=\"lightbox\" data-width=\"986\" data-height=\"554\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/22/saupload_d64e126a-9c54-4f9e-97c7-2827dc2ee086-large16x9_ImportedfromLakana_thumb1.jpg\" data-width=\"640\" data-height=\"360\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></span></p> <p><em>Source: <a href=\"https://static.seekingalpha.com/uploads/2019/8/22/saupload_d64e126a-9c54-4f9e-97c7-2827dc2ee086-large16x9_ImportedfromLakana_thumb1.jpg\">KUTV</a></em></p> <h3>Should Investors Be Concerned About the Dividend?</h3> <p>The developments in the rates market in the last few months have created an entirely new playing field for companies that are frequenters of the debt capital markets. Debt is nearly 80-100bps cheaper to issue, on average, based upon rapidly falling yields. This makes it highly favorable for issuers that have a large balance of debt to refinance for the foreseeable future. Additionally, issuers with a significant portion of floating-rate debt or term loans linked to LIBOR are benefiting, as well, from an interest expense perspective.</p> <p>Keeping that in mind, Dominion has been on a spending spree, with two major acquisitions in the last three years. The company <a href=\"https://www.prnewswire.com/news-releases/dominion-resources-combines-with-questar-corporation-300329643.html\" rel=\"nofollow\">bought</a> Questar, a natural gas distributor, for $5.9 billion back in 2016 and, most recently, it purchased SCANA for $14.6 billion, which <a href=\"https://news.dominionenergy.com/2019-01-02-Dominion-Energy-Combines-With-SCANA-Corporation\" rel=\"nofollow\">closed</a> in January of this year. This resulted in the new operating segment of Southeast Energy.</p> <p>To walk through the company's current capital structure, I'll start with the high level picture. First, for those unfamiliar with the sector, it's completely normal for utility companies to have leverage in excess of 3-4x adjusted EBITDA as this helps to drive a decent return for what are theoretically stable assets, especially those centered on power generation and transmission. With that in mind, Dominion has $382 million<span class=\"paywall-full-content invisible\"> in cash relative to $31.85 billion in long-term debt, $4.79 billion in junior subordinated notes (lowest class of debt), and short-term debt of $2.55 billion. Companies like these will frequently refinance as debt becomes due on the short term and roll debt onto the back end of their maturity spectrum, in order to perform proper liability management.</span></p> <p class=\"paywall-full-content invisible\">To put all of this in context, investors have to remember that the kicker is that not all debt is recourse. What does that mean? The company has certain subsidiaries for which debt is issued from that isn't binding to the primary operating company of Dominion Energy. This allows for the company to be significantly levered but have far less solvency risk than companies with a similar debt level but a fully or even majority-recourse structure. For those curious of the numerous subsidiaries that Dominion Energy has, the list can be found <a href=\"https://www.bamsec.com/filing/119312519057924/5?cik=715957\" rel=\"nofollow\">here</a>. Since the company doesn't report EBITDA or adjusted EBITDA and given that it's the primary denominator used in evaluating leverage, I've compiled the operating results and added back relevant adjustments (i.e. other taxes and/or impairments) to arrive at the necessary figures for evaluation.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/22/48989138-1566517607632703_origin.png\" rel=\"lightbox\" data-width=\"768\" data-height=\"141\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/22/48989138-1566517607632703.png\" data-width=\"640\" data-height=\"118\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em>Source: Author Derived From Company Filings</em></p> <p class=\"paywall-full-content invisible\">In the LTM, the company has <a href=\"https://www.bamsec.com/filing/156459019027723?cik=715957\" rel=\"nofollow\">produced</a> adjusted EBITDA of $6.37 billion, which would imply an LTM leverage (net debt to adjusted EBITDA) multiple of 6.09x. This is quite high and, by all accounts, if the company didn't have the recourse/non-recourse structure that it did, there would be significant financial consequences as a figure like this is hardly sustainable. That's even true for the utilities industry that utilizes leverage to drive acceptable project returns. Rather than to try and pick a bone with leverage itself, investors that are concerned about the dividend's safety, especially in a high spend period for the company, should look directly to cash flow, as this can show the real cash left over after dividends, rather than try to sort through what true leverage is with the numerous operating subsidiaries.</p> <p class=\"paywall-full-content invisible\">The company's LTM operating cash flow is $4.66 billion and the same period's capital expenditure is $4.32 billion. That leaves free cash flow of approximately $340 million. Annual dividend expense stands at $2.832 billion, which makes this dividend highly unsafe, especially with the company's five-year high expenditure plan. Simply put, the company has to burn cash or raise further capital in order to cover the dividend. Investors should absolutely not chase this yield.</p> <p class=\"paywall-full-content invisible\">To make matters more complicated, the company this past quarter restructured their segment reporting, such that there are now new compositions and names to the segments. Previously, there was VEPCO (Dominion's Virginia assets), Southeast Energy Group (which represented 10-15% contribution to net income), Gas Distribution, Gas Transmission, and Merchant Generation. There's been a shuffling of states primarily as the result of asset sales and acquisitions, as well as the relative level of earnings contribution to the total company. It seems to be a bit more appropriate now, splitting the segments up this way, but again, provides an unnecessary complication at this time, in my opinion.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/22/48989138-15665130358543558_origin.png\" rel=\"lightbox\" data-width=\"838\" data-height=\"624\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/22/48989138-15665130358543558.png\" data-width=\"640\" data-height=\"477\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em>Source: <a href=\"https://s2.q4cdn.com/510812146/files/doc_financials/2019/q2/v2/2019-07-31-DE-IR-Q2-2019-earnings-call-slides-vTC.pdf\" rel=\"nofollow\">Investor Presentation</a></em></p> <p class=\"paywall-full-content invisible\">The company has a five-year growth plan of $26 billion in growth capital expenditure, but I'm really not sure how realistic it is to achieve this, let alone spend that entire sum when past acquisitions have resulted in significant costs to achieve synergies. Granted, not all growth capital expenditure is allocated to inorganic opportunities, but the point remains that this company has had considerable expenses associated with its past acquisitions. For example, with the SCANA acquisition, the company incurred $2 billion of merger and integration-related costs, primarily due to a $1 billion refund of amounts that were previously collected from Dominion Energy South Carolina. The company also had to deal with the $758 million of charges at the regulated entity level, due to certain retirements of generation facilities, as well as contract terminations. These weigh heavily on operating earnings, and subsequently, the company's denominator for leverage.</p> <h3 class=\"paywall-full-content invisible\">Earnings Leave Much To Be Desired</h3> <p class=\"paywall-full-content invisible\">Weather has been a strong driver for the company in the past few quarters, with Q2 results showing an uplift past guidance in power generation, as a result. The company is still working on integrating its past acquisitions and will do so for the foreseeable future, which may result in one-time costs that otherwise wouldn't be present. Below is the operating earnings breakdown for Q2, with beats coming from the Power Generation segment and Southeast Energy (formerly SCANA), with both primarily linked to better than expected weather.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/22/48989138-15665113971780403_origin.png\" rel=\"lightbox\" data-width=\"946\" data-height=\"587\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/22/48989138-15665113971780403.png\" data-width=\"640\" data-height=\"397\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em>Source: Investor Presentation</em></p> <p class=\"paywall-full-content invisible\">One of the things that I find to be interesting is the way the company is going about an O&amp;M expense reduction. The company's voluntary retirement program seems nothing more than a failure to admit a past over-expenditure where now it has to ask employees to leave in order to lower costs and keep margins intact. The rationale of \"embracing new technologies to complement human capital deployment\" also rings in an entirely new wave of expenditure, as automation isn't free, and even if it ends up paying for itself, that's not going to be several years down the line. I think their second bullet point provided on recent earnings deck puts the rationale best, actually, \"Savings available to overcome potential unexpected challenges; de-risks growth plan,\" even if the latter phrase seems overly optimistic.</p> <p class=\"paywall-full-content invisible\">Investors need to also be careful because the company reports two types of earnings: normal GAAP EPS and operating earnings. The \"headline\" EPS target that the company will point you to is for 2019 operating EPS at $4.05-4.40, largely driven by the Millstone refueling, lower net capacity expenses, and the benefit from the SCANA acquisition. For the upcoming quarter, the company will see lower operating earnings in part due to asset divestitures as well as higher shares outstanding as a result of equity issuance and milder than expected weather.</p> <p class=\"paywall-full-content invisible\">In looking at the dividend, the stock currently yields 4.80%, which by all means is a great dividend to take home and add to your portfolio, but it's not covered by cash flow and, rather, it's continued liability management and equity issuance that aid the company in covering its ongoing high expenses.</p> <p class=\"paywall-full-content invisible\">In looking at the stock's performance, it's entirely been safe-haven driven, which I think is rather ironic if investors knew what they were getting rather than blindly buying large-cap names in the utility sector. The stock trades at a trailing earnings multiple of 51.6x, which is staggering for a utility company. At best, this stock should be trading in the low to mid-20s. The company has a long-term EPS growth target of +5% per year, which doesn't exactly warrant a 50x+ earnings valuation. The growth simply isn't compelling and many other large-cap utilities can offer this kind of growth, with a comparable dividend yield, at a fraction of the valuation.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/8/22/48989138-15665131085037215_origin.png\" rel=\"lightbox\" data-width=\"700\" data-height=\"530\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/8/22/48989138-15665131085037215.png\" width=\"640\" height=\"485\" data-width=\"640\" data-height=\"485\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em>Source: StockCharts</em></p> <p class=\"paywall-full-content invisible\">As a caveat to my bearishness on the stock, I'll say that a levered company's stock in a macro environment that is telling investors to seek safe-haven assets as of late, this is a dangerous stock to be betting against; however, investors must weigh a poorly covered dividend and significant expenditure in the coming quarters against periodic flight to safety by the broader market.</p> <h2 class=\"paywall-full-content invisible\">Conclusion</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Dominion Energy has numerous complications, which makes it difficult for investors to understand at the forefront. The primary takeaway is that the company's leverage itself isn't an issue, as it has carefully built a structure in which operating subsidiaries issue debt that is non-recourse to the parent. Rather, it is the high level of expenditure and an expensive dividend that eats into the company's cash flow, causing it to exhibit a burn. Investors should avoid this yield at all costs.</p>", "twitContent": "$D - Dominion Energy's Dividend Needs Clarification. https://seekingalpha.com/article/4287624-dominion-energys-dividend-needs-clarification?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104183", "type": "author"}}, "sentiments": {"data": [{"id": "62189", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "578784", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "18027", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "18029", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4287624-dominion-energys-dividend-needs-clarification", "canonical": "https://seekingalpha.com/article/4287624-dominion-energys-dividend-needs-clarification", "uriImage": "https://static.seekingalpha.com/uploads/2019/8/22/saupload_d64e126a-9c54-4f9e-97c7-2827dc2ee086-large16x9_ImportedfromLakana.jpg", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2019/8/22/saupload_d64e126a-9c54-4f9e-97c7-2827dc2ee086-large16x9_ImportedfromLakana.jpg"}}}, "included": [{"id": "104183", "type": "author", "attributes": {"company": null, "slug": "global-dividends", "userId": 48989138, "tagId": 578784, "bio": "<p>Focused on providing sustainable long/short advice across varied time horizons, while avoiding yield traps.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/048/989/138/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/048/989/138/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/048/989/138/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/048/989/138/extra_large_pic.png"}, "nick": "Global Dividends", "deactivated": null, "memberSince": 2017, "isRss": false, "contributorSince": 2018, "followersCount": 1753}, "relationships": {"user": {"data": {"id": "48989138", "type": "user"}}, "userBioTags": {"data": [{"id": "936155", "type": "userBioTag"}, {"id": "936156", "type": "userBioTag"}, {"id": "936157", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/global-dividends", "profileUrl": "/author/global-dividends", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "55", "type": "sector"}}}, "links": {"self": "/symbol/D"}}, {"id": "578784", "type": "tag", "attributes": {"slug": "global-dividends", "name": "Global Dividends", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/global-dividends"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "18027", "type": "tag", "attributes": {"slug": "utilities", "name": "Utilities", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/utilities"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "18029", "type": "tag", "attributes": {"slug": "electric-utilities", "name": "Electric Utilities", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/electric-utilities"}}, {"id": "62189", "type": "sentiment", "attributes": {"articleId": 4287624, "type": "very_bearish", "createdAt": "2019-08-23T14:12:03.000-04:00", "typeId": 4}, "relationships": {"article": {"data": {"id": "4287624", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}