{"data": {"id": "4390101", "type": "fullArticle", "attributes": {"publishOn": "2020-11-18T14:35:51-05:00", "isLockedPro": false, "commentCount": 2, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"vasily-zyryanov": {"id": 584757, "slug": "vasily-zyryanov", "kind": "common", "non_theme": true}, "ati": {"id": 2607, "slug": "ati", "kind": "common", "non_theme": true}, "industrial-goods": {"id": 17913, "slug": "industrial-goods", "kind": "common", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "earnings": {"id": 10, "slug": "earnings", "kind": "breadcrumb", "path": "/earnings/earnings-analysis", "title": "Earnings Analysis", "sasource": "theme_breadcrumb"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "metal-fabrication": {"id": 17927, "slug": "metal-fabrication", "kind": "common", "non_theme": true}, "materials": {"id": 15, "slug": "materials", "kind": "sector", "path": "/stock-ideas/basic-materials", "title": "Basic Materials", "sasource": "theme_breadcrumb"}}, "title": "Allegheny Technologies: It Is Always Darkest Before The Dawn", "summary": ["The severely battered stock price of ATI, which has lost almost 34.8% since the beginning of the year, is due to continue recuperating thanks to the sector rotation.", "Q3 was dismal; revenues tumbled by 41.4%, as the aerospace end-market was still suffering from the ripple effects of the pandemic.", "ATI remains FCF positive in the trailing four quarters, thanks to scrupulous working capital management.", "Q4 will likely bring no relief, but I expect the market to continue pricing in the 2021 recovery prospects."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2020-11-18T14:35:51-05:00", "isModerated": false, "closestTradingDate": "2020-11-18", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 7, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>In my opinion, the severely battered stock price of Allegheny Technologies Corporation (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ATI\" title=\"ATI Inc.\">ATI</a></span>), which has lost almost 34.8% since the beginning of the year, is due to continue recuperating being propped up by the sector rotation going forward.</p> <p>My previous note on Allegheny Technologies was <a href=\"https://seekingalpha.com/article/4354103-allegheny-technologies-value-stock-risks\">neutral</a>. Though I was cautiously optimistic deep inside, the forces that were whipsawing aerospace – the company’s essential end-market – were too resilient back then. Still, the price has surged by ~29.2%, as the news on the successes of Pfizer (<a href=\"https://seekingalpha.com/symbol/PFE\" title=\"Pfizer Inc.\">PFE</a>)/BioNTech's (<a href=\"https://seekingalpha.com/symbol/BNTX\" title=\"BioNTech SE\">BNTX</a>) and Moderna's (<a href=\"https://seekingalpha.com/symbol/MRNA\" title=\"Moderna, Inc.\">MRNA</a>) vaccines despite obvious future distribution <a href=\"https://www.bloomberg.com/news/articles/2020-11-10/deep-freeze-challenge-makes-pfizer-s-shot-a-vaccine-for-the-rich\" rel=\"nofollow\">issues</a> have served as powerful catalysts this November.</p> <p>And while the headwinds are still in place, I am bullish now. Let me elaborate on why.</p> <h2><strong>Little positive surprises inside the Q3 report</strong></h2> <p>For Pittsburgh-based Allegheny Technologies, 2020 has been a sheer calamity. Its top line has been simultaneously impacted by the key repercussions of the pandemic: the oil price slump, the global air travel decline, and the headwinds the disease spawned for the market of medical equipment not directly related to the treatment of patients with the novel coronavirus. And while other cyclical players, for example, in the chemical industry, were reporting bumper sequential improvements in Q3 and charting the path to slow growth in 2021, Allegheny’s Q3 revenues were still in free fall.</p> <p><span><a href=\"https://static.seekingalpha.com/uploads/2020/11/18/49647006-1605710917979736_origin.jpg\" rel=\"lightbox\" data-width=\"3823\" data-height=\"2275\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/11/18/49647006-1605710917979736.jpg\" alt=\"Source: Unsplash\" width=\"640\" height=\"381\" data-width=\"640\" data-height=\"381\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></span></p> <p><em>Source: <a href=\"https://unsplash.com/photos/-4-KfFh2eIU\" rel=\"nofollow\">Unsplash</a></em></p> <p>The Q2 revenues <a href=\"https://seekingalpha.com/symbol/ATI/income-statement#figure_type=quarterly#view_type=yoy_growth\">were down</a> by <strong>28.7%,</strong> a devastating result. But the Q3 slump was even worse, as sales were down by <strong>41.4%</strong>, while Wall Street had <a href=\"https://seekingalpha.com/news/3628157-allegheny-technologies-eps-beats-0_22-misses-on-revenue\">expected</a> a much stronger result. That happened essentially due to lackluster <strong>Aerospace</strong> revenues (namely Jet Engine and Airframe) that tumbled by 61% (<a href=\"https://seekingalpha.com/article/4382711-allegheny-technologies-incorporated-2020-q3-results-earnings-call-presentation\">slide 5</a>). Sales to <strong>Energy</strong>, the end-market ATI also heavily depends on, fell by 40% to $130 million, as lackluster oil prices were still a drag on<span class=\"paywall-full-content invisible\"> capital expenditures of the petroleum industry players (and, by the way, there is only little hope they have already bottomed), while</span><em class=\"paywall-full-content invisible\"> “civilian nuclear, pollution control and renewable applications remain stable.”</em></p> <p class=\"paywall-full-content invisible\">Also, investors should not be surprised that <strong>Medical</strong> was under strain, as the pandemic had a twofold effect: while the demand for ventilators and related intensive-care equipment surged, the virus upended capital allocation plans of hospitals and led to deferral in elective surgeries (I have already discussed that issue in the post-earnings <a href=\"https://seekingalpha.com/article/4381249-carlisle-companies-portfolio-versatility-mitigates-effects-of-inconsistent-economic-recovery\">article</a> on Carlisle Companies (<a href=\"https://seekingalpha.com/symbol/CSL\" title=\"Carlisle Companies Incorporated\">CSL</a>)). So, this end-market fared barely better, as sales declined by <strong>34%</strong>.</p> <p class=\"paywall-full-content invisible\">The only robust end markets that eclipsed the mess were (expectedly) <strong>Defense</strong> and <strong>Electronics</strong>, which improved simultaneously by 3%. ATI clarified that the 3% gain in the military end market was undergirded by naval nuclear and military aerospace (<a href=\"https://seekingalpha.com/article/4382711-allegheny-technologies-incorporated-2020-q3-results-earnings-call-presentation\">slide 5</a>). No particular clients were mentioned during the call or in the quarterly filings, but from the 2019 annual report (<a href=\"https://seekingalpha.com/filings/pdf/13949148.pdf\">page 20</a>), we know that Lynchburg-based BWX Technologies (<a href=\"https://seekingalpha.com/symbol/BWXT\" title=\"BWX Technologies, Inc.\">BWXT</a>) has been buying ATI's <em>“materials for the manufacture of naval nuclear components”</em> under LTA. Now, let us delve a bit deeper and take a closer look at the Q3 report of BWXT, which might hold clues to why Allegheny’s military revenues were immune to the economic downswing.</p> <p class=\"paywall-full-content invisible\">Despite the raging pandemic, the company’s growth story is anything but strained. Its <a href=\"https://s2.q4cdn.com/477932843/files/doc_financials/2020/q3/BWXT_9.30.20_ER-Exhibit-99.1-FINAL.pdf\" rel=\"nofollow\">Q3 revenues</a> were up by ~3%; inspired by strong performance, BWXT even increased its full-year adjusted EPS to ~$3 and also revised up its estimates for 2020 performance of the Nuclear Operations Group and the Nuclear Power Group. Interestingly, its inventory rose <a href=\"https://seekingalpha.com/symbol/BWXT/balance-sheet#figure_type=quarterly\">sequentially</a> from $12 million to $13 million, which is not a direct indication that it was stockpiling titanium alloys but may point to the fact it overall increased the purchases of metals anticipating higher sales going forward, which also positively impacted the top line of ATI.</p> <p class=\"paywall-full-content invisible\">Now, let us return to aerospace (to its commercial sub-market), the industry of essential importance for ATI. What about its customers? They are clearly substantially less optimistic than BWXT. Take Rolls-Royce Holdings (<a href=\"https://seekingalpha.com/symbol/RYCEF\" title=\"Rolls-Royce Holdings plc\">OTCPK:RYCEF</a>), which purchases specialty materials for the Trent engine family (and will do so at least until 2029, <a href=\"https://seekingalpha.com/filings/pdf/13949148.pdf\">page 20</a>). We cannot say precisely how the firm fared in Q3, as no fresh data is available because the UK listing rules do not require quarterly reports. The <a href=\"https://www.rolls-royce.com/~/media/Files/R/Rolls-Royce/documents/investors/2020-hy-press-release.pdf\" rel=\"nofollow\">1H20 data</a> show that underlying revenue declined by 24% to £5.6 billion, while the underlying operating loss was £ (1.7) billion.</p> <p class=\"paywall-full-content invisible\">Besides, it is worth noting here that, in October, Rolls-Royce shareholders <a href=\"https://seekingalpha.com/news/3626387-rolls-royce-wins-shareholder-backing-for-2b-equity-raise\">approved</a> the drastically needed rights issue that was supposed to buttress its liquidity, which is not coincidental: as of end-June, the company’s net operating cash flow was negative, equaled to £ (265) million, let alone FCF.</p> <p class=\"paywall-full-content invisible\">Being in a precarious position, it has been exploring multiple ways to lower expenses, and among one of the options was to move fan blade activities to Singapore. But this step appeared to be controversial and even sparked employee backlash, and, subsequently, resulted in the three-week strike on the Barnoldswick plant that <a href=\"https://www.straitstimes.com/world/europe/rolls-royce-uk-staff-strike-over-possible-singapore-switch\" rel=\"nofollow\">began</a> on November 6. It has been announced recently that the <em><a href=\"https://www.lancashiretelegraph.co.uk/news/18875197.rolls-royce-workers-speak-real-pride-barnoldswick-strike-extended/\" rel=\"nofollow\">\"action is set to continue up to Christmas Eve.\"</a></em></p> <p class=\"paywall-full-content invisible\">Will the strike affect Allegheny’s Q4 revenues? It is tough to say. Neither during the earnings call nor in the press release, the company made no remarks on that matter. Moreover, no single word was said about its supply contract with Rolls-Royce. Analysts were also not interested in that matter and did not ask any questions. So, I personally hope it will have no impact, at all, due to one essential reason: it seems Allegheny’s alloys are not used in the jet engine blades. At least, they were not mentioned by ATI on <a href=\"https://www.atimetals.com/markets/aerospace/Documents/Commercial.pdf\" rel=\"nofollow\">this scheme</a>. Instead, its alloys like ATI 6-4™ and ATI 21S™ are used in such engine components as pylons, nacelle, plug &amp; nozzle assemblies.</p> <h2 class=\"paywall-full-content invisible\"><strong>The outlook does not offer a sense of relief, but there is a bottom in sight</strong></h2> <p class=\"paywall-full-content invisible\">Allegheny Technologies is only slightly optimistic about the short-term recuperation prospects. As CEO Robert Wetherbee remarked during <a href=\"https://seekingalpha.com/article/4382723-allegheny-technologies-incorporated-ati-ceo-robert-wetherbee-on-q3-2020-results-earnings-call\">the earnings call</a>,</p> <blockquote class=\"paywall-full-content invisible\"><p><em>Looking ahead, we're confident demand will eventually recover. We expect these difficult times to continue for several quarters to come. Yet we do believe we're reaching the bottom with some signs of upcoming stability.</em></p></blockquote> <p class=\"paywall-full-content invisible\">Besides, Wall Street is remarkably bearish on the Q4 sales, as pundits are predicting an over <a href=\"https://seekingalpha.com/symbol/ATI/earnings/estimates#figure_type=quarterly\">40% contraction</a>.</p> <h2 class=\"paywall-full-content invisible\"><strong>So, why am I bullish? As it is always darkest before the dawn</strong></h2> <p class=\"paywall-full-content invisible\">First and foremost, the company’s methodology of opex and working capital management deserves high praise. Though ATI is not expecting to turn a profit this year mostly due to the sales slump, it is not an issue. Why? Because I am a cash flow-focused investor, and positive FCF has much greater importance for me than accounting income. Thanks to scrupulous inventory management, its LTM FCF remains well above zero and equals ~$120.4 million. 2020 FCF might be in the $135 million - $150 million range (<a href=\"https://seekingalpha.com/article/4382711-allegheny-technologies-incorporated-2020-q3-results-earnings-call-presentation\">slide 8</a>). And, most importantly, it is definitely not on the brink of insolvency. ATI has a hefty cash pile of over $572 million and around $950 million of total liquidity. So, I have no doubt it will easily cope with the headwinds during the remaining quarter of the year.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">And ultimately, it is abundantly clear that the sector rotation from richly valued tech names to cyclicals is in full swing: the news on vaccines has accelerated this trend. Olin Corporation (<a href=\"https://seekingalpha.com/symbol/OLN\" title=\"Olin Corporation\">OLN</a>), a chemical company, has been one of the beneficiaries of this process, as its share price has risen by almost 120% since my previous coverage <a href=\"https://seekingalpha.com/article/4369854-olin-holding-line-on-dividend-despite-choppy-q2\">published</a> in August. And it is not too late to jump on this train: Allegheny's stock price has obviously fallen too deep and even after the recent rally has not become too richly valued (its <a href=\"https://seekingalpha.com/symbol/ATI/valuation/metrics\">Value Grade</a> is B-) as the future recovery prospects have not been priced in yet. In sum, all these bode well for capital appreciation going forward.</p>", "twitContent": "$ATI - Allegheny Technologies: It Is Always Darkest Before The Dawn. https://seekingalpha.com/article/4390101-allegheny-technologies-is-always-darkest-dawn?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104744", "type": "author"}}, "sentiments": {"data": [{"id": "301399", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2607", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "584757", "type": "tag"}, {"id": "17913", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "10", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17927", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4390101-allegheny-technologies-is-always-darkest-dawn", "canonical": "https://seekingalpha.com/article/4390101-allegheny-technologies-is-always-darkest-dawn", "uriImage": "https://static.seekingalpha.com/uploads/2020/11/18/49647006-1605710917979736_origin.jpg", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2020/11/18/49647006-1605710917979736_origin.jpg"}}}, "included": [{"id": "104744", "type": "author", "attributes": {"company": null, "slug": "vasily-zyryanov", "userId": 49647006, "tagId": 584757, "bio": "<p>Vasily Zyryanov is an individual investor and writer.</p><p>He uses various techniques to find both relatively underpriced equities with strong upside potential and relatively overappreciated companies that have inflated valuation for a reason.</p><p>In his research, he pays much attention to the energy sector (oil & gas supermajors, mid-cap, and small-cap exploration & production companies, the oilfield services firms), while he also covers a plethora of other industries from mining and chemicals to luxury bellwethers.</p><p>He firmly believes that apart from simple profit and sales analysis, a meticulous investor must assess Free Cash Flow and Return on Capital to gain deeper insights and avoid sophomoric conclusions.</p><p>While he favors underappreciated and misunderstood equities, he also acknowledges that some growth stocks do deserve their premium valuation, and its an investor's primary goal to delve deeper and uncover if the market's current opinion is correct or not.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/049/647/006/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/049/647/006/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/049/647/006/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/049/647/006/extra_large_pic.png"}, "nick": "Vasily Zyryanov", "deactivated": null, "memberSince": 2018, "isRss": false, "contributorSince": 2018, "followersCount": 2091}, "relationships": {"user": {"data": {"id": "49647006", "type": "user"}}, "userBioTags": {"data": [{"id": "999268", "type": "userBioTag"}, {"id": "999269", "type": "userBioTag"}, {"id": "999270", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/vasily-zyryanov", "profileUrl": "/author/vasily-zyryanov", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2607", "type": "tag", "attributes": {"slug": "ati", "name": "ATI", "company": "ATI Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "15", "type": "sector"}}}, "links": {"self": "/symbol/ATI"}}, {"id": "584757", "type": "tag", "attributes": {"slug": "vasily-zyryanov", "name": "Vasily Zyryanov", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/vasily-zyryanov"}}, {"id": "17913", "type": "tag", "attributes": {"slug": "industrial-goods", "name": "Industrial Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/industrial-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "10", "type": "tag", "attributes": {"slug": "earnings", "name": "Earnings", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/earnings"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17927", "type": "tag", "attributes": {"slug": "metal-fabrication", "name": "Metal Fabrication", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/metal-fabrication"}}, {"id": "301399", "type": "sentiment", "attributes": {"articleId": 4390101, "type": "bullish", "createdAt": "2020-11-18T14:35:51.000-05:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4390101", "type": "article"}}, "tag": {"data": {"id": "2607", "type": "tag"}}}}]}