{"data": {"id": "4569347", "type": "fullArticle", "attributes": {"publishOn": "2023-01-11T17:25:34-05:00", "isLockedPro": false, "commentCount": 32, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"patrick-doyle": {"id": 578431, "slug": "patrick-doyle", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "tier-1": {"id": 603709, "slug": "tier-1", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Adding To My Losing Hasbro Trade", "summary": ["Myopic investors may fret when they compare the financial results of 2022 to the same period in 2021, forgetting that 2021 was a banner year for Hasbro.", "I think the financial results were decent enough, and I think the valuation remains attractive. I like that the (well covered) dividend remains north of 4%.", "Influential third party publishers are being alienated by Wizards of the Coast, and that will have a negative impact on sales going forward."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-01-11T17:25:34-05:00", "isModerated": false, "closestTradingDate": "2023-01-12", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 8, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of HAS either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I&#39;ll be buying another 200 shares this afternoon.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-w750\" alt=\"Christmas Sweater Nerd\" data-id=\"157075856\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">RyanJLane/E+ via Getty Images</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <p>Since I put out my bullish <a href=\"https://seekingalpha.com/article/4542283-buying-hasbro-inc-stock\" title=\"https://seekingalpha.com/article/4542283-buying-hasbro-inc-stock\" target=\"_blank\">article</a> on Hasbro, Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) 3 ½ months ago, the shares have fallen about 11.6% against a gain of about 4% for the S&amp;P500. It’s now time to work out whether or not it makes sense<span class=\"paywall-full-content invisible\"> to buy more at lower levels, hold, or take my lumps and walk away from the business. I’ll try to answer that question by looking at the updated financial history here, and by looking at the stock as a thing distinct from the underlying business. I also want to write about a risk to the dungeons and dragons game system that has emerged very recently. Given the importance of that property, investors should be aware of how players are reacting to Wizards of the Coast’s recent behaviour around the OGL.</span></p> <p class=\"paywall-full-content invisible\">Welcome to the thesis statement portion of the article. I write a thesis statement such as this in order to provide you the “gist” of my argument in a single, more easily digestible, paragraph. This saves you time and offers minimal exposure to the “Doyle mojo” that so many people find tiresome. You’re welcome. Anyway, I think Hasbro has had a reasonably good financial year in 2022 so far when viewed over the long stretch of history. When compared to 2021 it is down fairly significantly, given that 2021 was a banner year. That written, I think the dividend is reasonably secure, and I really like the fact that the yield is now north of 4%. At the same time, a strong argument can be made to suggest that the shares are cheap, and for that reason I’ll be buying a few more today. I think the most significant risk to my long thesis is the way Wizards of the Coast seems to be alienating fans of Dungeons and Dragons at the moment. Their behaviour is driving influential third-party publishers like Kobold Press and Matt Colville away from the game, and that is very likely to negatively impact sales going forward.</p> <h2 class=\"paywall-full-content invisible\">Financial Snapshot</h2> <p class=\"paywall-full-content invisible\">The most recent financial history here has been “mixed” in my view. Compared to the same period in 2021, the first nine months of 2022 has been rather soft. Specifically revenue and net earnings are down by 5.2% and 4% respectively. Earnings fell by less because the company managed to rein in spending, specifically royalties (down by 14.5%), and advertising expenses (down by 22%). So, I’d say that the company managed costs as well as possible, but nothing is going to help a $228 million drop in revenue relative to the same period in 2021.</p> <p class=\"paywall-full-content invisible\">All that written, though, we should remember that 2021 was very much a banner year for the company, so any comparisons to it will necessarily be challenging. When we compared the first nine months of 2022 with 2019, for example, recent results look much better. For instance, revenue and net income in 2022 were up about 27% and 31% respectively. So, 2022 was a kind of return to something between “normal” and “robust” in my view.</p> <p class=\"paywall-full-content invisible\">I think the capital structure deteriorated substantially in 2019, with long term debt climbing to over $4 billion from $1.7 billion in 2018. I’m glad to see that the company is taking positive steps to pay this down, as evidenced by the fact that it is $317 million (or 7.6%) lower in 2022 relative to the same period in 2021. One of the results of this move is the fact that the interest expense has dropped by about $15.9 million, or 12% when compared to 2021.</p> <p class=\"paywall-full-content invisible\">Finally, I think the dividend is secure enough, though I don’t adore the fact that the payout ratio is about 87% of earnings. It’s certainly been worse in the past, but it’s also been far better. That written, I’d be very happy to average down and add to my position at the right price.</p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2023/1/11/saupload_h5CV0fAUD8ppVCN6_lNdJx7NNWJmb1csWiJCo3ifxxPL2PSwYhsGpVQ7h46Iy0US6Rk9LolRHpbhWwvNTNaPoFmd6Aq57AfWAnN11_Aw5vzExep5NsxX9CzGZLXcK8kZesvUYw_5rwisKgIIgE8QgCaQye5cLR2KR6o1j0uvbIWYDaGDIaVRGkrBVuGT4A.png\" alt=\"A financial history of Hasbro from 2015 to the present\" contenteditable=\"false\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\">Hasbro Financials <span>(Hasbro investor relations)</span></p></figcaption></figure><h2 class=\"paywall-full-content invisible\">The Stock</h2> <p class=\"paywall-full-content invisible\">My regulars know that I consider the business and the stock to be distinctly different things. If you’re one of my new followers, first, welcome, I guess. Second, I consider the business and the stock to be distinctly different things. This is because the business generates revenue by selling toys and published materials for the world’s most popular role playing game, among other things. The stock is a scrap of virtual paper that gets traded around based on a host of factors having little to do with the business. The company’s decision to buy some shares, for instance, may drive the stock higher in price. The stock price may go up and down depending on what an analyst says about <a href=\"https://seekingalpha.com/news/3922057-hasbro-holiday-toy-sales-among-weakest-in-history-bmo\" title=\"https://seekingalpha.com/news/3922057-hasbro-holiday-toy-sales-among-weakest-in-history-bmo\" target=\"_blank\">toy</a> demand. The stock is also affected by the crowd’s demand for “stocks” as an asset class. There’s no way to prove it definitively, but I think a reasonable case could be made to suggest that Hasbro shares would have performed even worse since I last reviewed the name if the overall market had not risen slightly. Given that the financial statement valuation of the business is \"backward-looking\" and the stock is the crowd’s forecast about the distant future, there's an inevitable tension between the two.</p> <p class=\"paywall-full-content invisible\">So, to sum up, the business generates revenue and net income, while the stock bounces up and down based on the crowd's ever-changing views about the future. In my view, the only way to successfully trade stocks is to spot the discrepancies between what the crowd is assuming about a given company and subsequent results. I like to buy stocks when the crowd is particularly down in the dumps about a given stock, because those expectations are easier to beat.</p> <p class=\"paywall-full-content invisible\">Another way of writing \"down in the dumps about a given stock\" is \"cheap.\" I like to buy cheap stocks because they tend to have more upside potential than downside. As my regulars know, I measure the cheapness of a stock in a few ways, ranging from the simple to the more complex. On the simple side, I look at the relationship of price to some measure of economic value, like sales, earnings, and the like. I like to see a stock trading at a discount to both its own history and the overall market. When I last reviewed Hasbro, the market was paying $1.61 for $1 of sales, which was slightly below average by historical standards. Additionally, the shares were trading at a PE of 19.3. This valuation was reasonable, in my view, largely because the PE was trading near the low end of the historical range. Additionally, the dividend yield of 3.68% was quite close to a multi-year high. I liked the fact that investors were getting more while paying less. Fast forward to the present, and both the PE and the dividend yield are about 15% higher, and the PS is 8.6% cheaper per the following:</p> <figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/1/11/saupload_1df633c07fc431099431d3cac6bb990a.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\" title=\"https://ycharts.com\" target=\"_blank\">YCharts</a></figcaption></figure><p class=\"paywall-full-content invisible\">Source: YCharts</p> <figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/1/11/saupload_8a3f46dce0efae0ad9c0a4beedac653a.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\" title=\"https://ycharts.com\" target=\"_blank\">YCharts</a></figcaption></figure><p class=\"paywall-full-content invisible\">Source: YCharts</p> <figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/1/11/saupload_acd3520feb4e5ada1f337552debd54e6.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\" title=\"https://ycharts.com\" target=\"_blank\">YCharts</a></figcaption></figure><p class=\"paywall-full-content invisible\">Source: YCharts</p> <p class=\"paywall-full-content invisible\">I think the shares are generally cheaper, and I like the fact that the (relatively well covered) dividend is higher.</p> <p class=\"paywall-full-content invisible\">One more thing my regulars know is that I want to try to understand what the crowd is currently \"assuming\" about the future of a given company, and in order to do this, I rely on the work of Professor Stephen Penman and his book \"Accounting for Value.\" In this book, Penman walks investors through how they can apply the magic of high school algebra to a standard finance formula in order to work out what the market is \"thinking\" about a given company's future growth. This involves isolating the \"g\" (growth) variable in this formula. In case you find Penman's writing a bit dense, you might want to try \"Expectations Investing\" by Mauboussin and Rappaport. These two have also introduced the idea of using the stock price itself as a source of information, and then infer what the market is currently \"expecting\" about the future.</p> <p class=\"paywall-full-content invisible\">Anyway, applying this approach to Hasbro at the moment suggests the market is assuming that this company will grow profits at a rate of about 2% from here. In my view, that is a pretty pessimistic forecast, and for that reason I’m going to nibble on shares again this morning.</p> <h2 class=\"paywall-full-content invisible\">Risks To My Bullish Thesis</h2> <p class=\"paywall-full-content invisible\">I’d be remiss if I didn’t write about a risk that’s recently appeared on the radar here. One of the jewels in this company’s crown is obviously the Dungeon’s &amp; Dragons game. Full disclosure, I’m a fairly passionate player of this role playing game, though I’ll admit there are far better games out there. This means that I cavort with nerds with whom I have very little in common, other than this game. Wizards of the Coast’s recent behaviour is a hot topic of conversation at the moment, and all signs are that <a href=\"https://gamerant.com/dungeons-dragons-fans-not-happy-ogl-change-wizards-of-the-coast/\" rel=\"nofollow\" title=\"https://gamerant.com/dungeons-dragons-fans-not-happy-ogl-change-wizards-of-the-coast/\" target=\"_blank\">discontent</a> runs high in the nerd community. In particular, nerds are not fans of the way that Wizards of the Coast is unilaterally changing the licensing agreement with third party content creators, like Kobold Press, Matt Colville, Matt Mercer, and the like. The risk is that if Wizards of the Coast alienates these massive influencers, and gives them a choice between egregious financial terms or guiding new players to a new platform, the choice would be obvious. Dungeons and Dragons is a great game, but if these creators are faced with a choice between going out of business and migrating away from the game, the choice is fairly obvious. Kobold Press, for instance, is launching its own roleplaying <a href=\"https://koboldpress.com/kobold-press-announces-new-core-fantasy-experiment/\" rel=\"nofollow\" title=\"https://koboldpress.com/kobold-press-announces-new-core-fantasy-experiment/\" target=\"_blank\">game</a>, which will obviously compete with fifth edition now and the upcoming sixth edition, expected in late 2024.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">So, there’s a chance that Wizards of the Coast will alienate enough of the fanbase that they will damage their lock on the role playing market. Interestingly enough, it was behaviour like this that gave rise to the Pathfinder gaming system back in 2008, so there’s precedent for people pulling away from Wizards when faced with the choice of financial ruin or going it <a href=\"https://en.wikipedia.org/wiki/Pathfinder_Roleplaying_Game\" rel=\"nofollow\" title=\"https://en.wikipedia.org/wiki/Pathfinder_Roleplaying_Game\" target=\"_blank\">alone</a>. For some reason the phrase \"the only thing people learn from history is that people don't learn from history\" is going through my head right now.</p>", "twitContent": "$HAS - Adding To My Losing Hasbro Trade. https://seekingalpha.com/article/4569347-adding-to-my-losing-hasbro-trade?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104099", "type": "author"}}, "sentiments": {"data": [{"id": "430853", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "578431", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "603709", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4569347-adding-to-my-losing-hasbro-trade", "canonical": "https://seekingalpha.com/article/4569347-adding-to-my-losing-hasbro-trade", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/157075856/image_157075856.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "104099", "type": "author", "attributes": {"company": null, "slug": "patrick-doyle", "userId": 48515253, "tagId": 578431, "bio": "<p>I'm a quant investment newsletter writer who marries fundamental analysis with the latest research in momentum. Over the past few years, I’ve developed a piece of software that helps me track the level of optimism and pessimism embedded in stock price. I seek to challenge the assumptions embedded in price by profitably exploiting the disconnect between what the market thinks and what is a likely outcome. I invest in those companies that have a greater than average chance of giving us all a surprise in the next few months. </p><p><br></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/048/515/253/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/048/515/253/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/048/515/253/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/048/515/253/extra_large_pic.png"}, "nick": "Patrick Doyle", "deactivated": null, "memberSince": 2017, "isRss": false, "contributorSince": 2018, "followersCount": 7175}, "relationships": {"user": {"data": {"id": "48515253", "type": "user"}}, "userBioTags": {"data": [{"id": "927945", "type": "userBioTag"}, {"id": "927946", "type": "userBioTag"}, {"id": "927947", "type": "userBioTag"}, {"id": "927948", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/patrick-doyle", "profileUrl": "/author/patrick-doyle", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "578431", "type": "tag", "attributes": {"slug": "patrick-doyle", "name": "Patrick Doyle", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/patrick-doyle"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "603709", "type": "tag", "attributes": {"slug": "tier-1", "name": "Tier 1", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/tier-1"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "430853", "type": "sentiment", "attributes": {"articleId": 4569347, "type": "bullish", "createdAt": "2023-01-11T17:25:34.000-05:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4569347", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}