{"data": {"id": "4594237", "type": "fullArticle", "attributes": {"publishOn": "2023-04-15T06:34:04-04:00", "isLockedPro": false, "commentCount": 6, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"welbeck-ash-research": {"id": 615408, "slug": "welbeck-ash-research", "kind": "common", "non_theme": true}, "dis": {"id": 86, "slug": "dis", "kind": "common", "non_theme": true}, "goog": {"id": 544, "slug": "goog", "kind": "common", "non_theme": true}, "googl": {"id": 148893, "slug": "googl", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro: Long-Term Value But Be Patient", "summary": ["Hasbro has licenses for some of the most valuable IPs in the world, including Marvel and Star Wars.", "Hasbro is facing economic headwinds as demand grinds to a halt and all trading segments see declining revenue.", "There are opportunities for growth through adult-targeted toys and digital marketing. The market as a whole is expected to grow at a CAGR is 4-7%.", "Hasbro boasts an impressive profitability profile, allowing for consistent capital distributions.", "With headwinds ahead in FY23, we see no reason for positive price action. The company does look undervalued and so we rate the stock a hold."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-04-15T06:34:04-04:00", "isModerated": false, "closestTradingDate": "2023-04-17", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 5, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-w750\" alt=\"Monopoly game Go square\" data-id=\"523964429\" data-type=\"getty-image\" width=\"4950px\" height=\"3300px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"></picture><figcaption><p class=\"item-credits\">NoDerog</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Company description</h2> <p>Hasbro, Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) operates as a toy and entertainment company. It operates under <a href=\"https://finance.yahoo.com/quote/HAS/profile?p=HAS\" rel=\"nofollow\">3 segments</a>:</p> <ul> <li>Consumer Products segment - This department sources, markets, and sells toy and game products. They also license their IP and trademarks.</li> <li>Digital<span class=\"paywall-full-content invisible\"> Gaming segment - This department creates trading cards, role-playing, and digital games based on Hasbro IP.</span> </li> <li class=\"paywall-full-content invisible\">Entertainment segment - This department develops, purchases, and sells entertainment content, including film, television, digital content, and live entertainment.</li> </ul> <p class=\"paywall-full-content invisible\">The company's distribution channel includes retailers, distributors, wholesalers, and direct-to-consumer services.</p> <p class=\"paywall-full-content invisible\">Hasbro is a mature business and yet its stock price has had a very eventful 10 years. 2013-2018 was a period of revenue growth and general improvement in the business. 2018 saw profits and revenue decline, with a rerating of the stock occurring in 2019. 2020 saw a large fall due to COVID-19 and a subsequent demand-driven reversal. That leads us to now, general market sentiment and factors we will assess later leave the stock down 43% in 2022.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/14/saupload_9728ee95f9ff859eec7bdb1919afc234.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Now feels like a fantastic time to look further into Hasbro, as it is trading at 2015 levels. As a mature business, we will investigate what potential for revenue growth is available, and importantly whether the shareholder returns are fair relative to the price investors are paying. But to begin with, we will consider the current toy and entertainment industry, with an overarching view of macroeconomic conditions.</p> <h2 class=\"paywall-full-content invisible\">Dungeons &amp; Dragons</h2> <p class=\"paywall-full-content invisible\">Hasbro has recently come under fire as its subsidiary, Wizards of the Coast has <a href=\"https://www.theguardian.com/games/2023/jan/12/dungeons-and-dragons-wizards-of-the-coast-ogl\" rel=\"nofollow\">decided to change its longstanding licensing rules</a>. They intend to exert greater control over the IP, which has historically been lightly controlled due to an open-game license. This is to extract greater revenue from the IP by allowing WoTC to monetize products that its users had created. A D&amp;D movie is due to release in the coming few months, which will boost entertainment income but will also inevitably be impacted by this. The impact on the business from this has yet to be seen, but it is already bringing an unnecessary amount of negative press toward Hasbro.</p> <h2 class=\"paywall-full-content invisible\">The economy</h2> <p class=\"paywall-full-content invisible\">Economic conditions began to weaken in 2022, with markets reacting poorly to a change in future outlook.</p> <p class=\"paywall-full-content invisible\">The weakening began as a result of inflation, which began to aggressively increase in 2022. Inflation is currently over 5% in both the US and Europe, with inconclusive evidence of an imminent reversal. Inflation is driven by several related factors including supply chain struggles and the Russian invasion of Ukraine. In response, interest rates were lifted, with further hikes possible in 2023. This has led to a cost-of-living crisis in many nations among low to middle-income households, as both expenditure costs and borrowing costs have increased substantially.</p> <p class=\"paywall-full-content invisible\">This has been harmful to discretionary purchases as consumers have focused their financial capacity on paying bills (heightened during winter) and meeting mortgage payments. When we look at consumer sentiment, it remains at <a href=\"https://tradingeconomics.com/united-states/consumer-confidence\" rel=\"nofollow\">historically low levels</a> and the 10Y/3M yield curve has inverted to a <a href=\"https://fred.stlouisfed.org/series/T10Y3M\" rel=\"nofollow\">record low level</a> in early 2023. For this reason, although things have greatly worsened, it is far from over.</p> <p class=\"paywall-full-content invisible\">Our view is that demand will continue to fall. Weaker economies are more likely to experience a recession, with the no. 1 agenda item being to control inflation. People remain torn on the <a href=\"https://www.abladvisor.com/news/35717/67-of-small-to-medium-sized-business-owners-and-executives-believe-recession-is\" rel=\"nofollow\">fate of the US economy</a>, but a tight labor market is acting in its favor. On the inflation side, the decline has begun to slow but is trending in the right direction.</p> <p class=\"paywall-full-content invisible\">From the perspective of Hasbro, this is not good. Toys are a <a href=\"https://kidscreen.com/2022/12/19/where-is-the-toy-industry-headed-in-2023/\" rel=\"nofollow\">discretionary purchase</a> and relatively elastic in demand. Following COVID-19-driven demand, we will certainly see a fall. If we look historically, revenue has fallen 5 times in 19 years, ranging from 0.2%-12.1%. Given that revenue has already fallen by 9% in FY22, a further 0-5% may be possible in FY23.</p> <h2 class=\"paywall-full-content invisible\">Toy market</h2> <p class=\"paywall-full-content invisible\">Being a mature industry, the toy market has grown steadily over the last decade. We may observe volatility around specific releases when the level of hype is above average, say for the release of toys associated with a blockbuster movie. In recent years, we can use Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>) as an example. They have rebooted the Star Wars franchise and taken Marvel to a whole new level, with <a href=\"https://www.cnbc.com/2020/02/21/hasbro-extends-disney-pact-for-star-wars-marvel-toys-and-games.html\" rel=\"nofollow\">Hasbro having the right</a> to distribute toys for both.</p> <h4 class=\"paywall-full-content invisible\">Kidult</h4> <p class=\"paywall-full-content invisible\">The biggest growth driver in the toy industry currently is adults... who buy toys for themselves (not those kinds of toys). <a href=\"https://www.forbes.com/sites/joanverdon/2022/12/24/will-kidults-save-the-toy-industry-this-christmas/?sh=3e57155b3e53\" rel=\"nofollow\">Research conducted by NPD Group</a> found 14% of industry sales for people aged 18+, with a Y/Y growth of 19%. Not only this, but the 12+ segment is also growing well, an age group that historically stops playing with toys. Toys that are purchased include board games, construction sets, puzzles, and collectibles. For this reason, we have seen targeted marketing aimed at adults and more mature product designs. There are multiple reasons why adults are enjoying toys, one of the major ones being as a stress reliever. We highlight this because it is an easy solution. This is not to say it will cure stress, but that if a consumer is told toys will help, it is perceived as a low-cost option worth trying. One of the most hyped products was Hasbro's Wordle Party Game, which was sold out before Christmas. The Kidult segment is a fantastic growth opportunity for Hasbro, as it increases its total addressable market. Hasbro has great IP in this segment, which includes Marvel, Star Wars and Magic: The Gathering (First $1BN brand). Further, Hasbro has launched and re-launched lines directly targeted at adults, including Hasbro Pulse and Starting Line up. The company is heavily leaning into this segment and is one of the reasons they have been able to grow as they have.</p> <h4 class=\"paywall-full-content invisible\">New marketing</h4> <p class=\"paywall-full-content invisible\">When I was growing up, marketing involved TV ads and the placement of toys in strategic locations in shops. Things have changed now. Young people more than ever have access to digital media, such as TikTok and YouTube Kids (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>). For this reason, marketing must increasingly be adjusted to ensure continued exposure to the target demographic. Also, this is an opportunity for innovation and smart marketing to increase market share. An example of this is YouTube. Toy YouTube is a massive industry with some of the largest creators on the platform. This was initially a once-in-a-lifetime opportunity for the toy brands who got in early, it is now a necessity in the sales and marketing budget.</p> <h4 class=\"paywall-full-content invisible\">Toys or gaming</h4> <p class=\"paywall-full-content invisible\">Leading on from the online media, gaming is an industry that is growing massively. This has been a thing for several decades now and is moving lower and lower in age range, as it becomes more affordable and accessible. This is problematic for the toy industry, as generally the nature of gaming is more attractive than toys. Parents are usually protective of their children, preferring to give them toys to games, but the marketing of these businesses is hard to fight.</p> <p class=\"paywall-full-content invisible\">It is difficult for a business like Hasbro to fight this as they are not like-for-like, instead, they must ensure continued innovation and focus on making the best toys that parents want to buy for their children.</p> <h4 class=\"paywall-full-content invisible\">Growth and outlook</h4> <p class=\"paywall-full-content invisible\">COVID-19 was an anomaly. With parents at home and many receiving income support. Greater discretionary income was available, as the net reduction in \"outdoor\" spending exceeded the net income lost. This led to a splurge of online spending across many sectors, toys being one of them. Further, once lockdowns ended, consumers continued their splurge in-store.</p> <p class=\"paywall-full-content invisible\">This led to unprecedented growth between 2020 and 2021, something that will not be repeated going forward. This leads to the question of what the new \"normal\" is. Most toy companies are saying <a href=\"https://www.marketwatch.com/story/hasbros-holiday-season-was-likely-among-weakest-in-the-north-american-toy-industry-amid-covid-hangover-analyst-says-11672872386\" rel=\"nofollow\">Q4 2022 is a disaster</a>, but when compared to 2018/19, they are actually up several percent. The reality is, we can almost exclude '20 &amp; '21 and say we expect several percent growth across the periods. This does suggest a dip will occur in 2023 as well as 2022, but the importance is on maintaining profitability levels.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://www.fortunebusinessinsights.com/toys-market-104699\" rel=\"nofollow noopener\">Fortune Business Insight</a> is forecasting a CAGR of 7.3% into 2028, with <a href=\"https://www.grandviewresearch.com/industry-analysis/toys-games-market\" rel=\"noopener\">Grand View Research</a> coming in lower at 4.3% (GVR includes gaming). Our view is that it will certainly be between the two. Of course, IP development outside of Hasbro's control will likely be a leading factor (Such as new movies, etc.) and so the ability to forecast is difficult.</p> <h2 class=\"paywall-full-content invisible\">Financials</h2> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure a-c paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/3/12/55358919-16786343244333792_origin.png\" rel=\"lightbox\" data-width=\"780\" data-height=\"644\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/3/12/55358919-16786343244333792.png\" alt=\"Hasbro Financials\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">HAS - Financials (Tikr Terminal)</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">As a mature business, we would not expect outlandish growth. A CAGR of 4% is very respectable, especially when you consider that 2018 was an outlier year as the fall in revenue was attributable to <a href=\"https://kidscreen.com/2019/02/08/hasbro-revenue-falls-12-in-fiscal-2018/\" rel=\"nofollow\">Toys-r-us closing</a>.</p> <p class=\"paywall-full-content invisible\">In the most recent quarter, Hasbro came in below forecast due to difficult trading conditions. All departments saw a decline in demand due to softening interest. The company has invested heavily in operational improvements, contributing to a decline in net income as the company took restructuring charges and asset write-downs.</p> <p class=\"paywall-full-content invisible\">Costs have been well controlled and remain in line with the revenue growth, which in the case of R&amp;D is positive to see. It is likely that no further scale economies can be gained, which given their size is not surprising.</p> <p class=\"paywall-full-content invisible\">Margins have slipped ever so slightly, mainly in FY22. The reason for this is greater pressure to maintain sales. With demand weakening, a greater number of products are likely discounted, and for a larger amount. Despite this, the company has maintained healthy FCF conversion and should be able to sustain this long-term.</p> <p class=\"paywall-full-content invisible\">Moving onto the balance sheet, the business is showing signs of an economic slowdown. Inventory turnover has fallen as the amount of inventory held is far above the historical average, representing 12% of revenue. There is a risk that</p> <p class=\"paywall-full-content invisible\">The business has consistently repurchased shares and issued dividends, growing these at a healthy rate. The only notable share issue was to partially fund the purchase of <a href=\"https://www.cnbc.com/2021/02/25/hasbro-looks-to-entertainment-one-to-turn-it-into-a-media-contender.html\" rel=\"nofollow\">eOne</a>.</p> <p class=\"paywall-full-content invisible\">Debt has increased noticeably, as this was used in part for the purchase just mentioned. It is too early to comment on if this was a success, especially given that it is an entertainment business that was impacted by COVID. Interest payments remain a steady percentage of revenue and their interest coverage remains at a healthy level. We do not consider any credit risk.</p> <h4 class=\"paywall-full-content invisible\">Outlook</h4> <p class=\"paywall-full-content invisible\">Looking ahead, Management is forecasting continued trading difficulty, as well as a c.$300M in revenue headwinds from exited licenses, brands, and markets. This could result in a very difficult FY23 if Q4-22 is anything to go by, causing negative sentiment around the business. On a normalized basis, we are expecting a 0-5% decline, with these factors included, things may get ugly.</p> <h2 class=\"paywall-full-content invisible\">Valuation and relative performance</h2> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure a-c paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/3/12/55358919-16786356237850044_origin.png\" rel=\"lightbox\" data-width=\"774\" data-height=\"261\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/3/12/55358919-16786356237850044.png\" alt=\"Hasbro valuation performance\" contenteditable=\"false\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Valuation and relative performance of peers (Tikr Terminal)</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Hasbro is valued at a premium to its competitors, but a discount to its historical average multiple. If we compare key metrics, Hasbro likely deserves its premium. Hasbro pays greater dividends, has a far larger unlevered FCF margin, and is growing at a similar rate. Further, the other two businesses have returned to their historical valuations, whereas Hasbro has fallen below.</p> <p class=\"paywall-full-content invisible\">With scope for healthy growth long-term and operational improvement, we believe Hasbro will eventually revert toward the 12-15x EBITDA level. This will likely be following the period of economic weakness, which will likely keep the stock price depressed.</p> <h2 class=\"paywall-full-content invisible\">Conclusion</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Hasbro is a mature, steadily growing business. Investors should not be seeking significant capital appreciation, but instead look to receive low volatility, sustainable dividends/buybacks, and slight upside. Macroeconomic conditions continue to weaken which has caused the company to fall below its fair value, giving investors some upside. The toy industry is showing opportunities for growth and development, which Hasbro is in a position to exploit. Despite this, we see no reason for positive price action due to the headwinds ahead, with our expectation being declining quarterly earnings in the coming months.</p>", "twitContent": "$HAS - Hasbro: Long-Term Value But Be Patient. https://seekingalpha.com/article/4594237-hasbro-long-term-value-but-be-patient?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "106542", "type": "author"}}, "sentiments": {"data": [{"id": "430322", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "86", "type": "tag"}, {"id": "544", "type": "tag"}, {"id": "148893", "type": "tag"}]}, "otherTags": {"data": [{"id": "615408", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4594237-hasbro-long-term-value-but-be-patient", "canonical": "https://seekingalpha.com/article/4594237-hasbro-long-term-value-but-be-patient", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/523964429/image_523964429.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "106542", "type": "author", "attributes": {"company": null, "slug": "welbeck-ash-research", "userId": 55358919, "tagId": 615408, "bio": "<p>At the heart of our strategy lies a commitment to unearthing hidden gems through meticulous, bottom-up fundamental analysis. We focus on undercovered stocks and interesting ideas, seeking to tell compelling stories and reveal the hallmarks of enduring quality.</p><p>Our approach goes beyond numbers—we delve deep into the core of each company, identifying strengths that promise long-term success. Through rigorous and disciplined valuation analysis, we ensure that every investment aligns with sound financial principles, steering clear of the fleeting whims of market sentiment and short-term gains.</p><p>“Day to day, the stock market is a voting machine; in the long term it’s a weighing machine.”</p>", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/055/358/919/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/055/358/919/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/055/358/919/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/055/358/919/extra_large_pic.png"}, "nick": "Welbeck Ash Research", "deactivated": null, "memberSince": 2021, "isRss": false, "contributorSince": 2022, "followersCount": 2316}, "relationships": {"user": {"data": {"id": "55358919", "type": "user"}}, "userBioTags": {"data": [{"id": "996970", "type": "userBioTag"}, {"id": "996971", "type": "userBioTag"}, {"id": "996972", "type": "userBioTag"}, {"id": "996973", "type": "userBioTag"}, {"id": "996974", "type": "userBioTag"}, {"id": "996975", "type": "userBioTag"}, {"id": "996976", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/welbeck-ash-research", "profileUrl": "/author/welbeck-ash-research", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "86", "type": "tag", "attributes": {"slug": "dis", "name": "DIS", "company": "The Walt Disney Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/DIS"}}, {"id": "544", "type": "tag", "attributes": {"slug": "goog", "name": "GOOG", "company": "Alphabet Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/GOOG"}}, {"id": "148893", "type": "tag", "attributes": {"slug": "googl", "name": "GOOGL", "company": "Alphabet Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/GOOGL"}}, {"id": "615408", "type": "tag", "attributes": {"slug": "welbeck-ash-research", "name": "Welbeck Ash Research", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/welbeck-ash-research"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "430322", "type": "sentiment", "attributes": {"articleId": 4594237, "type": "neutral", "createdAt": "2023-04-15T06:34:04.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4594237", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}