{"data": {"id": "4594391", "type": "fullArticle", "attributes": {"publishOn": "2023-04-17T04:17:17-04:00", "isLockedPro": false, "commentCount": 7, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"carles-diaz-caron": {"id": 604058, "slug": "carles-diaz-caron", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "dis": {"id": 86, "slug": "dis", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Don't Forget That Hasbro Is A Buy And Hold Stock", "summary": ["Net sales declined by 14.93% year over year during the fourth quarter of 2022 and are expected to remain depressed for at least two more years.", "Both gross profit and EBITDA margins were also significantly impacted by inflationary pressures and lower volumes.", "The company is in a deleveraging phase as its debt pile is high.", "The dividend is not as safe as it used to be due to lower-than-usual profit margins.", "The recent sharp decline in the share price represents a good opportunity for long-term dividend growth investors willing to take short and medium-term risks."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-04-17T04:17:17-04:00", "isModerated": false, "closestTradingDate": "2023-04-17", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 5, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of HAS, DIS either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w750\" alt=\"Toymaker Hasbro Misses Earning Expectations\" data-id=\"1128321204\" data-type=\"getty-image\" width=\"3784px\" height=\"2816px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Justin Sullivan</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2><strong>Investment thesis</strong></h2> <p>The last time I added shares to my Hasbro's (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) position was in March 2020 as temporary factory closures in China caused significant disruptions to the company's operations at a time when it was<span class=\"paywall-full-content invisible\"> heavily indebted as a result of the eOne Entertainment acquisition, which caused a sharp decline in the share price. Back then, the coronavirus pandemic had just entered our lives and the fear of an uncertain (economic) future caused doomsday feelings among investors. Both 2020 and 2021 turned out to be very positive years for the company as net sales skyrocketed as a result of the need for entertainment during mandatory lockdowns around the world and the subsequent reopening of the world's economy, but now the sudden change of direction of the management from its intention to become a major producer of audiovisual content to continuing focusing on the gaming industry, with the consequent potential sale of eOne Entertainment at a time when inflationary pressures are impacting profit margins and the weakening purchasing power of consumers is once again raising doubts about the future of the company in the medium term.</span></p> <p class=\"paywall-full-content invisible\">As a consequence of these reasons, Hasbro's share price is close to the bottom experienced during the worst days of the coronavirus pandemic back in 2020 and already accumulates a decline of 58.70% from all-time highs reached in 2019. That is why I consider that this is a good time to buy shares of Hasbro as it is a century-old company whose brands are highly recognized and loved among consumers while headwinds are in my opinion temporary due to its direct link with the macroeconomic context. Those dividend investors willing to take short to medium-term risks (including a potential dividend cut) will be rewarded with a dividend yield on cost of over 5% in the long run, which ensures good long-term returns once current and potential headwinds fade away.</p> <h2 class=\"paywall-full-content invisible\"><strong>A brief overview of the company</strong></h2> <p class=\"paywall-full-content invisible\">Hasbro is a global entertainment company and toymaker with a strong portfolio of brands, including Magic: The Gathering, Dungeons &amp; Dragons, Nerf, Transformers, Play-doh, Peppa Pig, and Monopoly among many others. Hasbro's revenue streams come from diverse channels, such as the manufacturing of toys and games from its own brands and third-party entertainment companies' brands like Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>), Beyblade, and Fortnite, digital content including movies, series, and videogames, and licensing. The company was founded in 1923 and its market cap currently stands at ~$7.26 billion, employing over 6,000 workers.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/4/14/49210517-16815095191032894_origin.png\" rel=\"lightbox\" data-width=\"2100\" data-height=\"2100\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/14/49210517-16815095191032894.png\" alt=\"Hasbro logo\" width=\"640\" height=\"640\" contenteditable=\"false\" data-width=\"640\" data-height=\"640\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Hasbro logo <span>(Hasbro.com)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">During the first investor day under the leadership of new CEO Chris Cocks, he <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-announces-plan-grow-profit-50-over-next-three-years\" rel=\"nofollow noopener noopener\">unveiled</a> the company's plan for the 2023-2025 period, which included direct-to-consumer and digital growth investments, new licensing partnerships, new products for the company's owned brands (both collectibles and digital content), $250-$300 million in run-rate cost savings, potential acquisitions, and the launch of new share repurchase programs while further deleveraging the balance sheet. The management also expects $1 billion per year in operating cash flows by 2027, which seems actually possible considering the company reached cash from operations of $976.3 million in 2020.</p> <p class=\"paywall-full-content invisible\">Certainly, investors are quite skeptical as to whether the company will manage to maintain its dividend, announce new share repurchase programs and deleverage the balance sheet at the same time thanks to income growth, especially considering the sale of eOne Entertainment, margin contraction due to inflationary pressures, the weakened purchasing power of consumers, and a potential recession due to recent interest rate hikes.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/16/saupload_c5cad7dd345c10c6f8888377a226aecd.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">For these reasons, shares are trading at $52.40, which represents a 58.70% decline from all-time highs of $126.87 on July 30, 2019. In this regard, investors do not expect a smooth financial performance in the short to medium term as net sales and profit margins already declined significantly in the past two quarters and are expected to remain weak in the foreseeable future, so a disappointment in their expectations is, in my opinion, not a significant risk to the share price as expectations are low. The actual risk lies rather in a more prolonged than expected disruption in the company's operations as a result of the ongoing inflationary pressures, which keep weakening the balance sheet, and a potential recession. The cancelation of the MMORPG (Massive Multiplayer Online Role Playing Game) Magic: Legends in 2021 was a setback for the company as it had the potential to greatly boost the company's profits as it is a highly profitable industry, and now the sale of the majority of eOne Entertainment is sowing serious doubts about the existence of a good plan for the future of the company amidst current and potential headwinds.</p> <p class=\"paywall-full-content invisible\">In this article, I'm going to explain why I think such pessimism is a good opportunity for long-term focused dividend growth investors, and I will begin with the company's most recent acquisitions.</p> <h2 class=\"paywall-full-content invisible\"><strong>Recent acquisitions</strong></h2> <p class=\"paywall-full-content invisible\">In December 2019, the company <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-completes-acquisition-entertainment-one\" rel=\"nofollow\">acquired</a> Entertainment One, a global independent studio that specializes in the development, acquisition, production, financing, distribution, and sales of entertainment content for approximately $3.8 billion, and later, in June 2021, it <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-completes-sale-eone-music-business\" rel=\"nofollow\">sold</a> its music business for $385 million. In November 2022, the new CEO <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-initiates-sale-process-eone-tv-and-film-business\" rel=\"nofollow noopener\">announced</a> its plan to sell most of the company's eOne TV and film business not directly supporting the company’s branded entertainment strategy while retaining the rights to Peppa Pig and production capabilities for the company's intellectual property, and the management plans to pay down debt with cash from the sale. It is this move that disappointed investors as it seems the new management suddenly changed the direction of the company as it focusing on the gaming industry while backing down the former CEO's plans to turn Hasbro into a major audiovisual content producer.</p> <p class=\"paywall-full-content invisible\">Continuing with its plan to focus on the gaming industry, in May 2022, the company <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-completes-acquisition-dd-beyond-fandom\" rel=\"nofollow\">acquired</a> D&amp;D Beyond from Fandom, the leading digital RPG toolset and game companion for Dungeons &amp; Dragons with around 10 million registered users, for $146.3 million in order to expand the company's digital capabilities.</p> <h2 class=\"paywall-full-content invisible\"><strong>Net Sales are expected to remain depressed for at least two more years</strong></h2> <p class=\"paywall-full-content invisible\">The company is constantly launching new products to the market. Two examples are the <a href=\"https://investor.hasbro.com/news-releases/news-release-details/magic-gathering-arena-now-available-mobile-devices-around-world\" rel=\"nofollow\">launch</a> of Magic: The Gathering Arena for mobile devices worldwide in 2021 and the <a href=\"https://investor.hasbro.com/news-releases/news-release-details/wizards-coast-releases-dungeons-dragons-dark-alliance\" rel=\"nofollow noopener\">release</a> of the video game Dungeons &amp; Dragons Dark Alliance for PC, PlayStation, and Xbox during the same year. Later, in March 2023, the company also <a href=\"https://investor.hasbro.com/news-releases/news-release-details/eone-announces-premiere-date-new-animated-series-kiya-kimoja\" rel=\"nofollow noopener\">announced</a> the launch of a new animated series called <em>Kiya &amp; The Kimoja Heroes</em>, which will be released on Disney Junior and Disney+ in the United States. As for the foreseeable future, the company also <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbros-entertainment-one-produce-dungeons-dragons-documentary\" rel=\"nofollow noopener\">announced</a> the definitive documentary of Dungeons &amp; Dragons for 2024.</p> <p class=\"paywall-full-content invisible\">Indeed, Hasbro's net sales have increased at a slow rate over the past decade. Even so, 2020 closed with an increase in sales of 15.79% year over year due to mandatory lockdowns, and 2021 closed with a further 17.47% increase as the world's economy reopened with strength, but lower sales volumes and a $166 million FOREX impact caused an 8.78% decline in 2022.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/4/14/49210517-16814817443071597_origin.jpg\" rel=\"lightbox\" data-width=\"1412\" data-height=\"638\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/14/49210517-16814817443071597.jpg\" alt=\"Hasbro net sales\" width=\"640\" height=\"289\" contenteditable=\"false\" data-width=\"640\" data-height=\"289\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\">Hasbro net sales <span>(10-K filings)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">In this regard, the first half of 2022 delivered good results as net sales increased by 4.33% year over year during the first quarter and by 1.29% year over year during the second quarter, but performance weakened during the second half as net sales declined by 14.93% year over year during the third quarter and by 16.63% year over year during the fourth quarter as the Consumer Products business segment underperformed due to a challenging holiday consumer environment marked by strong inflation rates that eroded consumer's confidence and purchasing power. In this regard, the segment's net sales declined by 26% year over year to $1 billion as product pricing was too aggressive during the Xmas holidays, but the Wizards of the Coast and Digital Gaming segment revenue increased by around 22% year over year to $339 million. Nevertheless, the management expects a net sales decline of 25% year over year during the first quarter of 2023 as customers' inventory levels and inflation rates remain higher than usual.</p> <p class=\"paywall-full-content invisible\">Net sales are expected to decline by 2.73% to $5.70 billion in 2023 and recover by 2024 with the same net sales as 2022, which is still 8.72% below record highs of $6.42 billion reached in 2021. The sharp decline in the share price experienced since 2020 along with increasing net sales despite the slight correction in 2022 has caused a very significant decline in the P/S ratio to 1.249, which means the company generates net sales of $0.80 for each dollar held in shares by investors, annually.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/16/saupload_95781f30f3ca0ba0e4a9c457630aa0f3.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">This ratio is 41.25% lower than the average of 2.126 in the past decade and represents a 63.58% decline from the peak of 3.429 reached in late 2019. This means that investors are placing less value on the company's sales as pessimism is very high due not only to weakening net sales and the ongoing sale of eOne Entertainment but also as profit margins have experienced a sharp drop in the past two quarters.</p> <h2 class=\"paywall-full-content invisible\"><strong>Margins are strongly impacted by lower volumes and higher production costs</strong></h2> <p class=\"paywall-full-content invisible\">The company has historically enjoyed very high gross profit margins of over 50% and EBITDA margins of around 20%. Still, the cost of sales was up 260 basis points in 2022 due to higher product costs, inventory obsolescence, sales allowances, and closeouts in toy and game products, which was partially offset by higher product prices and declining freight costs throughout the year.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/16/saupload_8957e5eedf6e698a7ab8ad009fcfe798.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Most of this impact took place during the second half of 2022 as the fourth quarter closed with a 56.01% gross profit margin and a 7.65% EBITDA margin, which are significantly below historical performance. In this regard, lower volumes and higher production costs, both caused by a highly inflationary economic landscape, are eroding the company's ability to convert sales into actual cash. In January 2023, the company <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-announces-organizational-changes-and-provides-update\" rel=\"nofollow\">announced</a> its plan to cut around 15% of the company's global workforce throughout the year, as well as systems and supply chain investments in order to aggressively cut expenses and stabilize profit margins. Even so, unless current inflation rates stabilize at sustainable levels a true stabilization of profit margins will not be possible, and the recent interest rate hikes to combat inflation are sowing fears of a potential recession that would lead the company to experience poor performance for a few more quarters and even years.</p> <h2 class=\"paywall-full-content invisible\"><strong>The deleveraging process continues</strong></h2> <p class=\"paywall-full-content invisible\">The company's long-term debt increased by 138.72% to $4.05 billion in 2019, and by a further 15.16% to $4.66 billion in 2020 as a consequence of the eOne acquisition. Since then, a deleveraging phase began as the company successfully paid down 17.94% of its long-term debt in 2021 boosted by the divestiture of eOne Music, and a further 2.95% decline to $3.71 billion in 2022. The management has openly acknowledged that paying down this debt pile is a top priority at the moment.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/16/saupload_22f919e11654209093880b5c7fe2768a.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">In order to reduce it significantly, the company will use the obtained cash through the sale of the majority of eOne Entertainment. Furthermore, inventories increased significantly in 2022 (as a consequence of lower volumes) with a decline of $168 million quarter over quarter during the fourth quarter but a 23% increase (or $125 million) compared to the same quarter of 2021.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/16/saupload_9fbe4485dedcab0b9f04f165e9c79986.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">In this regard, inventories of $676.80 million are very valuable resources that the company will be able to convert into cash in order to offset low profit margins and potentially continue paying its huge debt pile.</p> <h2 class=\"paywall-full-content invisible\"><strong>The dividend is not as safe as it used to be</strong></h2> <p class=\"paywall-full-content invisible\">The company has a long tradition of distributing part of its profits among investors through dividends and has steadily raised them over the years. The latest raise took place in February 2022 when the company <a href=\"https://investor.hasbro.com/news-releases/news-release-details/hasbro-reports-strong-revenue-operating-profit-and-earnings-0\" rel=\"nofollow\">declared</a> a dividend per share of $0.70, which represented a 3% raise compared to 2021. And as expected for the first quarter of 2023, the dividend will remain frozen at $0.70 per share as the cash payout ratio skyrocketed in 2022 due to much lower cash from operations.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/16/saupload_e0fa4fbb91a5368b724a9fd9a2656a92.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Considering the recent decline in net sales and profit margins, as well as expectations of poor performance in the coming quarters, I would not expect any raise until inflationary headwinds fade and the economy is out of risk of a potential recession. In the following table, I have calculated the sustainability of the dividend over the past few years by calculating what percentage of cash from operations is allocated to the payment of dividends and interest expenses. I have used cash from operations in order to calculate the dividend sustainability through actual operations.</p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <tr> <td><strong>Year</strong></td> <td><strong>2014</strong></td> <td><strong>2015</strong></td> <td><strong>2016</strong></td> <td><strong>2017</strong></td> <td><strong>2018</strong></td> <td><strong>2019</strong></td> <td><strong>2020</strong></td> <td><strong>2021</strong></td> <td><strong>2022</strong></td> </tr> <tr> <td> <strong>Cash from operations</strong> (in millions)</td> <td>$454.4</td> <td>$552.4</td> <td>$774.9</td> <td>$724.4</td> <td>$645.0</td> <td>$653.1</td> <td>$976.3</td> <td>$817.9</td> <td>$372.9</td> </tr> <tr> <td> <strong>Dividends paid</strong> (in millions)</td> <td>$216.9</td> <td>$225.8</td> <td>$248.9</td> <td>$277.0</td> <td>$309.3</td> <td>$336.6</td> <td>$372.7</td> <td>$374.5</td> <td>$385.3</td> </tr> <tr> <td> <strong>Interest expenses</strong> (in million)</td> <td>$93.1</td> <td>$97.1</td> <td>$97.4</td> <td>$98.3</td> <td>$90.8</td> <td>$101.9</td> <td>$201.1</td> <td>$179.7</td> <td>$171.0</td> </tr> <tr> <td><strong>Cash payout ratio</strong></td> <td>68.22%</td> <td>58.45%</td> <td>44.69%</td> <td>51.80%</td> <td>61.93%</td> <td>67.14%</td> <td>58.77%</td> <td>67.76%</td> <td>149.18%</td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p class=\"paywall-full-content invisible\">As you can see in the table above, the cash payout ratio has remained at healthy levels of below 70% over the years until 2022 when it skyrocketed to 149.18% due to abnormally low cash from operations of $372.9 million. Furthermore, inventories increased by $124.7 million compared to 2021, but accounts receivable declined by $368 million while accounts payable declined by only $152.9 million, which is an example of the great impact that high inflation rates and low volumes have had on the company's operations. Furthermore, cash from operations of $110.7 million during the fourth quarter of 2022 was a disaster considering inventories declined by $167.7 million quarter over quarter and accounts payable by $417.6 million while accounts payable declined by only $156 million, and the quarter closed with a net loss of $128.9 million as a consequence.</p> <p class=\"paywall-full-content invisible\">In this regard, investors buying shares of Hasbro should be willing to take the risk of a potential dividend cut in the short to medium term in exchange for a dividend yield on cost of over 5% (plus raises) in the long run.</p> <h2 class=\"paywall-full-content invisible\"><strong>Share buybacks as a way of rewarding investors</strong></h2> <p class=\"paywall-full-content invisible\">The company has traditionally bought back its own shares in order to decrease the number of shares outstanding, which improves per-share performance as the company's profits are distributed among fewer shares. These share repurchases ceased in 2015, but in October 2022, the management mentioned its intention to announce new share repurchase programs in the short to medium term.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/16/saupload_acf9227d7fc1116148839c4cc5d9ae68.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">It is true that share buybacks represent a way to distribute profits among shareholders, but due to low cash from operations amidst current headwinds, I strongly believe that investors should actually not expect any share buyback plan in the foreseeable future, but rather once current and potential headwinds fade.</p> <h2 class=\"paywall-full-content invisible\"><strong>Risks worth mentioning</strong></h2> <p class=\"paywall-full-content invisible\">Naturally, a 58.70% decline in the share price of a major player in the industry it operates and that has been in business for a hundred years does not come without risks. Below I would like to highlight the risks that I believe investors should remain watchful.</p> <ul class=\"paywall-full-content invisible\"> <li>The company's debt pile generated interest expenses of $171.0 million in 2022 and is eating up a large part of the company's cash from operations, which mainly comes from its inventories and accounts receivable due to depressed margins.</li> <li>Profit margins will likely remain depressed for as long as inflation rates are high, and therefore, a prolongation of said headwind for some more quarters would have a very significant impact on the company's balance sheet.</li> <li>Recent interest rate hikes to combat high inflation rates could cause a global recession, which could further decrease the purchasing power of consumers, leading to even lower volumes.</li> <li>The dividend could be cut if the company continues to experience profit margins as low as those of the second half of 2022 for many more quarters as current cash from operations is not enough to sustain the company's operations in the long term.</li> </ul> <h2 class=\"paywall-full-content invisible\"><strong>Conclusion</strong></h2> <p class=\"paywall-full-content invisible\">Hasbro is going through one of the worst moments in its history, and proof of this is in the recent sharp decline in the share price. The company's high debt load is generating high interest expenses, and sales are falling as a result of consumers' lower purchasing power. Declining volumes and higher production costs are having a huge impact on profit margins, for which the company is adopting an aggressive cost-cutting strategy that includes a 15% reduction in its workforce. All these headwinds are taking place at a time when the new CEO has changed the course of the company and has decided to sell the recently acquired eOne Entertainment in order to refocus on gaming. In addition, there are growing concerns about a potential recession due to interest rate hikes, which, if they materialized, would have another strong impact on the company's operations.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Despite all this, I believe that investors should not be blinded by short and medium term headwinds as Hasbro is a company that I believe can be bought and held for decades as it has operated for a century, owns many well-recognized brands, and raised the dividend over the years while performing share buybacks. The recent share price decline opens the opportunity to obtain a dividend yield on cost of over 5% (plus raises) in exchange for short to medium term risks, and although it is true that the depressed profit margins are having a strong impact on the company's balance sheet, the company still has strong inventories of $676.80 million and cash and equivalents of $498.60 and the headwinds are, in my opinion, of a temporary nature due to its direct link to the current macroeconomic landscape.</p> <div id=\"highlighter--hover-tools\" style=\"display: none;\" class=\"paywall-full-content invisible\"><div id=\"highlighter--hover-tools--container\"> <div class=\"highlighter--icon highlighter--icon-copy\" title=\"Copy\"> </div> <div class=\"highlighter--icon highlighter--icon-change-color\" title=\"Change Color\"> </div> <div class=\"highlighter--icon highlighter--icon-delete\" title=\"Delete\"> </div> </div></div>", "twitContent": "$HAS - Don't Forget That Hasbro Is A Buy And Hold Stock. https://seekingalpha.com/article/4594391-dont-forget-that-hasbro-is-a-buy-and-hold-stock?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "105723", "type": "author"}}, "sentiments": {"data": [{"id": "450173", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "86", "type": "tag"}]}, "otherTags": {"data": [{"id": "604058", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4594391-dont-forget-that-hasbro-is-a-buy-and-hold-stock", "canonical": "https://seekingalpha.com/article/4594391-dont-forget-that-hasbro-is-a-buy-and-hold-stock", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "105723", "type": "author", "attributes": {"company": null, "slug": "carles-diaz-caron", "userId": 49210517, "tagId": 604058, "bio": "<p>Subscribe for an average ~14% return per year according to Tipranks. </p><p><br></p><p>I am a long-term Dividend Growth Investor always looking for new opportunities in the stock market since 2015. In order to find good deals in the stock market, I look for companies that are going through a bad time and carefully assess the chances that the financial situation will return to the path of profitability and growth. My objective is to find stocks that can be bought and held for many years and try to get them for the lowest price possible during temporary headwinds. For me, the most important aspects when analyzing a stock's turnaround chances are that the company's products are essential to a big portion of the population, healthy and stable profit margins, a sustainable debt and dividend, and a long-term trend that suggests the products and services offered will continue to be essential for the decades to come. </p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/049/210/517/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/049/210/517/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/049/210/517/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/049/210/517/extra_large_pic.png"}, "nick": "Carles Diaz Caron", "deactivated": null, "memberSince": 2018, "isRss": false, "contributorSince": 2020, "followersCount": 1070}, "relationships": {"user": {"data": {"id": "49210517", "type": "user"}}, "userBioTags": {"data": [{"id": "970128", "type": "userBioTag"}, {"id": "970129", "type": "userBioTag"}, {"id": "970130", "type": "userBioTag"}, {"id": "970131", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/carles-diaz-caron", "profileUrl": "/author/carles-diaz-caron", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "86", "type": "tag", "attributes": {"slug": "dis", "name": "DIS", "company": "The Walt Disney Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/DIS"}}, {"id": "604058", "type": "tag", "attributes": {"slug": "carles-diaz-caron", "name": "Carles Diaz Caron", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/carles-diaz-caron"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "450173", "type": "sentiment", "attributes": {"articleId": 4594391, "type": "bullish", "createdAt": "2023-04-17T04:17:17.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4594391", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}