{"data": {"id": "4605809", "type": "fullArticle", "attributes": {"publishOn": "2023-05-18T13:50:54-04:00", "isLockedPro": false, "commentCount": 4, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"and-value-for-all": {"id": 568808, "slug": "and-value-for-all", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro: Do Not Rush, Wait For A Better Price To Return", "summary": ["Committing capital to HAS now could generate a sub-9% annualized return for shareholders over the next five years, even after accounting for the dividends.", "The company needs to solve strategy and balance sheet issues and has been plagued by several quarters of low cash flow generation. Management predictions seem too rosy.", "Hasbro holds a leading position in the American toy industry, and it is a good company, but it is just not an enticing investment at the moment.", "I recommend readers wait for a better entry point as we approach a challenging macro outlook."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-05-19T08:22:08-04:00", "isModerated": false, "closestTradingDate": "2023-05-18", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 1, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p></p> <figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w750\" alt=\"Toymaker Hasbro Misses Earning Expectations\" width=\"3784px\" height=\"2816px\" data-id=\"1128321204\" data-type=\"getty-image\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"></picture><figcaption><p class=\"item-credits\">Justin Sullivan</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <p>Shares of toymaker Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) saw a 20% rebound last month and about 30% from the year's lows, buoyed by 1Q23 results that satisfied investors and analysts. BofA analyst Jason Haas <a href=\"https://seekingalpha.com/news/3962014-hasbro-gains-after-bank-of-america-pulls-bear-rating\">pulled</a> his bearish rating on the stock<span class=\"paywall-full-content invisible\"> and upgraded it to neutral. Hasbro's dividend yield, which seemed on track to surpass the 6% mark in March, now decreased to about 4.5%. Still, assessing the business on dividend yield alone, the valuation compares favorably to the company's four-year average of 3.3%, pointing at a further 36% upside potential based on mean reversion. The resulting share price of $83 is above the consensus estimate of about $70, but the bulls tout for even higher hypothetical values. For example, a Morningstar analyst following the stock thinks HAS firmly trades in the five-star zone and assigns the business a whopping $104 fair value. While I have always loved high-yielding deals, I struggle to come forward with a buy recommendation on this stock, and here is why.</span></p> <h2 class=\"paywall-full-content invisible\"><strong>Botched acquisition's woes</strong></h2> <p class=\"paywall-full-content invisible\">The first thing that gives me pause is the sheer amount of value destruction the company has managed to serve investors in recent years. In 2019, HAS management decided there was no better time than the present to entangle the company in an M&amp;A deal and spent $4 Billion cash to acquire Entertainment One studio, an Ontario-based company involved in the acquisition, distribution, and production of films and television series like the famous Peppa Pig. With the Covid-19 pandemic hitting shortly afterward, 2019 may feel like ages ago, but it was just four years back.</p> <p class=\"paywall-full-content invisible\">At the time of the deal, management presented to shareholders the strategy of directly owning a studio as an obvious fit, with the potential to save on licensing costs. Fast forward a few years, and the inevitable truth emerged: a production studio is not within HAS's competencies, and the firm lacks the financial strength to run one. After <a href=\"https://www.hollywoodreporter.com/business/business-news/entertainment-one-sale-hasbro-1235265065/\" rel=\"nofollow\">admitting to overspending</a> for Entertainment One, Hasbro has hired bankers to evaluate a potential sale of the segment. A textbook case of \"execution risk.\" Hasbro took over $3.0B in new debt between 2019 and 2020 to make this acquisition happen. In return, Entertainment One generated $90+ Million in losses in 2021 and a paltry $22 Million paper profit in 2022, on revenues of around $1 Billion. This damage can't be undone, and even if HAS successfully unloads E-One in the current environment (an uncertain outcome), it will most likely be on a fire sale.</p> <p class=\"paywall-full-content invisible\">The company might accept a lowball offer to reduce overhead and focus on its other more profitable business units. Still, even if a suitor comes forward, I do not expect sale proceedings to exceed $1 billion under the current market conditions. The cash will be too little, too late, to address the balance sheet debt. HAS is still recording approximately $3 billion in goodwill related to the merger. Assuming $1 billion in debt repayment, that will dig a $2 billion hole in a company with a current common equity value of $2.8 billion. Ouch.</p> <p class=\"paywall-full-content invisible\">The company has $810 million in debt due next year, and the company aims to use the divestment proceedings to deleverage rather than refinance at much higher rates. The choice makes sense, but again, it assumes somebody will pay for E-One sooner rather than later.</p> <p class=\"paywall-full-content invisible\"></p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2023/5/18/46658286-16844053992342625_origin.png\" rel=\"lightbox\" data-width=\"1199\" data-height=\"468\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/5/18/46658286-16844053992342625.png\" alt=\"HAS long-term debt\" contenteditable=\"false\" loading=\"lazy\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>HAS FY22 10K</span></p></figcaption></figure><p class=\"paywall-full-content invisible\"></p> <h2 class=\"paywall-full-content invisible\"><strong>Cash flow remains tight</strong></h2> <p class=\"paywall-full-content invisible\">In the meantime, Hasbro has been quite ambitious with its outlook. Management maintained its FY23 cash-flow guidance of $600 to $700 million in its 1Q23 earnings call and promised to work towards a $1 billion target by FY25. The focus on cash generation is welcomed, considering the dreadful result of $372.9 million in 2022. However, the latest quarterly result shows $89 million operating cash flow compared to $135 million in the year-ago period. The practical implication is that the company did not cover its dividend obligations of $96 million with cash generated from the business, continuing the alarming trend that started with the company not covering its FY22 obligations of $385.3 million. I believe a dividend cut is not in the cards right now, and the issue should prove temporary. However, the longer the company does not support the payments with cash produced, the higher the probability that the Board will decide to change the company's capital allocation priorities.</p> <p class=\"paywall-full-content invisible\"></p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2023/5/18/46658286-16844053994705858_origin.png\" rel=\"lightbox\" data-width=\"979\" data-height=\"568\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/5/18/46658286-16844053994705858.png\" alt=\"HAS outlook\" contenteditable=\"false\" loading=\"lazy\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>HAS 1Q23 earnings presentation</span></p></figcaption></figure><p class=\"paywall-full-content invisible\"></p> <p class=\"paywall-full-content invisible\">A reason for Hasbro's continued cash flow compression is the inventory build-up, with levels reaching a new (seasonal) high of $713 million. Management assured again to sort out the matter, but as the goods age, the issue starts posing another balance sheet risk. With sales declining while interest expenses and inventories increase, the company is torn between keeping up with the appearance of a healthy 62% payout ratio based on (garbage) adjusted EPS of $4.50 and the reality of much lower GAAP earnings and free cash flow generation. Based on FCF/share of $1.43 last year, that's a 200% payout ratio for FY22. The dividend growth story is already dead, as there was no token increase, and the current payment of $0.70 per share was maintained for the fifth straight quarter. Eventually, the ongoing issues should be sorted out without a change in capital allocation strategy. However, I expect the company to need more time to navigate past its problems than the management, and the bulls seem to think. I struggle to reconcile the reality of the company's cash flow and balance sheet statements with an uber-bullish Morningstar note that suggests HAS investors [will] \"<em>be rewarded through rising dividends (above 5% yield) and a share buyback program, along with a return to 2-2.5 times forecast debt/EBITDA in 2024 (as Hasbro uses proceeds from the sale of E-One production assets to reduce debt).\"</em></p> <h2 class=\"paywall-full-content invisible\"><strong>Milking The Wizards (of the Coasts)</strong></h2> <p class=\"paywall-full-content invisible\">Past the balance sheet issues, I also see with some healthy skepticism how management and analyst confidently model a short-term potential for Hasbro to boost operating margins well past double digits. I understand that a sale of E-One would be immediately accretive, but what if there isn't a deal anytime soon? My second concern is that, out of the two (remaining) Hasbro segments, only the smaller one, Wizard of the Coasts (WOTC), is a high-margin business.</p> <p class=\"paywall-full-content invisible\"></p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2023/5/18/46658286-1684405607870211.png\" alt=\"Reported HAS revenues, margins\" contenteditable=\"false\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\"><span>And Value For All</span></p></figcaption></figure><p class=\"paywall-full-content invisible\"></p> <p class=\"paywall-full-content invisible\">WOTC powers up two fantastic game franchises: Magic the Gathering (MtG) and Dungeons &amp; Dragons (DnD). It is Hasbro's crown jewel division. It shouldn't be surprising that some vulture \"activists\" have asked Hasbro to spin WOTC off. Wizards of The Coasts has been arguably far more profitable than anything else in the toy space and has been the division capable of sustaining Hasbro's overall profitability well past the 10% mark.</p> <p class=\"paywall-full-content invisible\">However, despite the presence of WOTC, management's promise to achieve a 20% overall operating income margin by 2027 seems unrealistic. A 3% year-on-year revenue increase in the WOTC did not translate the FY22 3% incremental turnover into additional profits, which slid by 2% from $547 million in 2021 to $538 million. Jason Haas from BofA, one of the few skeptic voices on HAS, may have <a href=\"https://seekingalpha.com/news/3962014-hasbro-gains-after-bank-of-america-pulls-bear-rating\">upgraded</a> the company now because revenue from WOTC increased again by 12% in Q1 2023. Yes, the overprinting of MtG cards may not have affected demand <em>in the quarter,</em> and this is good news. Still, this is not some temporary issue coming from H2 2022:</p> <p class=\"paywall-full-content invisible\"></p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2023/5/18/46658286-16844053994885013_origin.png\" rel=\"lightbox\" data-width=\"1120\" data-height=\"876\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/5/18/46658286-16844053994885013.png\" alt=\"WOTC MTG releases\" contenteditable=\"false\" loading=\"lazy\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>BofA Global Research</span></p></figcaption></figure><p class=\"paywall-full-content invisible\"></p> <p class=\"paywall-full-content invisible\">Instead, it is an ongoing issue, with releases more than doubled from 15 in 2019 to 39 last year. These things take time to unfold in the market, as collectors usually make long-term decisions about what to buy and how to buy it. Moreover, the inventory issues for retailers and distributors are not less important, and these do not flow immediately to the quarterly results.</p> <p class=\"paywall-full-content invisible\">Even if sales in Q1 2023 increased, contributing profits from the WOTC segment decreased again and were 28% lower than last year. From 46.4% in FY20, 42.5% in FY21, and 40.6% in FY22, HAS is guiding for a profitability decline in FY23 as the segment's operating margin ranges to \"high 30% as investments for long-term growth continue.\" While I think Haas made a good point in highlighting the issue, he folded too soon, pressured to align with the share price movement rather than sticking to his guns and looking at the fundamentals.</p> <p class=\"paywall-full-content invisible\">I believe Hasbro WOTC \"investments\" are, instead, higher costs in the form of rewards needed to cool off the excessive milking and mend ties with the enraged MtG and DnD playing communities. The level of relationship strain between the gamers and the company reached new highs at the end of 2022, where every HAS article I stumbled upon on Seeking Alpha had a disconcerting comments section: disgruntled Dungeon Masters and players showing their anger towards what they believe to be a betrayal from WOTC in their regards. If this was the situation on an investing site, I can't imagine what it could have been on a gaming one.</p> <p class=\"paywall-full-content invisible\">True, unsatisfied players tend to be more vocal than happy ones, and anger towards the toymaker does not mean they will stop playing the game. But still, an unhappy fanbase does not strike me as an excellent foundation for long-term growth. Sticking to the facts, WOTC walked back on changes such as the DnD Open Game License (OGL) revision, but not before some damage was done. In January, Kobold's press, arguably the most influential distributor of DnD products, announced the development and release of its <a href=\"https://koboldpress.com/raising-our-flag/\" rel=\"nofollow\">parallel material</a> to play the game. It will take more time to assess the impact of this issue on WOTC revenues and margins.</p> <p class=\"paywall-full-content invisible\">My final take is simple: WOTC revenues will not decline. But margins will, and I expect only moderate growth from the current $1.2-$1.3 billion base. Both DnD and MtG are mature games that rely on the continuous engagement of the gamer communities. The games online mostly resonate with players who already play the game offline, as they have a steep learning curve. With the recent outcries, Hasbro might be finally learning its lesson, deciding to \"invest\" in engagement rather than milk players to death. As HAS backtracks from its aggressive behavior to monetize at all costs in favor of a more balanced relationship with the community, I believe the exodus of players will eventually stop or reverse.</p> <h2 class=\"paywall-full-content invisible\"><strong>Putting the numbers together</strong></h2> <p class=\"paywall-full-content invisible\">In 2022, HAS consumer products division reported a $217.3 million operating income on revenues of $3,572.5 million, and WOTC reported a $538.3 million operating income on revenues of $1,325.1 million. WOTC margin was only 189 bps lower than the 2021 value of 42.5% but a whopping 575 bps lower than 2020. Another problem was the more significant decrease of almost 400 bps in the consumer products segment, with a 6.1% operating income margin vs. 10.1% in the year-ago period.</p> <p class=\"paywall-full-content invisible\">I modeled a 5Y forecast to FY27, and even by using what I believe is a set of quite bullish expectations, I couldn't envision HAS reaching management's targets of 20% profitability by 2027 and $1 billion cash flow by 2025. Even by assuming:</p> <ol class=\"paywall-full-content invisible\"> <li>A 7% top-line CAGR for the WOTC division and 38% profit margin for FY23 and beyond, with no further declines through the 5Y period.</li> <li>A 4% CAGR after 2025 for the Consumer division, rebounding after a likely recession in FY23-FY24, improved operating income towards 12% driven by the dropping of less desirable product lines and increased focus on the company's leading franchises.</li> <li>A successful sale by next year of the E-One division.</li> <li>A 30% decrease in corporate overheads for FY23, driven by the reorganization of the business.</li> </ol> <p class=\"paywall-full-content invisible\">The company will achieve its cash flow target only at the end of the forecast period, with adjusted profitability in the 18%-19% range. In my view, management will miss the expectations considering the ongoing problems.</p> <p class=\"paywall-full-content invisible\"></p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2023/5/18/46658286-16844056487059617_origin.png\" rel=\"lightbox\" data-width=\"780\" data-height=\"472\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/5/18/46658286-16844056487059617.png\" alt=\"5Y HAS forecast and valuation\" contenteditable=\"false\" loading=\"lazy\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>And Value For All</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">Based on the operating income estimates, I calculated a fair value estimate for Hasbro of $75 by 2027 using a simple DCF model. While I believe an investment in Hasbro has the potential to appreciate from here, I expect the annualized return for shareholders, even after accounting for the dividends received, to be below 9%, which is too low to get me interested.</p> <h2 class=\"paywall-full-content invisible\"><strong>Conclusion</strong></h2> <p class=\"paywall-full-content invisible\">Hasbro holds a leading position in the American toy industry, and the company manufactures and sells toys of resonating brands. Additionally, the Wizards of the Coast division provides HAS with a moat-worthy, highly profitable business that has proven extremely difficult to replicate by competitors.</p> <p class=\"paywall-full-content invisible\">Since I have focused my article on the risks and highlighted certain negatives of HAS, readers may be shocked to learn that, in the end, I do not hold a bearish view of the stock. On the contrary, I think HAS is a good company because of its IP strength and established position. However, HAS is struggling with several issues that I would like to see solved before committing any capital. Additionally, management's track record in recent years has been questionable, and the previous leadership turned a -$0.6 billion net debt position into a company needing to deleverage and having nothing to show. The CEO responsible for the E-One deal, Brian Goldner, passed away in 2021 and, unfortunately, I believe the strategic rationale for this acquisition died with him. E-One CEO Darren Throop is also no longer with the company. Leadership is now in the hands of Chris Cocks, who served as President of the WOTC and digital gaming segment until his promotion.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Given the challenges ahead for the new management, I do not think shares look cheap. Even with moderately bullish assumptions in my 5-year forecast, the stock will likely produce an 8.7% total return at best for shareholders, already accounting for the dividends. Given the uncertain macro outlook, I assign a neutral/hold rating and recommend waiting for likely better entry points ahead.</p>", "twitContent": "$HAS - Hasbro: Do Not Rush, Wait For A Better Price To Return. https://seekingalpha.com/article/4605809-hasbro-do-not-rush-wait-for-a-better-price-to-return?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "101928", "type": "author"}}, "sentiments": {"data": [{"id": "457057", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "568808", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4605809-hasbro-do-not-rush-wait-for-a-better-price-to-return", "canonical": "https://seekingalpha.com/article/4605809-hasbro-do-not-rush-wait-for-a-better-price-to-return", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1128321204/image_1128321204.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "101928", "type": "author", "attributes": {"company": null, "slug": "and-value-for-all", "userId": 46658286, "tagId": 568808, "bio": "<p>Finance Director. I work for a large-cap, EU-<span>listed, consumer goods company. <br>Passionate about everything concerning finance and, in particular, investing. I manage my portfolio. </span></p><p>Current equity portfolio follows a buckets allocation strategy (as of 2023) that's about 50% ETF, 25% High Yield (incl. preferred shares), 15% DGI, and 10% high-conviction names (kind of bin collecting anything not fitting the other  categories, but mostly spec growth & deep value).</p><p>At the ongoing assets progression rate, I am hopeful to retire from corporate life and turn to full-time investing within a decade. In the meantime, I will continue contributing to Seeking Alpha as a hobby and for self-development.</p><p>I am a former semi-pro chess player, now at high risk of becoming a ski bum: that's why I tend not to write much during winter months.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/046/658/286/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/046/658/286/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/046/658/286/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/046/658/286/extra_large_pic.png"}, "nick": "And Value for All", "deactivated": null, "memberSince": 2016, "isRss": false, "contributorSince": 2016, "followersCount": 2051}, "relationships": {"user": {"data": {"id": "46658286", "type": "user"}}, "userBioTags": {"data": [{"id": "893784", "type": "userBioTag"}, {"id": "893785", "type": "userBioTag"}, {"id": "893786", "type": "userBioTag"}, {"id": "893787", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/and-value-for-all", "profileUrl": "/author/and-value-for-all", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "568808", "type": "tag", "attributes": {"slug": "and-value-for-all", "name": "And Value for All", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/and-value-for-all"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "457057", "type": "sentiment", "attributes": {"articleId": 4605809, "type": "neutral", "createdAt": "2023-05-18T13:50:54.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4605809", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}