{"data": {"id": "4620347", "type": "fullArticle", "attributes": {"publishOn": "2023-07-27T08:00:00-04:00", "isLockedPro": false, "commentCount": 90, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"samuel-smith": {"id": 573365, "slug": "samuel-smith", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "epd": {"id": 3360, "slug": "epd", "kind": "common", "non_theme": true}, "wmb": {"id": 1357, "slug": "wmb", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "alternative-investing": {"id": 150933, "slug": "alternative-investing", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "tier-1": {"id": 603709, "slug": "tier-1", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "energy": {"id": 10, "slug": "energy", "kind": "sector", "path": "/sectors/energy", "title": "Energy Analysis", "sasource": "theme_breadcrumb"}}, "title": "Retire With Dividends: Enterprise Products Partners Vs. The Williams Companies", "summary": ["Retiring with dividends from dependable, low-risk companies can lead to a higher quality of life in retirement, as it eliminates the need to predict stock market trends and reduces the impact of market volatility.", "The article compares two high-yielding dividend stocks, Enterprise Products Partners and The Williams Companies, both of which are midstream infrastructure businesses in the energy sector.", "We share which one is the better buy at the moment."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-07-27T08:00:00-04:00", "isModerated": false, "closestTradingDate": "2023-07-27", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 46, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of EPD, WMB either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-w750\" alt=\"Dollar banknote saving money in glass jar. Banner Unrecognizable woman moderate consumption and economy Collecting money. Tips. Business, finance, saving, banking and people concept. Extra money, passive income\" data-id=\"1429614333\" data-type=\"getty-image\" width=\"1536px\" height=\"569px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Anastasiia Yanishevska/iStock via Getty Images</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <p>Retiring with dividends from very dependable, low risk companies can lead to a higher quality of life in one's golden years. This is because:</p> <ol> <li>Investors don't need to try to guess about where the stock market will be five, 10, or even<span class=\"paywall-full-content invisible\"> 15 years from now. All they need to do is know what their retirement budget will be and ensure that they are getting more than this amount from high quality dividend stocks that will also grow their passive income stream at a pace that exceeds inflation.</span> </li> <li class=\"paywall-full-content invisible\">Emotions - an investor's greatest enemy - become much easier to control since market volatility no longer means as much to the income-focused investor. Sure, everyone loves their account balance to increase over time, but if you are living off of dividends, as long as your income stream continues to pour in and increase at least at the rate of inflation, it ultimately does not matter whether or not the stock market crashes next month or not. Even better, stock market sell-offs provide valuable opportunities for income investors to reinvest their excess cash flow at more attractive dividend yields than they would have been able to obtain otherwise. This means that they can actually grow their passive income stream faster in the wake of stock market crashes, therefore accelerating passive income investors' wealth building rather than setting them back. While many retail investors panic and sell near the bottom during market crashes, dividend investors tend to buy during crashes and therefore end up far ahead of their less disciplined peers over the long-term.</li> <li class=\"paywall-full-content invisible\">With the emotions and mental calculations largely eliminated, retirees living off of dividends can kick back, relax, and enjoy life rather than being consumed by financial matters.</li> </ol> <p class=\"paywall-full-content invisible\">In this article, we will compare two of the most dependable high yielding dividend stocks out there and share our view on which one is the better buy at the moment: Enterprise Products Partners (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/EPD\" title=\"Enterprise Products Partners L.P. Common Units\">EPD</a></span>) and The Williams Companies (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/WMB\" title=\"The Williams Companies, Inc.\">WMB</a></span>).</p> <h2 class=\"paywall-full-content invisible\">EPD Stock Vs. WMB Stock: Business Model</h2> <p class=\"paywall-full-content invisible\">Both EPD and WMB are midstream infrastructure businesses. EPD's business model is diversified across a variety of energy commodities and asset types and also benefits from considerable scale. EPD owns over 50,000 miles of pipelines, 260 MMBls of liquids storage capacity, 29 natural gas processing plants, 25 fractionators, and 20 deep-water docks. Its geographic and commodity diversification work alongside its take-or-pay fee-based long-term contracts to deliver very dependable cash flows and consistently high returns on invested capital for investors.</p> <p class=\"paywall-full-content invisible\">As a result, it is not surprising that EPD has delivered market crushing returns over the long-term:</p> <figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/7/26/saupload_bd8787e2dae2eb5bc22c7a7f6513634b.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\" title=\"https://ycharts.com\" target=\"_blank\">YCharts</a></figcaption></figure><p class=\"paywall-full-content invisible\">WMB, meanwhile, is solely focused on natural gas midstream infrastructure, split up across four business segments:</p> <ul class=\"paywall-full-content invisible\"> <li> <em>Northeast G&amp;P:</em> natural gas gathering, processing (G&amp;P) and fractionation assets located in the Marcellus &amp; Utica Shales</li> <li> <em>Transmission &amp; Gulf of Mexico:</em> U.S. interstate natural gas pipelines and deepwater Gulf of Mexico natural gas and crude oil services.</li> <li> <em>West: </em>a diversified group of natural gas G&amp;P businesses serving the Barnett, Eagle Ford, Haynesville, Mid-Continent, Permian, and the Rockies supply areas.</li> <li> <em>Gas &amp; NGL Marketing Services:</em> Gas and NGL marketing services for end-users, customers, and third-party NGL producers.</li> </ul> <p class=\"paywall-full-content invisible\">The bullish long-term outlook for natural gas and NGL exports helps to offset the increased risk that comes with being solely focused on just natural gas rather than the more diversified commodity exposure that EPD enjoys.</p> <p class=\"paywall-full-content invisible\">Moreover, WMB has carefully crafted a strategically situated asset portfolio with exposure to 14 important supply areas and transmission pipes near higher population density areas. This gives it strong organic growth potential and a very favorable asset re-contracting environment.</p> <p class=\"paywall-full-content invisible\">Like EPD, it enjoys considerable scale as well as it handles nearly one-third of U.S. natural gas production and owns over 30,000 miles of pipeline across 25 states. It also generates the majority of its cash flow from fee-based, long-term, commodity price resistant contracts. It also generates very attractive returns on invested capital.</p> <p class=\"paywall-full-content invisible\">Overall, we view both businesses as being equally strong in this category. EPD has greater diversification, but WMB is a very strong player in the fossil fuel with the brightest future. Both generate very stable cash flows and deliver high returns on invested capital for shareholders. As a result, we view both as among the very best businesses in the midstream industry today.</p> <h2 class=\"paywall-full-content invisible\">EPD Stock Vs. WMB Stock: Balance Sheet</h2> <p class=\"paywall-full-content invisible\">While both businesses have very strong balance sheets, EPD wins this comparison hands-down given its sector-best A- credit rating. Moreover, EPD has a very low leverage ratio of 3.0x, ~$4 billion in liquidity, and a 20-year weighted average debt term to maturity with no debt maturities remaining in 2023 and very management maturities in 2024 and 2025 with only 18% of its total debt maturing over the next five years. When combined with the fact that 96.9% of its debt is fixed rate, EPD is in great shape to weather a scenario in which interest rates remain higher for longer and/or if capital markets were to suddenly close.</p> <p class=\"paywall-full-content invisible\">WMB, meanwhile also has a strong balance sheet as evidenced by its BBB credit rating. It has a weighted average term to maturity of ~12 years with the vast majority of its debt not maturing until 2028 and beyond. It has also prioritized deleveraging in recent years by growing its EBITDA and paying down debt. As a result, it has successfully reduced its net debt to adjusted EBITDA ratio by 26% from 4.8x in 2018 to 3.55x as of year-end 2022. While not quite as low as EPD's leverage ratio, it is still definitely in the conservative range.</p> <p class=\"paywall-full-content invisible\">Perhaps most importantly, both businesses are retaining a lot of cash flow after returning capital to investors, giving them immense flexibility to pay down debt opportunistically and avoid having to tap the equity markets when it does not behoove them to do so.</p> <figure contenteditable=\"false\" class=\"paywall-full-content invisible\"><picture></picture></figure><h2 class=\"paywall-full-content invisible\">EPD Stock Vs. WMB Stock: Dividend</h2> <p class=\"paywall-full-content invisible\">EPD has a very impressive track record of growing its distribution for roughly one-quarter of a century. Moreover, management has recently accelerated distribution growth from a low single digits CAGR to a mid single digits CAGR. EPD should be able to sustain this growth rate for the foreseeable future thanks to the plethora of attractive organic growth and bolt-on acquisition opportunities available to it as well as its strong distribution coverage ratio of nearly 1.8x.</p> <p class=\"paywall-full-content invisible\">WMB, meanwhile, is likely to grow its dividend even faster. Over the past five years, it has grown its dividend by nearly one-third:</p> <figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/7/26/saupload_6c0dadbcbd33bcd546c3b25889df2ad2.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\" title=\"https://ycharts.com\" target=\"_blank\">YCharts</a></figcaption></figure><p class=\"paywall-full-content invisible\">and it has grown its DCF per share at an even faster CAGR of 8.2% over that time span. Thanks to growing its DCF at a faster rate than its dividend, WMB has ballooned its dividend coverage ratio to an expected 2.25x in 2023. Moving forward, it will likely grow its dividend in-line with DCF per share growth, resulting in company guidance of a 5-7% CAGR for the foreseeable future.</p> <h2 class=\"paywall-full-content invisible\">EPD Stock Vs. WMB Stock: Valuation</h2> <p class=\"paywall-full-content invisible\">When comparing the valuations side by side below, we see that EPD appears to have the clear upper hand as the more attractively priced business:</p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <tr> <td>Metric</td> <td>EV/EBITDA</td> <td>P/DCF</td> <td>Dividend Yield</td> <td>Yield + Expected Growth</td> </tr> <tr> <td>EPD</td> <td>9.45x</td> <td>7.72x</td> <td>7.5%</td> <td>12.5%</td> </tr> <tr> <td>WMB</td> <td>10.43x</td> <td>9.01x</td> <td>5.4%</td> <td>11.4%</td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p class=\"paywall-full-content invisible\">While WMB does issue a 1099 instead of a K1 and is a C-Corp rather than an MLP, which does earn it somewhat of a premium to EPD, EPD's lower overall risk profile and superior long-term track record make it look very undervalued relative to WMB.</p> <h2 class=\"paywall-full-content invisible\">EPD Stock Vs. WMB Stock: Investor Takeaway</h2> <p class=\"paywall-full-content invisible\">Many retirees who concentrate their wealth into a combination of large index funds and bonds tend to plan around the 4% Rule. As a result, to retire with an $80,000 budget, retirees need to save up $2 million for their portfolio. However, there is a better way in our view.</p> <p class=\"paywall-full-content invisible\">By investing in high quality, low risk, high yield stocks, investors can generate passive income yields well in excess of 4% that will also generally grow at or above the rate of inflation over the long-term. This means that they not only benefit from not having to worry as much about market volatility and being tempted to sell at inopportune times, but they also can often retire faster than their 4% Rule bound peers. If their portfolio throws off 7% in very reliable dividend income and is growing that dividend income at a ~5% CAGR, they can potentially safely retire with a higher withdrawal rate than 4%. Of course, consult a financial advisor and/or planner to ensure that any investment strategy that you pursue is appropriate for your unique circumstances, risk tolerance, psychological makeup, and financial and life goals.</p> <p class=\"paywall-full-content invisible\">While both EPD and WMB fit this profile, we believe that overall EPD is the better buy at the moment. However, it is important to keep in mind that EPD issues a K-1 whereas WMB is a C-Corp that issues a 1099 tax form, so WMB may be a better fit for you if your tax situation prevents you from wanting to deal with K-1s and the tax implications that come with them. If you aren't sure, consult a tax advisor.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">At High Yield Investor, we are generating a near <a href=\"https://seekingalpha.com/mp/1369-high-yield-investor/articles/5897433-portfolio-review-july-2023\">8% weighted average portfolio</a> yield from some high quality businesses - including WMB and EPD - that not only comfortably cover their dividend payouts, but also are continuing to grow their dividends at a healthy rate.</p>", "twitContent": "$EPD $WMB - Retire With Dividends: Enterprise Products Partners Vs. The Williams Companies. https://seekingalpha.com/article/4620347-retire-with-dividends-enterprise-products-partners-vs-the-williams-companies?source=tweet ", "innerMarketing": "<p><strong>If you want full access to our Portfolio and all our current Top Picks, feel free to join us at High Yield Investor for a</strong> <strong><a href=\"https://seekingalpha.com/checkout?service_id=mp_1369\">2-week free trial</a></strong><br></p><p><strong>We are the #1-rated high-yield investor community on Seeking Alpha with 1,500+ members on board and a perfect 5/5 rating from 150+ reviews:</strong></p><p><!--StartFragment--><a href=\"https://seekingalpha.com/checkout?service_id=mp_1369\"><img src=\"https://static.seekingalpha.com/uploads/2022/11/16/52820996-16685878374313185.png\"></a><!--EndFragment--></p><p><strong>You won't be charged a penny during the free trial, so you have nothing to lose and everything to gain.</strong><!--EndFragment--></p><blockquote><h2><em><a href=\"https://seekingalpha.com/checkout?service_id=mp_1369\">Start Your 2-Week Free Trial Today! </a></em><em></em></h2></blockquote><p><!--StartFragment--><a href=\"https://seekingalpha.com/checkout?service_id=mp_1369\"><img src=\"https://static.seekingalpha.com/uploads/2021/1/6/47771937-16099737379932525.png\"></a><!--EndFragment--></p><p><span><!--EndFragment--> <br></span></p><p><strong><em></em></strong></p>", "marketingBullet": "Looking for a portfolio of ideas like this one? Members of High Yield Investor get exclusive access to our subscriber-only portfolios. <a href='/checkout?service_id=mp_1369&source=mp_marketing_text_top' sasource='mp_marketing_text_top'>Learn More »</a>", "isReit": false, "videoData": null, "marketingBulletVariant": "I am Samuel Smith, Vice President of Leonberg Capital. I lead the investing group <a href=\"/checkout?service_id=mp_1369&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A52820996%7Csection_asset%3Aauthor_bullets%3A-high-yield-investor\" data-test-id=\"author-custom-template-link\">High Yield Investor</a> where we do our best to find the right balance between safety, growth, yield, and value.", "marketingBio": "Samuel Smith is Vice President of Leonberg Capital, he has a diverse background that includes being lead analyst at several highly regarded dividend stock research firms. He is a Professional Engineer and Project Management Professional and holds a B.S. in Civil Engineering & Mathematics from the United States Military Academy at West Point and has a Masters in Engineering. \n\nSamuel leads the investing group <a href=\"/checkout?service_id=mp_1369&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A52820996%7Csection_asset%3Aauthor_root%3A-high-yield-investor\" data-test-id=\"author-custom-template-link\">High Yield Investor</a> investing group. Samuel teams up with Jussi Askola and Paul R. Drake where they focus on finding the right balance  between safety, growth, yield, and value. High Yield Investor offers real-money core, retirement, and international portfolios. The services also features regular trade alert, educational content, and an active chat room of like minded investors. <a href=\"/checkout?service_id=mp_1369&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A52820996%7Csection_asset%3Aauthor_root%3A-high-yield-investor\" data-test-id=\"author-custom-template-link\">Learn more</a>.", "audioDuration": null}, "relationships": {"author": {"data": {"id": "102896", "type": "author"}}, "sentiments": {"data": [{"id": "473636", "type": "sentiment"}, {"id": "473637", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "3360", "type": "tag"}, {"id": "1357", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "573365", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "150933", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "603709", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4620347-retire-with-dividends-enterprise-products-partners-vs-the-williams-companies", "canonical": "https://seekingalpha.com/article/4620347-retire-with-dividends-enterprise-products-partners-vs-the-williams-companies", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1429614333/image_1429614333.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "1369", "type": "authorResearch", "attributes": {"createdAt": "2020-12-08T14:02:47-05:00", "title": "High Yield Investor", "rating": "5.0", "reviewCount": 187, "shortPitch": "Become a “High Yield Investor” with our 8% Yielding Portfolio.", "categories": ["Income", "High_Yield"], "serviceAssistantIds": [47771937], "inAppPurchasesAllowedInIos": true, "inAppPurchasesAllowedInAndroid": true, "activeSubscriptionsCount": 1460, "androidIapPlan": "semi_annual", "iosIapPlan": "annual", "description": "High Yield Investor (HYI) focuses on safe, growing dividends via a meticulous research process that emphasizes smaller companies, boring sectors, sustainable dividends and strong valuations. Members receive regular coverage of 100s of high income securities across diversified sectors and geographies, exclusive CEO interviews, industry expert insights, and a community of fellow income investors. ", "landingPageColor": "light-blue", "adUnits": ["direct_access", "trading_alert", "active_chat", "exclusive_idea", "monthly_portfolio", "wildcard"], "tempData": {}, "price": 67.0, "wildcardText": "8% Yielding Portfolio", "slug": "high-yield-investor", "annualPriceWithDiscount": 399.2, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": true}, "relationships": {"author": {"data": {"id": "105975", "type": "author"}}}}, {"id": "102896", "type": "author", "attributes": {"company": null, "slug": "samuel-smith", "userId": 47771937, "tagId": 573365, "bio": "<p>Samuel Smith has a diverse background that includes being lead analyst and Vice President at several highly regarded dividend stock research firms and running his own dividend investing YouTube channel. He is a Professional Engineer and Project Management Professional and holds a B.S. in Civil Engineering & Mathematics from the United States Military Academy at West Point and has a Masters in Engineering from Texas A&M with a focus on applied mathematics and machine learning.</p><p>Samuel leads the <a href=\"https://seekingalpha.com/checkout?service_id=mp_1369\">High Yield Investor</a> investing group. Samuel teams up with Jussi Askola and Paul R. Drake where they focus on finding the right balance between safety, growth, yield, and value. High Yield Investor offers real-money core, retirement, and international portfolios. The service also features regular trade alerts, educational content, and an active chat room of like-minded investors. </p><p><a href=\"https://seekingalpha.com/checkout?service_id=mp_1369\">Learn more</a></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/047/771/937/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/047/771/937/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/047/771/937/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/047/771/937/extra_large_pic.png"}, "nick": "Samuel Smith", "deactivated": null, "memberSince": 2016, "isRss": false, "contributorSince": 2017, "followersCount": 37577}, "relationships": {"user": {"data": {"id": "47771937", "type": "user"}}, "userBioTags": {"data": [{"id": "985489", "type": "userBioTag"}, {"id": "985490", "type": "userBioTag"}, {"id": "985491", "type": "userBioTag"}, {"id": "985492", "type": "userBioTag"}, {"id": "985493", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1369", "type": "authorResearch"}}}, "links": {"self": "/author/samuel-smith", "profileUrl": "/author/samuel-smith", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "3360", "type": "tag", "attributes": {"slug": "epd", "name": "EPD", "company": "Enterprise Products Partners L.P. Common Units", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "10", "type": "sector"}}}, "links": {"self": "/symbol/EPD"}}, {"id": "1357", "type": "tag", "attributes": {"slug": "wmb", "name": "WMB", "company": "The Williams Companies, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/WMB"}}, {"id": "573365", "type": "tag", "attributes": {"slug": "samuel-smith", "name": "Samuel Smith", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/samuel-smith"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "150933", "type": "tag", "attributes": {"slug": "alternative-investing", "name": "Alternative Investing", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/alternative-investing"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "603709", "type": "tag", "attributes": {"slug": "tier-1", "name": "Tier 1", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/tier-1"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "473636", "type": "sentiment", "attributes": {"articleId": 4620347, "type": "bullish", "createdAt": "2023-07-27T08:00:00.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4620347", "type": "article"}}, "tag": {"data": {"id": "3360", "type": "tag"}}}}, {"id": "473637", "type": "sentiment", "attributes": {"articleId": 4620347, "type": "neutral", "createdAt": "2023-07-27T08:00:00.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4620347", "type": "article"}}, "tag": {"data": {"id": "1357", "type": "tag"}}}}]}