{"data": {"id": "4559364", "type": "fullArticle", "attributes": {"publishOn": "2022-11-20T22:23:04-05:00", "isLockedPro": false, "commentCount": 87, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"confounded-interest": {"id": 578082, "slug": "confounded-interest", "kind": "common", "non_theme": true}, "editors-picks": {"id": 1302, "slug": "editors-picks", "kind": "general", "path": "/editors-picks", "title": "Editors' Picks"}, "contrarian": {"id": 115442, "slug": "contrarian", "kind": "common", "non_theme": true}, "temporary-headwinds": {"id": 143011, "slug": "temporary-headwinds", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "nee": {"id": 16241, "slug": "nee", "kind": "common", "non_theme": true}, "so": {"id": 195, "slug": "so", "kind": "common", "non_theme": true}, "wec": {"id": 202, "slug": "wec", "kind": "common", "non_theme": true}, "dte": {"id": 168, "slug": "dte", "kind": "common", "non_theme": true}, "ed": {"id": 170, "slug": "ed", "kind": "common", "non_theme": true}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "alpha-rich-investment-style": {"id": 114682, "slug": "alpha-rich-investment-style", "kind": "general"}, "alpha-rich-opportunity": {"id": 114692, "slug": "alpha-rich-opportunity", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "utilities": {"id": 55, "slug": "utilities", "kind": "sector", "path": "/stock-ideas/utilities", "title": "Utilities ", "sasource": "theme_breadcrumb"}}, "title": "Dominion Energy: It May Be Woke, But It Won't Go Broke", "summary": ["Dominion Energy, recently has been hit with a plethora of analyst downgrades given news of a top-to-bottom business review by management.", "Ironically, this review was initiated by management to identify ways to lift the stock price. Mission failed. So far.", "Dominion Energy has been lambasted for its ambitious renewable energy plans, which have been largely asked for by the states that it serves.", "While the financial payoffs of these projects are yet to be determined, Dominion, in my opinion, is on solid financial footing, has a great demographic base to work with, and is currently trading at an attractive price for long-term investors."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2022-11-20T22:23:14-05:00", "isModerated": false, "closestTradingDate": "2022-11-21", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 24, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of D, SO either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />&quot;I am not a licensed financial advisor. This is not a solicitation to buy or sell a specific security nor is it to be construed as investment advice, please contact your licensed financial and tax advisor for advice to your specific situation.\nThis article is an opinion piece only and should not be construed as fact or be represented as such, please perform your own due diligence prior to investing in this or any equity.”</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w750\" alt=\"Inflation Reduction Act Boosts Federal Spending On Renewable Energy\" data-id=\"1417180248\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Chip Somodevilla/Getty Images News</p></figcaption></figure><div class=\"inline_ad_placeholder\"></div> <p>Renewable energy has long been a hot-button issue in politics. With those on the far-left praising it as a panacea for all of the world's environmental problems and those on the far-right as a woke, value destroying waste of time and money. The<span class=\"paywall-full-content invisible\"> truth, like most things, is likely found somewhere in the middle.</span></p> <p class=\"paywall-full-content invisible\">Dominion Energy (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>) has found itself and its shareholders smack dab in the middle of this controversy given the proposed $10 billion offshore wind farm to be built in Virginia. Given this backdrop, the company's recently announced top-to-bottom business review, presented by the CEO on the <span class=\"highlighted_text\"><a href=\"https://seekingalpha.com/article/4553194-dominion-energy-inc-d-q3-2022-earnings-call-transcript\">recent earnings call</a></span>, has taken flight in the stock market like a lead balloon.</p> <p class=\"paywall-full-content invisible\">In this article, I would like to explore the rationale for this review and express why I believe long-term investors may do well in giving the company a thorough look at currently offered valuations.</p> <h2 class=\"paywall-full-content invisible\">Overview</h2> <p class=\"paywall-full-content invisible\">It has certainly been a miserable last 60 days to be a shareholder in Dominion Energy. The stock price has cratered from the $84 range reached in mid-September all the way down to $59.16 as of Friday's close.</p> <figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2022/11/19/saupload_b01e0b27cda7b14dab02184ec61bb2cc.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\" title=\"https://ycharts.com\" target=\"_blank\">YCharts</a></figcaption></figure><p class=\"paywall-full-content invisible\">Surely, some of this sharp drop is from rapidly rising interest rates hitting the utility sector at large, however, since November, the latest leg down is primarily due to Wall Street analysts downgrading the company en-masse upon the announcement, during the <span class=\"highlighted_text\"><a href=\"https://seekingalpha.com/pr/19006757-dominion-energy-announces-third-quarter-2022-earnings-initiates-business-review\">Q3 earnings release</a></span>, of a top-to-bottom business review initiated by the company to boost the stock price.</p> <p class=\"paywall-full-content invisible\">The business review initiation has been taken by the market as a de facto admission that something is wrong with company operations, however, on the conference call, the company reiterated guidance for the 4th quarter and stated that the main driver of this review will be focused on providing a more predictable earnings growth model going forward with a focus on further emphasizing the regulated utility operations.</p> <p class=\"paywall-full-content invisible\">In my opinion, clearly, this review indicates that the 50% ownership of Cove Point, the LNG export terminal based on the east coast of the United States is now for sale, along with other non-regulated assets still under Dominions ownership.</p> <h2 class=\"paywall-full-content invisible\">Renewable Energy</h2> <p class=\"paywall-full-content invisible\">The state of Virginia, Dominions largest market by far, all but <a href=\"https://energy.virginia.gov/energy-efficiency/documents/2022_Virginia_Energy_Plan.pdf\" rel=\"nofollow\" title=\"https://energy.virginia.gov/energy-efficiency/documents/2022_Virginia_Energy_Plan.pdf\" target=\"_blank\">mandated</a> the change away from coal in recent years and in 2020, the Virginia General Assembly passed the Virginia Clean Economy Act, which mandated a goal of 100% zero-carbon energy generation by 2050 and prescribed increasingly strict Renewable Portfolio Standards for Virginia's investor-owned electric utilities.</p> <p class=\"paywall-full-content invisible\">The company, for some time now, has been retooling its generation capacity at the direction of its regulators, with a clear focus on renewable energy. While this evolution is still unfolding, the company is likely noticing growing pains in the costs involved in such generation operations.</p> <p class=\"paywall-full-content invisible\">Renewable energy, by its nature, is a large upfront CAPEX, with in theory, much lower OPEX costs involved. What this means for Dominion is that regulators must be 100% on board with the recouping of these large upfront costs associated with the transition from fossil fuels. If regulators are not on board, the company and its shareholders are dealt the brunt of any cost overruns, which are common, for these projects.</p> <p class=\"paywall-full-content invisible\">A good example of how this negotiation process works can be seen in the recently submitted settlement by Dominion and regulators in Virginia regarding the huge offshore wind generation facility currently under design.</p> <p class=\"paywall-full-content invisible\">Virginia state regulators, in August, issued a decree demanding that Dominion issue a performance guarantee on the project that would issue financial penalties if either development costs increase or performance of the turbines, once operational, was not adequate. In the company's response, Dominion stated that the project would certainly be cancelled if this decree was upheld.</p> <p class=\"paywall-full-content invisible\">Thankfully, it appears that cooler heads have prevailed in this dispute and a resulting settlement agreement was reached between the company and the state of Virginia outlining a revised cost sharing plan, which provides 100% cost recoup up to a limit of $10.3 billion.</p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2022/11/18/20926831-1668825043990832_origin.png\" rel=\"lightbox\" data-width=\"1063\" data-height=\"819\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2022/11/18/20926831-1668825043990832.png\" alt=\"Wind cost share agreement\" contenteditable=\"false\" loading=\"lazy\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Dominion Energy</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">The company claims that 75% of the costs associated with construction of this facility are already fixed in place and the company expects that nearly 90% of the cost structure will be fixed by early 2023 which, if accomplished, would de-risk a large portion of this project well before the estimated 2026 completion date.</p> <p class=\"paywall-full-content invisible\">This project, and the negotiated settlement reached, show both the positives of projects such as these, with potentially 100% of the cost burden falling on customers and a guaranteed 9.35% return on investment for Dominion, along with the negatives, such as regulators wanting shareholders to shoulder more and more of the cost risks as the headline price tags go up.</p> <p class=\"paywall-full-content invisible\">I view this \"business review\" as potentially a shot across the bow of Virginia regulators by stating that if you actually want renewable energy, we can provide it, but do not change the rules of the game after it starts.</p> <h2 class=\"paywall-full-content invisible\">Interest Rates</h2> <p class=\"paywall-full-content invisible\">Utilities in general have had a rough few months given that interest rates across the board have increased substantially. Utilities, such as Dominion, are viewed less favorably by investors when corporate bonds and treasury bills offer similar yields and even greater security and therefore force shares down to provide a higher yield.</p> <p class=\"paywall-full-content invisible\">In comparison to the industry as a whole, Dominion appears to be no worse off than others in the utility space as its near-term maturities appear in line with industry averages.</p> <figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2022/11/19/20926831-16689103219608026_origin.png\" rel=\"lightbox\" data-width=\"1052\" data-height=\"606\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2022/11/19/20926831-16689103219608026.png\" alt=\"Interest rates\" contenteditable=\"false\" loading=\"lazy\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Dominion Energy</span></p></figcaption></figure><p class=\"paywall-full-content invisible\">The company, on the Q3 conference call, reminded investors that the company has the ability to pass along interest rate increases to customers on a significant chunk of its rate base. In addition, the company stated that it had not noticed a significant impact to business results thus far.</p> <blockquote class=\"paywall-full-content invisible\"> <p> </p> <p><em>Next, about 50% of our interest rate exposure, the same floating rate debt and all fixed rate debt maturities over the next three years is at our regulated utilities, where it is a cost of service. As a reminder, about 35% of our existing rate base and over 75% of our growth capital is rider eligible, which allows for timely annual true-ups.</em></p> <p><em>Looking ahead to future issuances of long-term debt, we manage that interest rate exposure through a variety of hedging and treasury activities, including through what is nearly $9 billion notional of interest rate hedges, which will help us keep future costs low at our parent company and at our regulated utilities.</em></p> <p><em>So what does that mean? That portfolio allows us to lock-in treasury rates for issuances between now and 2026 at rates almost as low as 1%. Lastly, a reminder that economic growth and inflation and higher interest rates are all part of the mix when it comes to determining authorized ROEs across our utility businesses and our periodic rate proceedings.</em></p> <p><em>So in summary, the current rate environment is dynamic, and we're monitoring it closely. At present, however, we're not seeing an earnings hurt from significantly higher interest rates so far this year, as higher rates thus far have generally been offset by the factors I just described. We will certainly provide an update on rates, interest expense, hedging strategies and other mitigants as we provide an update on our business review and guidance on our fourth quarter call early next year.</em></p> </blockquote> <p class=\"paywall-full-content invisible\">I do not view interest rate risk as a significant business headwind for the company, or at least, it appears to be no worse than others in the utility industry. Rising rates are certainly a concern in the near-term and may affect valuations throughout the utility sector, however, valuations at Dominion have certainly come down significantly to accommodate this risk.</p> <h2 class=\"paywall-full-content invisible\">Valuation</h2> <p class=\"paywall-full-content invisible\">Dominion, as we have discussed, has been hammered recently and taken the stock down to levels not seen since mid-2013. The company currently trades at a price to earnings multiple of 14.68, roughly 25% below its 5-year average of 19.41. The company also currently offers a competitive 4.45% dividend yield to boot.</p> <p class=\"paywall-full-content invisible\">Shares are currently valued at a huge discount to competing large cap utilities such as Southern Company (<a href=\"https://seekingalpha.com/symbol/SO\" title=\"The Southern Company\">SO</a>), NextEra Energy (<a href=\"https://seekingalpha.com/symbol/NEE\" title=\"NextEra Energy, Inc.\">NEE</a>), WEC Energy Group (<a href=\"https://seekingalpha.com/symbol/WEC\" title=\"WEC Energy Group, Inc.\">WEC</a>), DTE Energy (<a href=\"https://seekingalpha.com/symbol/DTE\" title=\"DTE Energy Company\">DTE</a>) and Consolidated Edison (<a href=\"https://seekingalpha.com/symbol/ED\" title=\"Consolidated Edison, Inc.\">ED</a>).</p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <tr> <td><strong>Name</strong></td> <td><strong>PE Ratio</strong></td> <td><strong>Yield</strong></td> </tr> <tr> <td>Southern Co</td> <td>17.67</td> <td>4.15%</td> </tr> <tr> <td>NextEra Energy</td> <td>29.61</td> <td>2.04%</td> </tr> <tr> <td>WEC Energy</td> <td>21.90</td> <td>3.04%</td> </tr> <tr> <td>DTE Energy</td> <td>19.62</td> <td>3.09%</td> </tr> <tr> <td>Consolidated Edison</td> <td>19.73</td> <td>3.38%</td> </tr> <tr> <td><strong>Peer Average</strong></td> <td><strong>21.70</strong></td> <td><strong>3.14%</strong></td> </tr> <tr> <td>Dominion Energy</td> <td>14.68</td> <td>4.45%</td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p class=\"paywall-full-content invisible\">Source: Author created</p> <p class=\"paywall-full-content invisible\">This significant discount seems to imply a large earnings cut or change to the previously stated 6.5% long-term EPS growth rate on the horizon. While the results of the business review are not yet complete, clearly Dominion is trading in the discount bin at present.</p> <h2 class=\"paywall-full-content invisible\">Bottom Line</h2> <p class=\"paywall-full-content invisible\">Dominion Energy, in my opinion, may be posturing a bit here to get the attention of regulators in the state of Virginia after the showdown regarding the nearly $10 billion wind farm project. The business review, to be conducted over the next few quarters, appears to be centered on the company's non-regulated assets and appears likely to result in the sale of the Cove Point 50% interest that the company now holds.</p> <p class=\"paywall-full-content invisible\">Virginia, for all of its faults, has a long history of being a constructive partner to Dominion and the demographics of the state are set to continue its rate base growth for many years to come.</p> <p class=\"paywall-full-content invisible\">The company is clearly having growing pains in the transition to a predominantly renewable portfolio and this is to be expected, however, even if Dominion's long-term growth projections are modestly reduced as a result of this business review and focus on regulated assets, the current 33% discount to its peer average appears to be rather dramatically overdone.</p> <p class=\"paywall-full-content invisible\">The current entry point, under $60, I believe offers a compelling opportunity for long-term investors and I have begun to increase my rather small initial position in the name.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">I look forward to your comments below. Thank you for reading and good luck to all!</p> <div id=\"highlighter--hover-tools\" style=\"display: none;\" class=\"paywall-full-content invisible\"><div id=\"highlighter--hover-tools--container\"> <div class=\"highlighter--icon highlighter--icon-copy\" title=\"Copy\"> </div> <div class=\"highlighter--icon highlighter--icon-change-color\" title=\"Change Color\"> </div> <div class=\"highlighter--icon highlighter--icon-delete\" title=\"Delete\"> </div> </div></div>", "twitContent": "$D - Dominion Energy: It May Be Woke, But It Won't Go Broke. https://seekingalpha.com/article/4559364-dominion-energy-stock-attractive-price-long-term-investors?source=tweet ", "innerMarketing": "<div id=\"highlighter--hover-tools\" style=\"display: none;\"><div id=\"highlighter--hover-tools--container\"><div class=\"highlighter--icon highlighter--icon-copy\" title=\"Copy\"> </div>         <div class=\"highlighter--icon highlighter--icon-change-color\" title=\"Change Color\"> </div>         <div class=\"highlighter--icon highlighter--icon-delete\" title=\"Delete\"> </div></div></div>", "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104051", "type": "author"}}, "sentiments": {"data": [{"id": "421435", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "16241", "type": "tag"}, {"id": "195", "type": "tag"}, {"id": "202", "type": "tag"}, {"id": "168", "type": "tag"}, {"id": "170", "type": "tag"}]}, "otherTags": {"data": [{"id": "578082", "type": "tag"}, {"id": "1302", "type": "tag"}, {"id": "115442", "type": "tag"}, {"id": "143011", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "114682", "type": "tag"}, {"id": "114692", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4559364-dominion-energy-stock-attractive-price-long-term-investors", "canonical": "https://seekingalpha.com/article/4559364-dominion-energy-stock-attractive-price-long-term-investors", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "104051", "type": "author", "attributes": {"company": null, "slug": "confounded-interest", "userId": 20926831, "tagId": 578082, "bio": "<p>I work in the financial and property management industry for a well known, publicly traded \"mini Berkshire\" Insurance company. I focus on portfolio structure, value, reasonably priced growth, tech and biotech spaces. I passed the series 6 and 7 exams at age 18 but do not at this time have active licenses.</p><p>My passion for investing and personal finance education began at a very early age. I opened my first brokerage account at the age of 12 and have invested through crashes, crises, recessions and bubbles. I have made many mistakes in both my personal and investing lives, however, each mistake I have made has taught me valuable lessons on my journey, both in life and towards financial independence. </p><p>As of March 2023, my total portfolio has compounded at 10.2% per year since 1993, beating the S&P 500's return of 9.87% over the same time period. </p><p>I do not currently hold active licenses and I am not a financial advisor and do not give out or publish investment advice. Articles I write are my opinion only and are not solicitations, please seek guidance from a licensed financial advisor before investing in any security. </p><p>Opinions expressed in my articles are my own and do not reflect or indicate any positions or opinions held of my primary employer. </p>", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/020/926/831/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/020/926/831/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/020/926/831/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/020/926/831/extra_large_pic.png"}, "nick": "Confoundedinterest", "deactivated": null, "memberSince": 2014, "isRss": false, "contributorSince": 2017, "followersCount": 7939}, "relationships": {"user": {"data": {"id": "20926831", "type": "user"}}, "userBioTags": {"data": [{"id": "936517", "type": "userBioTag"}, {"id": "936518", "type": "userBioTag"}, {"id": "936519", "type": "userBioTag"}, {"id": "936520", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/confounded-interest", "profileUrl": "/author/confounded-interest", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "55", "type": "sector"}}}, "links": {"self": "/symbol/D"}}, {"id": "16241", "type": "tag", "attributes": {"slug": "nee", "name": "NEE", "company": "NextEra Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/NEE"}}, {"id": "195", "type": "tag", "attributes": {"slug": "so", "name": "SO", "company": "The Southern Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/SO"}}, {"id": "202", "type": "tag", "attributes": {"slug": "wec", "name": "WEC", "company": "WEC Energy Group, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/WEC"}}, {"id": "168", "type": "tag", "attributes": {"slug": "dte", "name": "DTE", "company": "DTE Energy Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/DTE"}}, {"id": "170", "type": "tag", "attributes": {"slug": "ed", "name": "ED", "company": "Consolidated Edison, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/ED"}}, {"id": "578082", "type": "tag", "attributes": {"slug": "confounded-interest", "name": "Confounded Interest", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/confounded-interest"}}, {"id": "1302", "type": "tag", "attributes": {"slug": "editors-picks", "name": "Editors' Picks", "company": null, "tagKind": "Tags::SpecialType"}, "links": {"self": "/listing/editors-picks"}}, {"id": "115442", "type": "tag", "attributes": {"slug": "contrarian", "name": "Contrarian", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=contrarian"}}, {"id": "143011", "type": "tag", "attributes": {"slug": "temporary-headwinds", "name": "Temporary Headwinds", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=temporary-headwinds"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "114682", "type": "tag", "attributes": {"slug": "alpha-rich-investment-style", "name": "Alpha-Rich Investment Style", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/alpha-rich-investment-style"}}, {"id": "114692", "type": "tag", "attributes": {"slug": "alpha-rich-opportunity", "name": "Alpha-Rich Opportunity", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/alpha-rich-opportunity"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "421435", "type": "sentiment", "attributes": {"articleId": 4559364, "type": "bullish", "createdAt": "2022-11-20T22:23:04.000-05:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4559364", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}