{"data": {"id": "4315303", "type": "fullArticle", "attributes": {"publishOn": "2020-01-05T19:35:35-05:00", "isLockedPro": false, "commentCount": 43, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"william-stamm": {"id": 496846, "slug": "william-stamm", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "ba": {"id": 769, "slug": "ba", "kind": "common", "non_theme": true}, "dhr": {"id": 1213, "slug": "dhr", "kind": "common", "non_theme": true}, "eos": {"id": 490, "slug": "eos", "kind": "common", "non_theme": true}, "hd": {"id": 799, "slug": "hd", "kind": "common", "non_theme": true}, "jnj": {"id": 1135, "slug": "jnj", "kind": "common", "non_theme": true}, "ohi": {"id": 5949, "slug": "ohi", "kind": "common", "non_theme": true}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "utilities": {"id": 55, "slug": "utilities", "kind": "sector", "path": "/stock-ideas/utilities", "title": "Utilities ", "non_theme": true, "sasource": "theme_breadcrumb"}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "electric-utilities": {"id": 18029, "slug": "electric-utilities", "kind": "common", "non_theme": true}}, "title": "Buy Dominion Energy, A Dividend Growth Utility Business For Income", "summary": ["Dominion Energy’s dividends are above average at 4.5% and have been increased for 17 years in a row as a dividend growth investment.", "Dominion Energy’s three-year forward CAGR of 5% is fair and will give you growth with the increasingly growing United States economy and population.", "Dominion Energy’s 48 month total return is poor, but the steady growing income stream makes up for the weak total return, and the stock price is now on an upslope."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2020-01-06T04:14:10-05:00", "isModerated": false, "closestTradingDate": "2020-01-06", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 25, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long BA, JNJ, HD, EOS, SLP, DHR, LMT, IR, MO, DIS.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />Of course, this is not a recommendation to buy or sell, and you should always do your own research and talk to your financial advisor before any purchase or sale. This is how I manage my IRA retirement account, and the opinions of the companies are my own.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Dominion Energy (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>), one of the largest diversified utilities of electricity and gas, is a buy for the conservative dividend growth investor. Dominion Energy has recent steady growth and has cash, which it uses to buy bolt-on companies and increase the dividend each year. Even with an earnings beat in the last quarter, Mr. Market was neutral. I think this is an opportunity to buy a great defensive company if you do not have a position in the company. Dominion Energy is being considered for incorporation in The Good Business Portfolio, my IRA portfolio of good business companies that are balanced in all styles of investments.</p> <p><img src=\"https://static.seekingalpha.com/uploads/2020/1/40294_15780864266173_rId6.jpg\" data-width=\"293\" data-height=\"136\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></p> <p>Dominion Energy is being reviewed using The Good Business Portfolio guidelines. I use a set of guidelines that I codified over the last few years used to evaluate the companies in The Good Business Portfolio (my portfolio) and other companies that I am reviewing. For a complete set of guidelines, please see my article \"<a href=\"https://seekingalpha.com/article/4195418-good-business-portfolio-update-to-guidelines-august-2018\"> The Good Business Portfolio: Update to Guidelines, August 2018</a>\". These guidelines provide me with a balanced portfolio of income, defensive, total return, and growing companies that hopefully keeps me ahead of the Dow average.</p> <p>When I scanned the five-year chart, Dominion Energy has a poor volatile chart going up, and to the right for 2016 and 2017 until a big drop in early 2018, then it is up strongly from mid-2018 to date.</p> <p><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\" data-id=\"null\" data-name=\"null\"><img src=\"https://static.seekingalpha.com/uploads/2020/1/3/saupload_d718b7b907b572542d569f84bb591bc0.png\" class=\"sa-ycharts-img\" alt=\"Chart\" data-width=\"635\" data-height=\"366\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\">Data by YCharts</figure></p> <p>Dominion Energy is reviewed in the following topics below.</p> <ul> <li>Investment Fundamentals</li> <li>Company Business</li> <li>Conclusions</li> <li>Portfolio Management Highlights</li> </ul> <h2><strong>Investment Fundamentals</strong></h2> <p>The Good Business Portfolio Guidelines are just a screen to start with and not absolute rules. When I look at a company, the total return is a crucial parameter to see if it fits the objective of the Good Business Portfolio. My total return guideline is<span class=\"paywall-full-content invisible\"> that total return must be higher than the Dow's total return over my test period. Dominion Energy misses against the Dow baseline in my 48-month test compared to the Dow average. I chose the 48 month test period (starting January 1, 2016, and ending to date) because it includes the great year of 2017 and 2019, and other years that had a decent and weak performance. The fair Dominion Energy total return of 43.7% compared to the Dow base of 64.02% makes Dominion Energy a fair investment for the total return investor that also wants a steadily increasing income. Looking back five years, $10,000 invested five years ago would now be worth over $13,400 today. This makes Dominion Energy a fair investment for the total return investor looking back, which has future growth as the United States demand for more of Dominion Energy’s electric and gas.</span></p> <p class=\"paywall-full-content invisible\">Dow's 48 Month total return baseline is 64.02%</p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table><tr><td><span class=\"table-responsive\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <tr> <td><p>Company name</p></td> <td><p>47 Month total return</p></td> <td><p>The difference from Dow baseline</p></td> <td><p>Yearly dividend percentage</p></td> </tr> <tr> <td><p>Dominion Energy</p></td> <td><p>43.7%</p></td> <td><p>-20.32%</p></td> <td><p>4.5%</p></td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span></td></tr></table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p class=\"paywall-full-content invisible\">Dominion Energy does meet my dividend guideline of having dividends increase for 8 of the last ten years and having a yield of at least 1%, passing this guideline with dividend increases for 17 years. The recent earnings payout ratio is high, at 86%. After paying the dividend, this leaves cash remaining for investment in expanding the business. The dividend income is high, and the future growth of 5% is very safe and lets you sleep at night.</p> <p class=\"paywall-full-content invisible\">I also require the CAGR going forward to be able to cover my yearly expenses and my RMD with a CAGR of 7%. My dividends provide 3.3% of the portfolio as income, and I need 1.9% more for a yearly distribution of 5.2% plus an inflation cushion of 1.8%. The three-year S&amp;P CFRA CAGR of 5% is below my requirement, failing my guideline requirement. The fair future growth for Dominion Energy can continue its uptrend benefiting from the continued strong growth of the United States economy. I believe that the growth is closer to my requirement, and I will add Dominion Energy to my portfolio if cash is ever available.</p> <p class=\"paywall-full-content invisible\">I have a capitalization guideline where the capitalization must be greater than $8 billion. Dominion Energy passes this guideline. Dominion Energy is a large-cap company with a capitalization of $68 billion well above the guideline target. Dominion Energy 2019 projected cash flow at $3.1 billion is good, allowing the company to have the means for company growth and increased dividends.</p> <p class=\"paywall-full-content invisible\">One of my guidelines is that the S&amp;P rating must be three stars or better. Dominion Energy's S&amp;P CFRA rating is four stars or buy with a one-year target price of $86, passing the guideline. Dominion Energy is below the target price at present by 6% and has a moderate PE of 19, making Dominion Energy a buy at this entry point if you consider the solid growing dividend.</p> <p class=\"paywall-full-content invisible\">One of my guidelines is would I buy the whole company if I could. The answer is yes. The total return is fair, and the above-average growing dividend yield makes Dominion Energy a great business to own for growing income and future growth. The Good Business Portfolio likes to embrace all kinds of investment styles but concentrates on buying companies that can be understood, makes a fair profit, invests profits back into the business, and also generates a good income stream. Most of all, what makes Dominion Energy interesting is the reasonable future growth rate of its business. Dominion Energy is aggressive in building up its renewable assets and is getting ahead of the curve to the future of energy supply.</p> <p class=\"paywall-full-content invisible\">I don’t have a guideline for earnings, but look for the earnings of my positions too consistently beat their quarterly estimates. Click to enlarge</p> <p class=\"paywall-full-content invisible\">For the last quarter on November 1, 2019, Dominion Energy reported earnings that beat expected by $0.04 at $1.18, compared to the previous year at $1.30. Total revenue was higher at $4.27 billion more than a year ago by 23.7% year over year and missed by $242 million from the expected total. This was a good report with bottom-line beating expected and the top line increasing with an increase compared to last year. The next earnings report will be out February 2020 and is expected to be $1.15 compared to the previous year at $0.89, a nice increase. The graphic below shows the guidance for 2019.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/1/40294_15780864266173_rId8.jpg\" rel=\"lightbox\" data-width=\"1280\" data-height=\"960\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/1/40294_15780864266173_rId8_thumb.jpg\" data-width=\"640\" data-height=\"480\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Source:<a href=\"https://seekingalpha.com/article/4302270-dominion-energy-inc-2019-q3-results-earnings-call-presentation\"> Dominion Energy earnings call</a></p> <h2 class=\"paywall-full-content invisible\"><strong>Company Business</strong></h2> <p class=\"paywall-full-content invisible\">Dominion Energy is one of the largest energy suppliers in the United States.</p> <p class=\"paywall-full-content invisible\">As per para-phase from<a href=\"https://www.reuters.com/finance/stocks/overview?symbol=D.N\" rel=\"nofollow\"> Reuters</a>: Dominion Energy is a producer and transporter of energy. Dominion is focused on its investment in regulated electric generation, transmission and distribution, and regulated natural gas transmission and distribution infrastructure. It operates through three segments: Dominion Virginia Power operating segment (<a href=\"https://seekingalpha.com/symbol/DEEP\">DVP</a>), Dominion Generation, Dominion Energy, and Corporate. The DVP segment includes regulated electric distribution and regulated electric transmission. The Dominion Generation segment includes regulated electric fleet and merchant electric fleet. The Dominion Energy segment includes gas transmission and storage, gas gathering and processing, liquefied natural gas import and storage, and nonregulated retail energy marketing.</p> <p class=\"paywall-full-content invisible\">Overall, Dominion Energy is a good business with a 5% CAGR projected growth as the United States economy grows going forward with the increasing demand for Energy. The good earnings and revenue growth provides Dominion Energy the capability to continue its growth as the business increases by buying bolt-on companies and expanding renewable assets.</p> <p class=\"paywall-full-content invisible\">From the para-phase of the<a href=\"https://seekingalpha.com/article/4301568-dominion-energy-inc-d-ceo-thomas-farrell-on-q3-2019-results-earnings-call-transcript\"> earnings call</a>.</p> <p class=\"paywall-full-content invisible\">Dominion has reduced carbon dioxide emissions by 52% since 2005. They also prevented more than 250,000 metric tons of methane entering the atmosphere from our gas infrastructure assets in the past decade, which is the equivalent of planting more than 100 million trees. The company has raised its diverse hiring rate from 27% to 42% from 2013 to 2018, and one in every five new hires is a veteran. In 2018, Dominion contributed nearly $35 million social betterment, and employees volunteered more than 126,000 hours in community service. In August, they announced plans for the largest electric school bus initiative in the nation. This innovative effort aims to replace 100% of the approximately 13,000 diesel-powered school buses in our Virginia Electric Utility Service territory by 2030, which will be the equivalent in emission reductions of removing 65,000 cars from the road. The vehicle to grid technology allows the bus batteries to store and then release energy out of the grid during periods of high demand when the buses are not in use. Finally, last week, we announced that we are expanding our 50:50 partnership with Smithfield Foods become the largest renewable natural gas supplier in the nation. In total, they are doubling the combined investment over the next 10 years to $0.5 billion, which will allow us to capture RNG that reduces greenhouse gas emissions that are equivalent to taking 500,000 cars off the road or planting 40 million new trees. They are one of the most sustainable and innovative energy companies in the United States, and they believe that their customers and shareholders will benefit from the efforts. Offshore Wind, last month, they received key approvals from the Bureau of Ocean Energy Management BOEM regarding the design, fabrication, and installation of our 12-megawatt pilot project, which is under construction and scheduled to enter service late next year. They intend to develop 2.6 gigawatts of utility-scale offshore wind in support of Governor Northam’s recent Executive Order Number 43. That order provided clear direction to policymakers and agencies regarding the State's sustainable energy future as well as a challenge to Dominion Energy to accelerate the life lock timeline with more renewables on our system. Dominion intends to bring the project, which is located 27 miles off the coast of Virginia Beach online in three phases of 880 megawatts each. The three phases will enter service in 2024, 2025, and 2026 and taken together will be the largest offshore wind installation in the United States.</p> <p class=\"paywall-full-content invisible\">This shows the feelings of top management for the continued growth of the Dominion Energy business and shareholder return with an increase in future growth. Dominion Energy has good constant growth and will continue as the United States economy grows. Dominion Energy is adding to the renewables in its supply chain to keep up with the clean energy mantra.</p> <p class=\"paywall-full-content invisible\">The graphic below shows some of the diversified areas where the company sells or has an agreement to sell electricity and gas.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/1/40294_15780864266173_rId12.jpg\" rel=\"lightbox\" data-width=\"1280\" data-height=\"960\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/1/40294_15780864266173_rId12_thumb.jpg\" data-width=\"640\" data-height=\"480\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Source: Dominion Energy earnings call</p> <h2 class=\"paywall-full-content invisible\"><strong>Conclusions</strong></h2> <p class=\"paywall-full-content invisible\">Dominion Energy is a good investment choice for the dividend growth investor with its above-average dividend yield and a poor choice for the total return investor. Dominion Energy is being considered for The Good Business Portfolio as an income investment. If you want a steady growing dividend income and fair total return, in the growing utility business, Dominion Energy may be the right investment for you.</p> <h2 class=\"paywall-full-content invisible\"><strong>Portfolio Management Highlights</strong></h2> <p class=\"paywall-full-content invisible\">The five companies comprising the largest percentage of the portfolio are Johnson &amp; Johnson (<a href=\"https://seekingalpha.com/symbol/JNJ\" title=\"Johnson &amp; Johnson\">JNJ</a>) at 8.1% of the portfolio, the Eaton Vance Enhanced Equity Income Fund II (<a href=\"https://seekingalpha.com/symbol/EOS\" title=\"Eaton Vance Enhanced Equity Income Fund II\">EOS</a>) at 7.9% of the portfolio, Home Depot (<a href=\"https://seekingalpha.com/symbol/HD\" title=\"The Home Depot, Inc.\">HD</a>) at 9.3% of the portfolio, Omega Health Investors (<a href=\"https://seekingalpha.com/symbol/OHI\" title=\"Omega Healthcare Investors, Inc.\">OHI</a>) at 9.2% of the portfolio, and Boeing (<a href=\"https://seekingalpha.com/symbol/BA\" title=\"The Boeing Company\">BA</a>) at 12.0% of the portfolio. Therefore, BA, EOS, JNJ, OHI, and HD are now in trim or close to trim position, but I am letting them run a bit since they are great companies.</p> <ul class=\"paywall-full-content invisible\"> <li>On December 5, I wrote covered calls against my Danaher (<a href=\"https://seekingalpha.com/symbol/DHR\" title=\"Danaher Corporation\">DHR</a>) position to collect another premium ($1.54/share December $150). I like DHR, but it’s getting a bit pricey, and the covered calls give me some extra income and some downside protection. On December 19, I closed the position by buying back the calls and made a small profit.</li> <li>On August 30, I trimmed HD to 10% of the portfolio. HD is a great business but needs more foreign expansion to grow even stronger.</li> <li>On August 30, I trimmed OHI to 9% of the portfolio. OHI is a great income business, but it has risks, so 9% is my limit on this company until the operator problems are totally under control.</li> </ul> <p class=\"paywall-full-content invisible\">Boeing is going to be pressed to 15% of the portfolio because of it being cash positive on 787 deferred plane costs at $1.3 billion in the third quarter of 2019, an increase from the second quarter. Boeing has dropped in the last nine months because of the second 737 Max crash, and I look at this as an opportunity to buy BA at a reasonable price. From the latest news from Boeing, Boeing now expects the 737 Max to fly by January 2020. The software data and training materials have been submitted to the FAA.</p> <p class=\"paywall-full-content invisible\">JNJ will be pressed to 9% of the portfolio because of its defensive nature in this post-BREXIT world. Earnings in the last quarter beat on the top and bottom line, and Mr. Market did nothing. JNJ in April 2019 increased the dividend to $0.95/Qtr., which is 57 years in a row of increases. JNJ is not a trading stock but a hold forever; it is now a strong buy as the healthcare sector remains under pressure.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">The total return for the Good Business Portfolio is ahead of the Dow average from 1/1/2019 to date by 1.9%, which is a nice gain above the market for the portfolio with BA a strong drag. Each quarter after the earnings season, I write an article giving a complete portfolio list and performance, the latest article is titled “<a href=\"https://seekingalpha.com/article/4308683-good-business-portfolio-2019-3rd-quarter-earnings-and-performance-review\"> The Good Business Portfolio: 2019 3 <sup>rd</sup> Quarter Earnings and Performance Review</a>”. Become a real-time follower, and you will get each quarter's performance after the next earnings season is over<strong>.</strong></p>", "twitContent": "$D - Buy Dominion Energy, A Dividend Growth Utility Business For Income. https://seekingalpha.com/article/4315303-buy-dominion-energy-dividend-growth-utility-business-for-income?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "85096", "type": "author"}}, "sentiments": {"data": [{"id": "252107", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "769", "type": "tag"}, {"id": "1213", "type": "tag"}, {"id": "490", "type": "tag"}, {"id": "799", "type": "tag"}, {"id": "1135", "type": "tag"}, {"id": "5949", "type": "tag"}]}, "otherTags": {"data": [{"id": "496846", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "18027", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "18029", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4315303-buy-dominion-energy-dividend-growth-utility-business-for-income", "canonical": "https://seekingalpha.com/article/4315303-buy-dominion-energy-dividend-growth-utility-business-for-income", "uriImage": "https://static.seekingalpha.com/uploads/2020/1/40294_15780864266173_rId6.jpg", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2020/1/40294_15780864266173_rId6.jpg"}}}, "included": [{"id": "85096", "type": "author", "attributes": {"company": null, "slug": "william-stamm", "userId": 40294, "tagId": 496846, "bio": "<p>BSEE The Cooper Union, school of engineering 1966. Engineering manager Harris corp. 23 years Software development, Grumman Corp 10 years as project manager.</p><p>28years managing my own IRA accounts, in retirement now with a CAGR of 10.78%</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/000/040/294/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/000/040/294/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/000/040/294/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/000/040/294/extra_large_pic.png"}, "nick": "William Stamm", "deactivated": null, "memberSince": 2007, "isRss": false, "contributorSince": 2015, "followersCount": 11147}, "relationships": {"user": {"data": {"id": "40294", "type": "user"}}, "userBioTags": {"data": [{"id": "1027488", "type": "userBioTag"}, {"id": "1027489", "type": "userBioTag"}, {"id": "1027490", "type": "userBioTag"}, {"id": "1027491", "type": "userBioTag"}, {"id": "1027492", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/william-stamm", "profileUrl": "/author/william-stamm", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "55", "type": "sector"}}}, "links": {"self": "/symbol/D"}}, {"id": "769", "type": "tag", "attributes": {"slug": "ba", "name": "BA", "company": "The Boeing Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/BA"}}, {"id": "1213", "type": "tag", "attributes": {"slug": "dhr", "name": "DHR", "company": "Danaher Corporation", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/DHR"}}, {"id": "490", "type": "tag", "attributes": {"slug": "eos", "name": "EOS", "company": "Eaton Vance Enhanced Equity Income Fund II", "tagKind": "Tags::Ticker", "equityType": "cef", "exchange": "NYSE", "fundTypeId": 3, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/EOS"}}, {"id": "799", "type": "tag", "attributes": {"slug": "hd", "name": "HD", "company": "The Home Depot, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/HD"}}, {"id": "1135", "type": "tag", "attributes": {"slug": "jnj", "name": "JNJ", "company": "Johnson & Johnson", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/JNJ"}}, {"id": "5949", "type": "tag", "attributes": {"slug": "ohi", "name": "OHI", "company": "Omega Healthcare Investors, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": true, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/OHI"}}, {"id": "496846", "type": "tag", "attributes": {"slug": "william-stamm", "name": "William Stamm", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/william-stamm"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "18027", "type": "tag", "attributes": {"slug": "utilities", "name": "Utilities", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/utilities"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "18029", "type": "tag", "attributes": {"slug": "electric-utilities", "name": "Electric Utilities", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/electric-utilities"}}, {"id": "252107", "type": "sentiment", "attributes": {"articleId": 4315303, "type": "bullish", "createdAt": "2020-01-05T19:35:35.000-05:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4315303", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}