{"data": {"id": "4357241", "type": "fullArticle", "attributes": {"publishOn": "2020-07-07T02:32:47-04:00", "isLockedPro": false, "commentCount": 45, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"daniel-jones": {"id": 163495, "slug": "daniel-jones", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "brk.a": {"id": 4721, "slug": "brk.a", "kind": "common", "non_theme": true}, "brk.b": {"id": 6699, "slug": "brk.b", "kind": "common", "non_theme": true}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "financials": {"id": 40, "slug": "financials", "kind": "sector", "path": "/stock-ideas/financial", "title": "Financials ", "sasource": "theme_breadcrumb"}}, "title": "Warren Buffett's Berkshire Hathaway Makes A Big Play For Dominion Energy's Assets", "summary": ["Warren Buffett's Berkshire Hathaway made a play for significant assets owned by Dominion Energy.\n        ", "This move will create winners of Berkshire and Dominion, especially the former.\n        ", "Shareholders in Dominion will see some pain, but it's worth it for Dominion as a whole.\n        "], "structuredInsights": null, "isPaywalled": false, "lastModified": "2020-07-07T02:32:47-04:00", "isModerated": false, "closestTradingDate": "2020-07-07", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 32, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>One big question for watchers and investors of <strong>Berkshire Hathaway </strong>(<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BRK.A\" title=\"Berkshire Hathaway Inc.\">BRK.A</a></span>) (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BRK.B\" title=\"Berkshire Hathaway Inc.\">BRK.B</a></span>) in recent years has been what will happen to the company’s large cash reserves. In all, as of the end of its latest quarter, the conglomerate run by Warren Buffett had <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1067983/000156459020020599/brka-10q_20200331.htm\" rel=\"nofollow noopener\">cash and cash equivalents</a> worth $137.26 billion on hand. This follows years of cash balances rising at the business. Speculation arose in recent months that Buffett may use the recent downturn in the market to make a big purchase, but that failed to occur. But, as the saying goes, it’s sometimes better late than never.</p> <p>On July 5<sup>th</sup>, <a href=\"https://news.dominionenergy.com/2020-07-05-Dominion-Energy-Agrees-to-Sell-Gas-Transmission-Storage-Assets-to-Berkshire-Hathaway-Energy-Strategic-Repositioning-Toward-Pure-Play-State-Regulated-Sustainability-Focused-Utility-Operations\" rel=\"nofollow noopener\">news broke</a> that the company would be acquiring substantially all of the Gas Transmission and Storage assets from utility giant <strong>Dominion Energy </strong>(<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>) in a deal valued at $9.7 billion in all. Though this uses up only a small piece of the cash on Berkshire’s books, because the move is more about the absorption of debt than it is spending cash, it’s a nice add-on acquisition for Berkshire and a fine way for Dominion to continue restructuring its business. In all, this maneuver looks like a win for both parties, but the ones likely least excited about the transaction in all will be Dominion’s own shareholders because of the implications it will have on the firm’s cash payouts to them.</p> <h2>A look at the deal</h2> <p>The transaction between Berkshire and Dominion is quite simple at face value. According to a press release issued about the deal, Berkshire will pay to Dominion the sum of about $4 billion in cash. In addition, it will assume $5.7 billion worth of debt from the company. In exchange, Dominion will hand over nearly all of the assets associated with its Gas Transmission and Storage operations. The only assets under these operations that will be retained are Dominion’s 50% non-operating and unlevered interests in<span class=\"paywall-full-content invisible\"> Cove Point, as well as its investments in RNG (Renewable Natural Gas).</span></p> <p class=\"paywall-full-content invisible\">The reduction in leverage seen from this transaction is easy to see, but what about the cash? According to Dominion, it will allocate about $1 billion of the cash between transaction taxes and adjustments. This also includes $250 million that will go toward funding the firm’s pension plan as a voluntary contribution. The remaining $3 billion, meanwhile, will be allocated toward share buybacks, likely occurring in late 2020 when the deal closes or occurring sometime in early 2021.</p> <p class=\"paywall-full-content invisible\">For Berkshire, the benefits here are obvious. The subsidiary of the firm that is acquiring these assets is <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1067983/000156459020005874/brka-10k_20191231.htm\" rel=\"nofollow noopener\">Berkshire Hathaway Energy Group</a>, of which Berkshire owns 90.9%. Domestically, this subsidiary controls four regulated utility companies that collectively serve 5.1 million retail customers, 2 interstate natural gas pipelines with a combined 16,300 miles to their name, design capacity for 8.5 billion cubic feet of natural gas per day, as well as ownership in electricity transmission and other assets as well. Though not relevant to this deal, the segment also owns assets in Great Britain that serve about 3.9 million customers, as well as assets in Canada that serve 85% of the population of Alberta.</p> <p class=\"paywall-full-content invisible\">For years, this unit of Berkshire has exhibited nice growth and strong earnings. Between 2017 and 2019, revenue at the segment grew from $18.85 billion to $20.11 billion. Net operating income over that period surged 35.3% from $2.31 billion to $3.13 billion, while the amount of that that’s attributable to Berkshire’s shareholders grew from $2.03 billion to $2.84 billion. This growth has been made possible through significant reinvestment into the businesses. Over this three-year window, total capital expenditures for this segment came out to $18.18 billion, so it probably shouldn’t be much of a surprise that Berkshire would make such a large move like it decided to with Dominion’s assets.</p> <p class=\"paywall-full-content invisible\">For Dominion, the picture is a little more complex. It’s not just about the numbers for the business. It’s also about long-term strategy. In recent years, Dominion has undergone a flurry of M&amp;A activity to become more focused on regulated utilities for its earnings. In 2019, for instance, about 70% of its operating earnings came from state-regulated utility operations. This deal will move that figure up to between 85% and 90%, putting the business well on its way to being a 100% pure-play in this space in the not-too-distant future. Of this 85% to 90% figure, between 55% and 60% will come from its Dominion Energy Virginia business (which includes operations in North Carolina). This involves electricity distribution, transmission, and generation. The rest, as the <a href=\"https://s2.q4cdn.com/510812146/files/doc_presentations/2020/06/2020-07-05-DE-IR-investor-update-presentation-vTC.pdf\" rel=\"nofollow noopener\">image</a> below illustrates, comes from miscellaneous operations spread across several states.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/6/9866571-15940227501987202_origin.png\" rel=\"lightbox\" data-width=\"2524\" data-height=\"1094\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/6/9866571-15940227501987202.png\" width=\"640\" height=\"277\" data-width=\"640\" data-height=\"277\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></span>*Taken from Dominion Energy</p> <p class=\"paywall-full-content invisible\">By divesting of these assets, Dominion will be saying goodbye to valuable earnings, but it will attain significant progress in terms of its goal of becoming carbon and methane neutral by 2050. Back in 2005, the company was only 35% of its way to being carbon and methane emissions neutral. This sale will significant accelerate that, placing the company on track to reach the 70% way of the target by 2035. It should be mentioned, though, that selling off these assets alone won’t get it there. The company also plans to invest around $55 billion toward growth capex between 2020 and 2035 that will be more environmentally-friendly than carbon-based options today. Examples include wind, solar, battery, and even nuclear re-licensing.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/6/9866571-15940227753396955_origin.png\" rel=\"lightbox\" data-width=\"2512\" data-height=\"1102\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/6/9866571-15940227753396955.png\" width=\"640\" height=\"281\" data-width=\"640\" data-height=\"281\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">*Taken from Dominion Energy</p> <h2 class=\"paywall-full-content invisible\">Where some pain exists</h2> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/6/9866571-15940229103161318_origin.png\" rel=\"lightbox\" data-width=\"2488\" data-height=\"1082\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/6/9866571-15940229103161318.png\" width=\"640\" height=\"278\" data-width=\"640\" data-height=\"278\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span>*Taken from Dominion Energy</p> <p class=\"paywall-full-content invisible\">It would be wrong to state that this move by Dominion won’t leave some shareholders a little unhappy. This is because the sale will result in the company’s operating earnings falling quite a bit. Instead of the $4.25 to $4.60 (with a $4.43 mid-point) in operating earnings the company was guiding for 2020, it will now earn between $3.37 and $3.63, for a mid-point of $3.50. This difference won’t disappear for the current year because of the timing of the sale’s completion, but it will move the difference into discontinued operations and will impact the firm in years to come.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/6/9866571-15940228333315346_origin.png\" rel=\"lightbox\" data-width=\"2532\" data-height=\"1226\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/6/9866571-15940228333315346.png\" width=\"640\" height=\"310\" data-width=\"640\" data-height=\"310\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span>*Taken from Dominion Energy</p> <p class=\"paywall-full-content invisible\">Next year, due to continued investments in its business and the impact caused by share repurchases, Dominion expects earnings to grow between 10% and 11% to between $3.85 and $3.90, with annual growth thereafter averaging about 6.5% for the foreseeable future. Naturally, a change in earnings expectations also has led to management revising its distribution. In the third quarter this year, Dominion intends to pay out the $0.94 per unit it has paid out in the first and second quarters. In the fourth quarter, this will decrease to $0.63, bringing the firm’s payout for the year to $3.45 per share. This is down from the $3.76 per share previously anticipated. The real pain, though, will be in 2020, because that year the company expects to pay out only $2.50 per unit. Perhaps the only good thing about this is that subsequent distributions in 2021 and beyond are expected to grow 6% per year compared to the 2.5% annual target management anticipated in the past.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/6/9866571-15940228523752887_origin.png\" rel=\"lightbox\" data-width=\"2526\" data-height=\"1036\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/6/9866571-15940228523752887.png\" width=\"640\" height=\"262\" data-width=\"640\" data-height=\"262\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span>*Taken from Dominion Energy</p> <p class=\"paywall-full-content invisible\">Dividend-lovers will hate this change, but as a dividend-hater myself, I love it. Part of the move is due to the need to cut because of lower future earnings, but the other part is a return to the norm compared to its peers. According to management, the average player in the space pays out about 63% of its earnings toward dividends. Dominion’s payout, under its status quo scenario, is 85%. This move will lower the payout to 65%.</p> <p class=\"paywall-full-content invisible\">Figuring out the exact number and the exact impact on the business from a cash flow perspective is difficult because of the uncertainty of what price the business will pay for the shares it’s buying back. At the current price per unit of $82.69, $3 billion will buy back about 36.28 million units. Running the math, this change in distribution will save the company $888 million in cash outlays annually. This figure is closer to $797 million in a world where the company would have lowered the payout without buying back stock. This is based on the projected future payout versus management’s guidance for its 2020 payout. Using its annualized 2020 payout before the deal, this would have been $1.15 billion and $1.06 billion, respectively. This is all, however, without taking into effect the decrease in cash flow the firm will see from its divestiture. Either way, these savings will go a long way toward funding its planned capex for the years to come.</p> <p class=\"paywall-full-content invisible\">As a side note, but unrelated to the current deal, Dominion also <a href=\"https://news.dominionenergy.com/2020-07-05-Dominion-Energy-and-Duke-Energy-Cancel-the-Atlantic-Coast-Pipeline\" rel=\"nofollow noopener\">announced</a> on July 5<sup>th</sup> that it and <strong>Duke Energy </strong>(<a href=\"https://seekingalpha.com/symbol/DUK\" title=\"Duke Energy Corporation\">DUK</a>) were canceling plans to build the Atlantic Coast Pipeline. Delays so far looked to have been at least three-and-a-half years and that was cited as a cause. Perhaps a bigger issue, though, was cost. Initially, the pipeline was forecasted to cost between $4.5 billion and $5 billion. That figure has now been revised up to $8 billion. Though this is unfortunate in terms of discussing growth prospects, it will allow the firm to repurpose its share of the costs toward other projects.</p> <h2 class=\"paywall-full-content invisible\">Takeaway</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">On the whole, the transaction between Berkshire and Dominion looks like a pretty good win for both sides. If I had to pick a winner, I would say that Berkshire will walk away with the better outcome, but the impact this will have on Dominion and its long-term strategy should not be understated. Shareholders in Dominion, meanwhile, will probably not be terribly happy by this development. The cut in the distribution next year is painful for yield-oriented investors, but for those more interested in growth, this should be seen as a positive move.</p>", "twitContent": "$BRK.A $BRK.B $D - Warren Buffett's Berkshire Hathaway Makes A Big Play For Dominion Energy's Assets. https://seekingalpha.com/article/4357241-warren-buffetts-berkshire-hathaway-makes-big-play-for-dominion-energys-assets?source=tweet ", "innerMarketing": "<p><a href=\"https://seekingalpha.com/checkout?slug=daniel-jones&service_id=mp_1209\">Crude Value Insights</a> offers you an investing service and community focused on oil and natural gas. We focus on cash flow and the companies that generate it, leading to value and growth prospects with real potential.</p><p>Subscribers get to use a 50+ stock model account, in-depth cash flow analyses of E&amp;P firms, and live chat discussion of the sector.</p><p><strong>Sign up today for your <a href=\"https://seekingalpha.com/checkout?slug=daniel-jones&service_id=mp_1209\">two-week free tria</a>l and get a new lease on oil &amp; gas!</strong></p>", "marketingBullet": "Looking for a helping hand in the market? Members of Crude Value Insights get exclusive ideas and guidance to navigate any climate.  <a href='/checkout?service_id=mp_1209' sasource='mp_marketing_text_top'>Get started today »</a>", "isReit": false, "videoData": null, "marketingBulletVariant": "My name is Dan Jones. I have degrees in accounting and economics, and ran a registered investment advisor for nine years. I lead the investing group <a href=\"/checkout?service_id=mp_1209&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A9866571%7Csection_asset%3Aauthor_bullets%3A-crude-value-insights\" data-test-id=\"author-custom-template-link\">Crude Value Insights</a>.", "marketingBio": "Dan Jones has degrees in accounting and economics, and ran a registered investment advisor for nine years.\n\nI runs investment group <a href=\"/checkout?service_id=mp_1209&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A9866571%7Csection_asset%3Aauthor_bullets%3A-crude-value-insights\" data-test-id=\"author-custom-template-link\">Crude Value Insights</a>, which offers unique actionable insights on O&G companies. It focuses on what matters most, cash flow. <a href=\"/checkout?service_id=mp_1209&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A9866571%7Csection_asset%3Aauthor_bullets%3A-crude-value-insights\" data-test-id=\"author-custom-template-link\">Learn more.</a>\n<a href=\"/checkout?service_id=mp_1209&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A9866571%7Csection_asset%3Aauthor_root%3A-crude-value-insights\" data-test-id=\"author-custom-template-link\">Crude Value Insights</a>.\nprovides a regular deep dive into 36 publicly traded oil and gas exploration and production companies. This slice of the market is volatile, but very rewarding when approached in the right way. It most certainly is not, however, for the faint of heart. <a href=\"/checkout?service_id=mp_1209&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A9866571%7Csection_asset%3Aauthor_root%3A-crude-value-insights\" data-test-id=\"author-custom-template-link\">Learn more >></a>\n\nAfter graduating from Case Western Reserve University in 2013, I ran my own RIA for approximately 9 years before moving to manage my own assets. I have accumulated extensive experience researching various industries ranging from industrials, to banking, to oil, and more. I found myself particularly interested in the dynamics of the oil industry early on, turning that into my specialization for Crude Value Insights.", "audioDuration": null}, "relationships": {"author": {"data": {"id": "69675", "type": "author"}}, "sentiments": {"data": [{"id": "282910", "type": "sentiment"}, {"id": "282911", "type": "sentiment"}, {"id": "282912", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4721", "type": "tag"}, {"id": "6699", "type": "tag"}, {"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "163495", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4357241-warren-buffetts-berkshire-hathaway-makes-big-play-for-dominion-energys-assets", "canonical": "https://seekingalpha.com/article/4357241-warren-buffetts-berkshire-hathaway-makes-big-play-for-dominion-energys-assets", "uriImage": "https://static.seekingalpha.com/uploads/2020/7/6/9866571-15940227501987202_origin.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2020/7/6/9866571-15940227501987202_origin.png"}}}, "included": [{"id": "1209", "type": "authorResearch", "attributes": {"createdAt": "2017-09-22T10:49:22-04:00", "title": "Crude Value Insights", "rating": "0.0", "reviewCount": 0, "shortPitch": "Robust cash flow analyses of oil and gas companies", "categories": ["Energy", "Value"], "serviceAssistantIds": [], "inAppPurchasesAllowedInIos": false, "inAppPurchasesAllowedInAndroid": false, "activeSubscriptionsCount": 5, "androidIapPlan": "none", "iosIapPlan": "none", "description": "Crude Value Insights is an exclusive community of investors who have a taste for oil and natural gas firms. Our main interest is on cash flow and the value and growth prospects that generate the strongest potential for investors. You get access to a 50+ stock model account, in-depth cash flow analyses of E&P firms.", "landingPageColor": null, "adUnits": ["direct_access", "active_chat", "exclusive_idea", "monthly_portfolio", "access_all", "vibrant_community"], "tempData": {}, "price": 50.0, "wildcardText": "", "slug": "crude-value-insights", "annualPriceWithDiscount": 400.0, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": true}, "relationships": {"author": {"data": {"id": "69675", "type": "author"}}}}, {"id": "69675", "type": "author", "attributes": {"company": null, "slug": "daniel-jones", "userId": 9866571, "tagId": 163495, "bio": "<p>Daniel is an avid and active professional investor. </p>\r\nHe runs <a href=\"https://seekingalpha.com/checkout?service_id=mp_1209\">Crude Value Insights</a>, a value-oriented newsletter aimed at analyzing the cash flows and assessing the value of companies in the oil and gas space. His primary focus is on finding businesses that are trading at a significant discount to their intrinsic value by employing a combination of Benjamin Graham's investment philosophy and a contrarian approach to the market and the securities therein. <a href=\"https://seekingalpha.com/checkout?service_id=mp_1209\">Learn more</a>.", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/009/866/571/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/009/866/571/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/009/866/571/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/009/866/571/extra_large_pic.png"}, "nick": "Daniel Jones", "deactivated": null, "memberSince": 2013, "isRss": false, "contributorSince": 2014, "followersCount": 32970}, "relationships": {"user": {"data": {"id": "9866571", "type": "user"}}, "userBioTags": {"data": [{"id": "321535", "type": "userBioTag"}, {"id": "321545", "type": "userBioTag"}, {"id": "321555", "type": "userBioTag"}, {"id": "321565", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1209", "type": "authorResearch"}}}, "links": {"self": "/author/daniel-jones", "profileUrl": "/author/daniel-jones", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4721", "type": "tag", "attributes": {"slug": "brk.a", "name": "BRK.A", "company": "Berkshire Hathaway Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "40", "type": "sector"}}}, "links": {"self": "/symbol/BRK.A"}}, {"id": "6699", "type": "tag", "attributes": {"slug": "brk.b", "name": "BRK.B", "company": "Berkshire Hathaway Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/BRK.B"}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/D"}}, {"id": "163495", "type": "tag", "attributes": {"slug": "daniel-jones", "name": "Daniel Jones", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/daniel-jones"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "282910", "type": "sentiment", "attributes": {"articleId": 4357241, "type": "bullish", "createdAt": "2020-07-07T02:32:47.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4357241", "type": "article"}}, "tag": {"data": {"id": "4721", "type": "tag"}}}}, {"id": "282911", "type": "sentiment", "attributes": {"articleId": 4357241, "type": "bullish", "createdAt": "2020-07-07T02:32:47.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4357241", "type": "article"}}, "tag": {"data": {"id": "6699", "type": "tag"}}}}, {"id": "282912", "type": "sentiment", "attributes": {"articleId": 4357241, "type": "bullish", "createdAt": "2020-07-07T02:32:47.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4357241", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}