{"data": {"id": "4357788", "type": "fullArticle", "attributes": {"publishOn": "2020-07-10T04:31:40-04:00", "isLockedPro": false, "commentCount": 86, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"george-fisher": {"id": 49521, "slug": "george-fisher", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "brk.b": {"id": 6699, "slug": "brk.b", "kind": "common", "non_theme": true}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "utilities": {"id": 55, "slug": "utilities", "kind": "sector", "path": "/stock-ideas/utilities", "title": "Utilities ", "non_theme": true, "sasource": "theme_breadcrumb"}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "electric-utilities": {"id": 18029, "slug": "electric-utilities", "kind": "common", "non_theme": true}}, "title": "I Reduced My Holdings Of Dominion Energy And Added To Berkshire Hathaway", "summary": ["The announced sale of natural gas assets reduces the overall diversity of Dominion Energy, which I view as a long-term negative from its previous business model.", "The purchase by Berkshire Hathaway is the catalyst I needed to begin adding again to this position.", "Dominion Energy still offers better regulatory support than many PUC-regulated utilities and is my major reason for rating it as Neutral and retention of the investment name."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2020-07-10T04:31:40-04:00", "isModerated": false, "closestTradingDate": "2020-07-10", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 40, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long BRK.B, D, EMRAF, SO.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>With the surprise announcement over the weekend of Dominion Energy (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>) disposal of its natural gas transmission and storage business to Berkshire Hathaway (<a href=\"https://seekingalpha.com/symbol/BRK.B\" title=\"Berkshire Hathaway Inc.\">BRK.B</a>), I sold a portion of my position in D and added to my holdings of BRK.B. The sale was partially as the result of a trailing stop loss being triggered, plus the open sale of additional shares at market prices. Dominion Energy was one of my top holdings with a 3x overweight position and bounced around in the top three in value, based on market movements. However, the sale of assets, coupled with a write-off of its Atlantic Coast Pipeline, altered its business profile for me. As the old saying goes, when facts change, it's time to review the justification for an investment.</p> <p><img src=\"https://static.seekingalpha.com/uploads/2020/7/9/4623221-15943227999640625.png\" width=\"624\" height=\"422\" data-width=\"640\" data-height=\"433\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></p> <p>(Source: <a href=\"https://seekingalpha.com/article/4128772-2-fast-growing-low-risk-retirement-dream-stocks\">Seeking Alpha</a>)</p> <p>In my personal portfolio construction quirkiness, I have several views I use to evaluate my holdings. The first is my three “buckets”: 1) cash, bonds, CDs, 2) equities bought primarily for capital gains, 3) equities bought primarily for income. This separation of assets allows me to analyze the overall initial reason for investing my personal capital. While there are some positions which offer a bit of both capital gains and above-average current income, most of each bucket’s positions were purchased with their respective overriding investment goal. Dominion Energy is in the income bucket and Berkshire Hathaway is in the capital gains bucket. In addition, my portfolio management style is to segregate positions by percentage of the total portfolio. With a “nibble in and nibble out” position approach, I target a “full” position as 1.0% to 1.5% with a maximum of 4.5%, and those under 1.0% percent considered positions I am building or exiting over time. Dominion Energy was one of my top three holdings and was at a 3x full position weighting. Berkshire Hathaway is in the full position category.</p> <p class=\"paywall-full-content invisible\">I built a position in Dominion Energy over the years. I have owned D for many years as one of the preferred southeast US utilities, mainly based on its favorable regulatory environment. I believed in the growing export of LNG but was looking for a “smaller” pure play, and chose Dominion Energy Midstream LP, whose main asset was the Cove Point LNG export terminal. Starting with its IPO in 2014, I built a nice position and added during its collapse to the low- to mid-teens in April and May 2018. Then came the buyback by the parent, which converted DM shares into D shares in January 2019. In addition, the South Carolina Gas and Electric fiasco offered a buying opportunity in SCG during the February to May 2018 time frame. SCG shares were also converted into D shares in January 2019. These three positions merged into an overweighted position at the beginning of 2019 and had been maintained until recently.</p> <p class=\"paywall-full-content invisible\">I have advocated for an investment in Dominion Energy due to several important attributes. These included:</p> <ul class=\"paywall-full-content invisible\"> <li>The company’s regulated utility footprint in geographic areas identified as having the best regulatory environment, as defined by Regulatory Research Associates, a division of S&amp;P Global Market Intelligence. More on this topic can be found in my SA article titled \"<a href=\"https://seekingalpha.com/article/4351967-utilities-regulatory-environment-covidminus-19-and-taxes-location-matters\">Utilities: Regulatory Environment, COVID-19, And Taxes - Location Matters</a>\". This is a critical aspect for all utility ownership, as these firms succeed largely based on their ability to earn an acceptable profit.</li> <li>Dominion offers diversity of regulated gas and electric service, and about an even split in the number of customers it services. With the potential for gas utilities to outperform electric utilities over the long term, offering investors exposure to both improves D’s investor profile.</li> <li>Cove Point LNG export facility offers additional diversity to a market that was growing, until it wasn’t. Approximately 90% of Cove Point’s production capacity is contacted under a long-term supply agreement. Utilizing 20-year contracts, Cove Point produces LNG for a joint venture of Sumitomo Corporation, one of the largest global energy trading firms, and GAIL (India) Ltd., the largest natural gas processing and distribution company in India. According to D's <a href=\"https://fossil.energy.gov/ng_regulation/sites/default/files/programs/gasregulation/authorizations/2011/applications/Update_of_DCP_Concerning_Signed_LNG_Expo.pdf\" rel=\"nofollow\">filing</a> with the DOE, these contracts are tolling agreements, whereby buyers pay a fee to D to liquefy any gas they purchase and are considered take-or-pay agreements. While these are 20-year contracts, the initial terms are set for a period to expire in 2024.</li> <li>Natural gas infrastructure of FERC-regulated interstate pipelines and storage facilities offered the advantages of long-term profitability with little added capital expenditures for maintenance, and were wrapped into the corporate structure without investors' K-1s.</li> <li>With the passage of the 2016 lower corporate tax rate, utilities regulated by state oversight needed to devise a method of returning the benefits of lower taxes to ratepayers. However, this was not the case for assets and businesses not under the jurisdiction of state PUCs, including Cove Point and various natural gas pipelines and storage facilities. Diversity of non-PUC regulated assets added to D's overall profitability due to lower federal income tax burdens.</li> </ul> <p class=\"paywall-full-content invisible\">Then came the surprise announcement on July 5 of the sale of its gas infrastructure, the dividend cut, the multi-billion write-off of its ACP investment, and the realignment of its business model from ~70% to ~90% state PUC-regulated utility. Add this to the previous sale of a 50% interest in Cove Point and D’s business model has changed.</p> <p class=\"paywall-full-content invisible\">In addition, I am not a big fan of share buybacks unless the shares are actually retired and not just recycled to satisfy exercised executive compensation options. If shares are not retired, my opinion is the use of shareholder cash flow to buy back shares is a mere ruse to reward management. According to <a href=\"https://ycharts.com/companies/D/stock_buyback\" rel=\"nofollow\">YCharts</a>, while Dominion reduced its share count from 698 million shares outstanding to 580 million outstanding from 2006 to 2009, since then the share count has increased to 842 million outstanding. While there was a large jump in share count in 2019 from the purchase of DM and SCG, from 2016 to the end of 2018, D spent almost $7 billion to buy back shares but the share count still went up from 596 million to 680 million outstanding. In my more cynical old age, unless I see an actual share count decline, I do not consider share buybacks as an advantage to current shareholders. So, paint me as very skeptical that the current plan to buy back $3 billion in shares with the proceeds from the divestiture will be a benefit to shareholders. In addition, Value Line expects the share count to continue to climb from the current 842 million to 880 million outstanding in the 2023-2025 time period, albeit prior to this most recent announcement. Countering this, Credit Suisse expects share count to decline to 800 million outstanding and to remain at this level until 2023.</p> <p class=\"paywall-full-content invisible\">Berkshire Hathaway has had a full position valuation in my portfolio for quite a while. I have been waiting for an event to give me a reason to add to my position. The purchase of Dominion’s natural gas infrastructure assets at an attractive price is a catalyst I needed to jump in with more capital. According to Credit Suisse, BRK.B paid 10.3x 2021 EBITDA, which is on the lower end of the pre-COVID-19 deal average of 12.0x for similar assets. As usual, BRK.B made a good long-term deal for its shareholders. This purchase will add to BRK.B’s growing utility and energy asset portfolio and will leapfrog the firm to a serious contender for one of the largest natural gas pipeline operators with an 18% market share. The balance of my Dominion sale proceeds will remain in my cash account, waiting for better overall equity valuations.</p> <p class=\"paywall-full-content invisible\">Personally, I rate Dominion Energy as Neutral, in line with the sell-side opinions as offered in the <a href=\"https://seekingalpha.com/symbol/D/ratings/sell-side-ratings\">SA graphic</a> below.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/9/4623221-15943227993346698_origin.png\" rel=\"lightbox\" data-width=\"1249\" data-height=\"572\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/9/4623221-15943227993346698.png\" width=\"625\" height=\"286\" data-width=\"640\" data-height=\"293\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">The lower dividend does not offer much advantage to shareholders compared to its peers. At the projected $2.50 dividend, the current price equates to a ~3.4% yield, in line with other electric and multi-line utilities but below selected utilities identified in favorable regulatory states, such as Southern Company (<a href=\"https://seekingalpha.com/symbol/SO\" title=\"The Southern Company\">SO</a>) and Emera (<a href=\"https://seekingalpha.com/symbol/EMRAF\" title=\"Emera Incorporated\">OTCPK:EMRAF</a>). Even at the projected 6% annual dividend increase, it will take 7 years to regain the dollar dividend of pre-announcement.</p> <p class=\"paywall-full-content invisible\">While maintaining a full position in D and having realized a portion of my capital gains, I recommend current Dominion shareholders to retain a portion of their position as an average-valued income investment.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\"><strong>Author's note:</strong> Please refer to my profile page for disclosures.</p>", "twitContent": "$D - I Reduced My Holdings Of Dominion Energy And Added To Berkshire Hathaway. https://seekingalpha.com/article/4357788-i-reduced-holdings-of-dominion-energy-and-added-to-berkshire-hathaway?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "35111", "type": "author"}}, "sentiments": {"data": [{"id": "283336", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "6699", "type": "tag"}]}, "otherTags": {"data": [{"id": "49521", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "18027", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "18029", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4357788-i-reduced-holdings-of-dominion-energy-and-added-to-berkshire-hathaway", "canonical": "https://seekingalpha.com/article/4357788-i-reduced-holdings-of-dominion-energy-and-added-to-berkshire-hathaway", "uriImage": "https://static.seekingalpha.com/uploads/2020/7/9/4623221-15943227999640625.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2020/7/9/4623221-15943227999640625.png"}}}, "included": [{"id": "35111", "type": "author", "attributes": {"company": null, "slug": "george-fisher", "userId": 4623221, "tagId": 49521, "bio": "<p>I am the author of Guiding Mast Investments monthly newsletter, focused on timely dividend paying stocks. Our mission at Guiding Mast Investments is to help investors keep a steady pace of wealth accumulation as they navigate through their financial voyage.  I have been a Registered Investment Advisor, financial author, and entrepreneur. I bring a variety of expertise to my clients, from personal investment planning and management to stock market analysis skills. I am the creator of the late 1990s investment newsletter Power Investing with DRIPs focused on timely selections of dividend paying stocks. I have also published two books through McGraw Hill, All About DRIPs and DSPs (2001), and The StreetSmart Guide to Overlooked Stocks (2002). My work experience covers a variety of fields.Prior to being a RIA, I spent 15 years as a corporate manager at Georgia-Pacific Corp before venturing out on my own, operating several businesses from manufacturing to export marketing management. President Ronald Reagan appointed me to the National Advisory Council overseeing the Small Business Administration from 1988 to 1991. </p><p><br></p><p>Now comes the obligatory disclaimers: The opinions and any recommendations expressed in this commentary are those of the author . None of the information or opinions expressed in this article constitutes a solicitation for the purchase or sale of any security or other instrument. Nothing in this commentary constitutes investment advice and any recommendations that may be contained herein have not been based upon a consideration of the investment objectives, financial situation or particular needs of any specific recipient. Any purchase or sale activity in any securities or other instrument should be based upon your own analysis and conclusions. Past performance is not indicative of future results. The information contained in this report does not purport to be a complete description of the securities market, or developments referred to in this material. The information has been obtained from sources considered to be reliable, but we do not guarantee that the foregoing material is accurate or complete. Any information is not a complete summary or statement of all available data necessary for making an investment decision and does not constitute a recommendation. Expressions of opinion are as of this date and subject to change without notice. Either Mr. Fisher or his employer, if any, may hold or control long or short positions in the securities or instruments mentioned.</p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/004/623/221/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/004/623/221/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/004/623/221/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/004/623/221/extra_large_pic.png"}, "nick": "George Fisher", "deactivated": null, "memberSince": 2012, "isRss": false, "contributorSince": 2012, "followersCount": 5602}, "relationships": {"user": {"data": {"id": "4623221", "type": "user"}}, "userBioTags": {"data": [{"id": "633166", "type": "userBioTag"}, {"id": "633176", "type": "userBioTag"}, {"id": "633196", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/george-fisher", "profileUrl": "/author/george-fisher", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "55", "type": "sector"}}}, "links": {"self": "/symbol/D"}}, {"id": "6699", "type": "tag", "attributes": {"slug": "brk.b", "name": "BRK.B", "company": "Berkshire Hathaway Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/BRK.B"}}, {"id": "49521", "type": "tag", "attributes": {"slug": "george-fisher", "name": "George Fisher", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/george-fisher"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "18027", "type": "tag", "attributes": {"slug": "utilities", "name": "Utilities", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/utilities"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "18029", "type": "tag", "attributes": {"slug": "electric-utilities", "name": "Electric Utilities", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/electric-utilities"}}, {"id": "283336", "type": "sentiment", "attributes": {"articleId": 4357788, "type": "neutral", "createdAt": "2020-07-10T04:31:40.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4357788", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}