{"data": {"id": "4358085", "type": "fullArticle", "attributes": {"publishOn": "2020-07-13T07:37:09-04:00", "isLockedPro": false, "commentCount": 107, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"nicholas-ward": {"id": 97701, "slug": "nicholas-ward", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "utilities": {"id": 55, "slug": "utilities", "kind": "sector", "path": "/stock-ideas/utilities", "title": "Utilities ", "non_theme": true, "sasource": "theme_breadcrumb"}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "electric-utilities": {"id": 18029, "slug": "electric-utilities", "kind": "common", "non_theme": true}}, "title": "Recent Sale: Dominion Energy", "summary": ["When Dominion made its deal with Berkshire and announced a 33% dividend cut, I decided to sell my shares.", "I don't mind D's future vision for itself, but the company appears to be overvalued in the present due to lowered cash flow guidance.", "I was able to lock in 26.6% profits when selling my stake."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2020-07-13T10:04:56-04:00", "isModerated": false, "closestTradingDate": "2020-07-13", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 42, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, but may initiate a long position in DUK over the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>As many of you know, a dividend cut is almost always a sell signal for me. Being that my goal as an investor is to generate reliably increasing income, any maneuver taken by a company's management team that I own that goes against that grain is ground for dismissal from my portfolio. Sometimes I end up holding onto a dividend dud when I am heavily underwater, due to my hatred for locking in losses. But, when I have the opportunity to cut ties with a former dividend grower and lock in a profit, I jump at the chance. That's exactly what I did with Dominion Energy (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>) on Monday morning.</p> <p>I sold my D position shortly after the bell on Monday at $80.60/share, locking in 26.6% capital gains (overall, my total returns here were 41.8% from my purchase in May of 2018 at $63.65/share).</p> <p>This sale was inspired by two separate announcements that the company made over the weekend.</p> <p>First of all, news broke that Dominion and partner, Duke Energy (<a href=\"https://seekingalpha.com/symbol/DUK\" title=\"Duke Energy Corporation\">DUK</a>), decided to abandon plans for the embattled Atlantic Coast Pipeline project. This project had already experienced numerous delays and uncertainties around a final deadline and the potential cost effectiveness of the pipeline was mounting. It's worth noting that the company received a favorable court ruling last month regarding its ability to receive special use permits from the Forest Service to build an underground segment of the pipeline beneath the Appalachian Trail in Virginia. This ruling was seen as a boon for the project by bulls, yet here we are a month later and it is official that the project is being shelved.</p> <p>This announcement seemed to correspond with news that broke regarding Dominion essentially selling out of the gas transmission and storage business to noted buyer, Berkshire Hathaway (<a href=\"https://seekingalpha.com/symbol/BRK.A\" title=\"Berkshire Hathaway Inc.\" class=\"paywall-full-content invisible\">BRK.A</a><span class=\"paywall-full-content invisible\">)(</span><a href=\"https://seekingalpha.com/symbol/BRK.B\" title=\"Berkshire Hathaway Inc.\" class=\"paywall-full-content invisible\">BRK.B</a><span class=\"paywall-full-content invisible\">) for roughly $10b.</span></p> <p class=\"paywall-full-content invisible\">The move involves a ~$4b cash payment to Dominion and Berkshire plans to assume roughly $5.7b in debt as a part of the transaction. Also, as a part of this transaction, Dominion lowered its guidance significantly, noted that its current payout ratio was too high, set a lower payout ratio target, and therefore, announced an upcoming dividend cut in Q4 of 2020.</p> <p class=\"paywall-full-content invisible\">This transaction is notable for several reasons. First and foremost, it's the first major purchase that Warren Buffett's Berkshire Hathaway has made since the start of the COVID-19 crisis in the stock markets. I suppose that one could say him selling out of the airlines was a major move and it's likely that we put at least some of the proceeds from those sales to use, but generally speaking, investors have been watching the Oracle of Omaha, wondering when he was going to put his massive cash pile to use (during Berkshire's annual shareholder meeting, the company highlighted its roughly $137b cash hoard). On a macro level, some investors have noted seeing Buffett's nearly $10b purchase as a bullish buy signal for the markets at large. Time will tell whether or not Buffett's move here will solidify the \"V\" shaped recovery since March. If I had to guess, I'd say this is simply an opportunistic purchase.</p> <p class=\"paywall-full-content invisible\">The move increases Berkshire's exposure to the gas transmission market significantly. A recent CNBC report notes that this move, if approved by regulators, will increase Berkshire's domestic share of interstate gas transmissions from roughly 8% to 18%. Outside of the pipeline assets that Berkshire is picking up in this deal, it is also acquiring a 25% ownership stake in Cove Point LNG, which is one of only 6 LNG export terminals in the United States. In short, Berkshire is betting big on the pipeline business and during one of the worst bear markets that we've ever seen in the energy space, I can't help but question his timing.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-159418438852473_origin.png\" rel=\"lightbox\" data-width=\"2284\" data-height=\"1120\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-159418438852473.png\" width=\"640\" height=\"314\" data-width=\"640\" data-height=\"314\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></span>Source: <a href=\"https://s2.q4cdn.com/510812146/files/doc_presentations/2020/06/2020-07-05-DE-IR-investor-update-presentation-vTC.pdf\" rel=\"nofollow\">Investor Presentation page 4</a></p> <p class=\"paywall-full-content invisible\">Some people can't help but wonder if the Oracle is losing his touch. First, he invests in the airlines after having negative things to say about the industry for years and years, only to sell out at what appears to be the bottom of a short-term dip, breaking the cardinal rule of value investing, locking in losses on the investments. And now he's buying assets from Dominion that don't appear to be particularly cheap and come along with potential secular headwinds with regard to the long-term demand for oil/gas products.</p> <p class=\"paywall-full-content invisible\">Recently Dave Portnoy, who has risen to the rank of unofficial king of the day traders, <a href=\"https://twitter.com/stoolpresidente/status/1270350291653791747?lang=en\" rel=\"nofollow\">said that Buffett was washed up</a>.</p> <p class=\"paywall-full-content invisible\">Mr. Portnoy believes that he is the superior investor in the present due to the success of his Davey Day Trader Global movement. As a professed fan of Mr. Buffett and the longstanding value investing principles that he and Charlie Munger have used to build Berkshire into the behemoth that it is today, I'm not quite ready to jump onto Portnoy's bandwagon.</p> <p class=\"paywall-full-content invisible\">Portnoy appears to believe that \"stocks only go up\" and whether or not he's making these professions tongue-in-cheek, I think he's spreading dangerous sentiment. I've made this clear to my subscribers at The Dividend Kings as well as The Intelligent Dividend Investor. In my experience, stocks never go up in a straight line. Furthermore, whether we're talking about the market in a macro sense or looking at the individual companies that the major indexes are comprised of, I see rampant overvaluation which leads me to believe that we're due for a pullback.</p> <p class=\"paywall-full-content invisible\">The market can stay irrational for very long periods of time. This, we all know. Yet, eventually sentiment will change. Valuations will revert back towards their long-term averages. And, using a famous Buffett quote, \"You only find out who's swimming naked when the tide goes out,\" I fear for those who are overextended into this recent rally and taking outsized risks because from my value-oriented perspective, they cannot be justified using the underlying fundamentals.</p> <p class=\"paywall-full-content invisible\">Regardless of my stance, I will say that Buffett's timing and choice of assets, with regard to his first major purchase of 2020, seems suspect. Personally, I'm not all the bullish on the growth of the pipeline business. There are still numerous legislative hurdles to clear in this industry, and I think it's telling that Dominion appears content to make a major change in its business plans moving forward, shifting its focus to cleaner, more sustainable, and renewable energy sources moving forward, as opposed to continuing the ongoing battle that it has been waging for years in the pipeline space.</p> <p class=\"paywall-full-content invisible\">But, back to Dominion.</p> <p class=\"paywall-full-content invisible\">I'm not selling out of my stake because of the news surrounding the asset sales to Berkshire. I'm selling my shares because as a part of this announcement, Dominion said that it was planning on cutting its dividend.</p> <p class=\"paywall-full-content invisible\">The company said that the asset sale would result in 2020 operation earnings falling from prior projections of $4.25-4.60/share to just $3.37-3.63. The company said that moving forward, it wants to maintain a payout ratio in the 65% range (which management says is more in line with its peers than the current ~85% payout ratio or so that the company is currently offering shareholders). Dominion announced plans to cut the 4th quarter dividend from the current $0.94/share level to $0.63/share, representing a 33% slash.</p> <p class=\"paywall-full-content invisible\">As someone whose entire investment strategy is built around generating reliably increasing dividend growth, news (or even speculation) of a cut is typically a sell signal. Dominion does plan to use the ~$3b in cash that it will receive from Berkshire to buy back shares. The reduced share count, alongside expected growth in the other areas of its business lead management to believe that the company will be able to generate higher-than-average dividend growth moving forward (it mentioned annual dividend growth expectations in the 6% range starting in 2022). However, to me, a 33% cut overshadows future mid-single-digit dividend growth.</p> <p class=\"paywall-full-content invisible\">When I first started writing this piece in the wee hours of Monday morning, D shares were rallying hard, up roughly 15% to more than $95/share in the pre-market trade. I was ecstatic seeing this - it would have meant exiting a broken investment thesis with nearly 50% profits to boot. Unfortunately, however, this pre-dawn bullishness waned and when the market opened up on Monday, D shares were hovering in the $80 area, down a percent or two from their previous close.</p> <p class=\"paywall-full-content invisible\">Even after the slump back down to $80, I was unimpressed with the prospects of a 3.12% dividend yield using the new 2021 dividend guidance. Even in today's low interest rate environment, I'm generally looking for 5%+ yields from utility names due to the slow (albeit steady) nature of their growth.</p> <p class=\"paywall-full-content invisible\">To me, even if the company was able to hit its 6% annual dividend growth targets that it set for 2022 and beyond, a ~3% yield growing at a mid-single digit pace is nothing for me to get excited about. Being that management just lost a lot of my faith having broken its 17-year annual dividend growth streak, I knew that when thinking about partnering with companies over the long term as an investor, I'd rather put my money elsewhere.</p> <p class=\"paywall-full-content invisible\">What's more, using the new guidance that D provided for 2020, shares appeared to be quite expensive in the $80 range. Using the mid-point of the recently updated 2020 guidance, we see that D shares were trading with a 22.85x forward P/E ratio.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-15941844337735758_origin.png\" rel=\"lightbox\" data-width=\"2342\" data-height=\"1144\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-15941844337735758.png\" width=\"640\" height=\"313\" data-width=\"640\" data-height=\"313\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span>Source: Investor Presentation page 10</p> <p class=\"paywall-full-content invisible\">As you can see in the F.A.S.T. Graph below (which has not been updated with the company's new EPS guidance yet), D shares topped out in the 23x range shortly in 2014 and then again in 2017 and other than those two anomalies, the company has traditionally traded with a much lower premium than this. The company's long-term average P/E ratio is 16.94x.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-1594184450028237_origin.png\" rel=\"lightbox\" data-width=\"2056\" data-height=\"1248\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-1594184450028237.png\" width=\"640\" height=\"388\" data-width=\"640\" data-height=\"388\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span>Source: F.A.S.T. Graphs</p> <p class=\"paywall-full-content invisible\">Management expects to generate roughly 85-90% of its pro-forma earnings from state-regulated utility operations, and I suppose it is expecting investors to be willing to pay a premium for such earnings due to the relatively low risk (from an equity perspective) position that regulated cash flows provide. However, I am not one of them.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-1594184580736185_origin.png\" rel=\"lightbox\" data-width=\"2284\" data-height=\"1192\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-1594184580736185.png\" width=\"640\" height=\"334\" data-width=\"640\" data-height=\"334\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Source: Investor Presentation, page 7</p> <p class=\"paywall-full-content invisible\">I continue to believe that a P/E ratio in the 16-17 range remains a fair valuation level for this name when considering its forward-looking dividend yield and EPS growth rate expectations.</p> <p class=\"paywall-full-content invisible\">Using 2020 EPS expectations, this implies a share price of $58 or so. And, if you're willing to give D's management team the benefit of the doubt and place a 16.5x multiple on 2021 EPS guidance, we arrive at a $64 price target.</p> <p class=\"paywall-full-content invisible\">D believes that its pro-forma fundamentals will make it best-in-class. However, to me, I don't see any reason to pay a 20x+ multiple for these shares. I think the new cash flow outlook pointed towards double-digit downside from the $80 level at which I sold. Even today, after a significant sell-off in recent days, D trades for $74.22/share, which still implies 13.5% downside or so from my 2021 price target.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-15941845668227077_origin.png\" rel=\"lightbox\" data-width=\"2286\" data-height=\"1212\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-15941845668227077.png\" width=\"640\" height=\"339\" data-width=\"640\" data-height=\"339\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span>Source: Investor Presentation, page 13</p> <p class=\"paywall-full-content invisible\">Even though the dividend cut and the clear overvaluation made my sell decision a clear one, I will say that it pains me a bit to cut ties with Dominion because not only do I send the company a check every month for my home's electricity (I always liked the idea of it sending me checks in return) but I like its long-term vision for a green energy/carbon neutral operation.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-15941845323801267_origin.png\" rel=\"lightbox\" data-width=\"2288\" data-height=\"1206\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-15941845323801267.png\" width=\"640\" height=\"337\" data-width=\"640\" data-height=\"337\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span>Source: Investor Presentation, page 9</p> <p class=\"paywall-full-content invisible\">As an environmental conservationist, I respect this vision. I am also pleased to see that the company believes it can increase profits with such a plan. D's 2021 EPS guidance is in the $3.85-3.90/range, which implies 6.5% y/y growth. 6.5% growth is solid from a utility name for sure. However, the lack of conviction with regard to the dividend was troubling and while I'm hopeful for D's success from a social standpoint, the company no longer meets my expectations from a passive income stance.</p> <p class=\"paywall-full-content invisible\">As you can see in the graphic provided during the company's presentation, prior to this deal, D had the highest payout ratio in the industry. This high ratio comes after several strong years of dividend growth (when I bought D shares back in 2018, management was talking about 8-10% EPS growth and double-digit dividend growth in the coming years). As I said in the article that I wrote a couple of years ago about <a href=\"https://seekingalpha.com/article/4175394-recent-purchase-dominion-energy\">my Dominion purchase</a>, this high level of dividend growth was the primary reason that I added exposure to the utility to my portfolio. While D was able to generate 12% bottom-line growth in 2018, that level of performance proved to be short-lived and therefore, the payout ratio crept higher as the company stuck with nearly double-digit dividend increases.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-15941845037173142_origin.png\" rel=\"lightbox\" data-width=\"2286\" data-height=\"1212\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2020/7/8/5939041-15941845037173142.png\" width=\"640\" height=\"339\" data-width=\"640\" data-height=\"339\" alt=\"\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Source: Investor Presentation, page 20</p> <p class=\"paywall-full-content invisible\">In 2019, D increased its dividend by 9.9%. However, lackluster operational performance inspired a change of heart in management with regard to shareholder returns and in 2020, D shareholder only received a 2.5% increase. The current $3.76 annual dividend would have represented a 107% payout ratio relative to the new 2020 guidance. However, it would have been below the low end of the 2021 EPS expectations, leading me to believe that if management truly felt confident that it could hit that figure, the 33% dividend cut that it announced wasn't absolutely necessary.</p> <p class=\"paywall-full-content invisible\">I think that D could have made this deal with Berkshire while maintaining the dividend at the $3.76/share level for a few years. I would have much rather seen the company freeze the dividend while EPS growth allowed the company to reach a more sustainable dividend payout ratio level. However, management decided to take what I believed to an unfriendly route, with regard to its income-oriented shareholder base.</p> <p class=\"paywall-full-content invisible\">Now that I've sold my D shares, I am looking to put the proceeds to use to repair my income stream. When I sold D, it had a yield of 4.66%. That's the target I'm looking to surpass with my eventual replacement purchases. Being that Dominion recently paid its Q2 dividend, I have some time before I risk missing a dividend payment and therefore, hurting my passive income stream with this sale. I will be sure to keep readers in the loop moving forward as I search for attractive value in the high yield space.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\"><em>This article was previously published for members of The Dividend Growth Club. </em></p>", "twitContent": "$D - Recent Sale: Dominion Energy. https://seekingalpha.com/article/4358085-recent-sale-dominion-energy?source=tweet ", "innerMarketing": "<p><img src=\"https://ci3.googleusercontent.com/proxy/k2_VNRd9s0yNursHE9Wccu2ZYxtRv92CJhLGKaAL5ukDvxuWTFKNxMesLyYBrxxmdq1ywL-ptJMM7dLV8ShetazOKzv5lQKA1Fry4KmYlFka71L97G86CW0rENH1NAaOwUg_=s0-d-e1-ft#https://static.seekingalpha.com/cdn/s3/marketing/157082881372847572571/image.png\" />Dividend Kings helps you determine the best safe dividend stocks to buy via our Master List. Membership also includes</p><ul><li>Access to our four model portfolios</li><li>30 exclusive articles per month</li><li>Our upcoming weekly podcast</li><li>20% discount to F.A.S.T. Graphs</li><li>real-time chatroom support</li><li>exclusive access to two preferred stock portfolios</li><li>exclusive updates to David Fish's (now run by Justin Law) Dividend Champion list</li><li>exclusive weekly updates to all my retirement portfolio trades</li><li>Our &quot;Learn How To Invest Better&quot; Library</li></ul><p><a href=\"https://seekingalpha.com/checkout?service_id=mp_1319\">Click here for a two-week free trial</a> so we can help you achieve better long-term total returns and your financial dreams.</p>", "marketingBullet": "This idea was discussed in more depth with members of my private investing community, The Dividend Kings. <a href='/checkout?service_id=mp_1319' sasource='mp_marketing_text_top'>Get started today »</a>", "isReit": false, "videoData": null, "marketingBulletVariant": "I'm Nicholas Ward, a financial analyst covering dividend growth stocks. I am a contributor to the investing group <a href=\"/checkout?service_id=mp_1319&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A5939041%7Csection_asset%3Aauthor_bullets%3A-the-dividend-kings\" data-test-id=\"author-custom-template-link\">The Dividend Kings</a> where we teach members how to invest more wisely in dividend stocks.", "marketingBio": "Nicholas Ward is a Senior Investment Analyst with Wide Moat Research and the former editor-in-chief and portfolio manager at The Intelligent Dividend Investor, The Dividend Growth Club, and The Income Minded Millennial.  \n                                                                                                                                                                                                                               Nicholas is a contributor to the investing group <a href=\"/checkout?service_id=mp_1319&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A5939041%7Csection_asset%3Aauthor_root%3A-the-dividend-kings\" data-test-id=\"author-custom-template-link\">The Dividend Kings</a> where he shares analysis on dividend growth stocks. The Dividend Kings is a group of analysts, led by Dividend Sensei, that teach members how to invest more wisely in dividend stocks. The focus is on helping investors safeguard and grow their money in all market conditions through the highest-quality dividend investments. Features include: 13 model portfolios, buy ideas, company research reports, and a thriving chat community for readers looking to learn how to invest more intelligently in dividend stocks. <a href=\"/checkout?service_id=mp_1319&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A5939041%7Csection_asset%3Aauthor_root%3A-the-dividend-kings\" data-test-id=\"author-custom-template-link\">Learn more</a>.", "audioDuration": null}, "relationships": {"author": {"data": {"id": "44781", "type": "author"}}, "sentiments": {"data": [{"id": "283702", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "97701", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "18027", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "18029", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4358085-recent-sale-dominion-energy", "canonical": "https://seekingalpha.com/article/4358085-recent-sale-dominion-energy", "uriImage": "https://static.seekingalpha.com/uploads/2020/7/8/5939041-159418438852473_origin.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2020/7/8/5939041-159418438852473_origin.png"}}}, "included": [{"id": "1026", "type": "authorResearch", "attributes": {"createdAt": "2016-02-05T06:54:50-05:00", "title": "iREIT®+HOYA Capital", "rating": "4.8", "reviewCount": 456, "shortPitch": "Enrich Your Retirement with Safe and Reliable REIT Income", "categories": ["Income", "REITs"], "serviceAssistantIds": [17838342, 51680711, 50064784, 15127382, 2670, 10007051, 27886573, 49839830, 13800852, 50785209, 49836612, 4847251, 5764111, 57332724, 56579885, 31557165, 11947801, 60682554, 330973, 58613619, 54869375, 59404817], "inAppPurchasesAllowedInIos": true, "inAppPurchasesAllowedInAndroid": true, "activeSubscriptionsCount": 135534, "androidIapPlan": "semi_annual", "iosIapPlan": "annual", "description": "iREIT®+HOYA Capital helps members build a sustainable real estate portfolio for steady income generation. In addition to REITs, the service focuses on real income-producing asset classes: ETFs, closed-end funds, preferreds, homebuilders, and dividend champions across various investing vehicles. Members gain access to an extensive suite of Investment Research Trackers and Dividend Tools including data on more than 200 REITs, targeting dividend yields of up to 10%.", "landingPageColor": "light-green", "adUnits": ["direct_access", "trading_alert", "active_chat", "model_portfolio", "exclusive_idea", "wildcard"], "tempData": {}, "price": 81.0, "wildcardText": "CEO Interviews", "slug": "ireit-hoya-capital", "annualPriceWithDiscount": 519.2, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": true}, "relationships": {"author": {"data": {"id": "98286", "type": "author"}}}}, {"id": "44781", "type": "author", "attributes": {"company": null, "slug": "nicholas-ward", "userId": 5939041, "tagId": 97701, "bio": "<p>Nicholas Ward is a Senior Investment Analyst with Wide Moat Research and the former editor-in-chief and portfolio manager at The Intelligent Dividend Investor, The Dividend Growth Club, and The Income Minded Millennial. </p><p> Nicholas is a contributor to the investing group <a href=\"https://seekingalpha.com/checkout?service_id=mp_1319\">The Dividend Kings</a> where he shares analysis on dividend growth stocks. The Dividend Kings is a group of analysts, led by Dividend Sensei, that teach members how to invest more wisely in dividend stocks. The focus is on helping investors safeguard and grow their money in all market conditions through the highest-quality dividend investments. Features include: 13 model portfolios, buy ideas, company research reports, and a thriving chat community for readers looking to learn how to invest more intelligently in dividend stocks. <a href=\"https://seekingalpha.com/checkout?service_id=mp_1319\">Learn More</a>.</p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/005/939/041/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/005/939/041/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/005/939/041/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/005/939/041/extra_large_pic.png"}, "nick": "Nicholas Ward", "deactivated": null, "memberSince": 2012, "isRss": false, "contributorSince": 2013, "followersCount": 33655}, "relationships": {"user": {"data": {"id": "5939041", "type": "user"}}, "userBioTags": {"data": [{"id": "141833", "type": "userBioTag"}, {"id": "141843", "type": "userBioTag"}, {"id": "141853", "type": "userBioTag"}, {"id": "141863", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1026", "type": "authorResearch"}}}, "links": {"self": "/author/nicholas-ward", "profileUrl": "/author/nicholas-ward", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "55", "type": "sector"}}}, "links": {"self": "/symbol/D"}}, {"id": "97701", "type": "tag", "attributes": {"slug": "nicholas-ward", "name": "Nicholas Ward", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/nicholas-ward"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "18027", "type": "tag", "attributes": {"slug": "utilities", "name": "Utilities", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/utilities"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "18029", "type": "tag", "attributes": {"slug": "electric-utilities", "name": "Electric Utilities", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/electric-utilities"}}, {"id": "283702", "type": "sentiment", "attributes": {"articleId": 4358085, "type": "neutral", "createdAt": "2020-07-13T07:37:09.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4358085", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}