{"data": {"id": "4380910", "type": "fullArticle", "attributes": {"publishOn": "2020-10-23T07:39:10-04:00", "isLockedPro": false, "commentCount": 3, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"investigating-the-stock-market": {"id": 606207, "slug": "investigating-the-stock-market", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "itw": {"id": 2752, "slug": "itw", "kind": "common", "non_theme": true}, "industrial-goods": {"id": 17913, "slug": "industrial-goods", "kind": "common", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "diversified-machinery": {"id": 17917, "slug": "diversified-machinery", "kind": "common", "non_theme": true}, "industrials": {"id": 20, "slug": "industrials", "kind": "sector", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "sasource": "theme_breadcrumb"}}, "title": "Illinois Tool Works: Taking The Right Path Towards Its 2023 Goals", "summary": ["Illinois Tool Works, Inc. has maintained the growth and stability in its financials over the years.", "The dividends have been changing in huge chunks for the last 10 years.", "After reaching its lowest value, the stock price surged up. It remains in its bullish trend with low to moderate volatility.", "The pandemic hurt the operations which may hamper the progress of the company towards its 2023 goals."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2020-10-23T07:39:10-04:00", "isModerated": false, "closestTradingDate": "2020-10-23", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 6, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Illinois Tool Works, Inc. (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ITW\" title=\"Illinois Tool Works Inc.\">ITW</a></span>) has sustained its growth while maintaining consistency and stability in its financials over the years. However, the negative impact of the pandemic made the company stagger a bit during the second quarter as sales and earnings fell significantly. Nevertheless, the company kept sound fundamental health and remained highly operational, given the surprising increase in the dividends. Moreover, the stock price remains undervalued despite the continuous increase.</p> <h2>The Stability of its Fundamental Health</h2> <p><em>Operating Revenue and Operating Costs</em></p> <p>The company has maintained stability in its operations. With its keen observation, the company has determined the business units that were in line with its long-term goals. As a result, the operating revenue remained almost unchanged for the last 10 years.</p> <p>From 2009 to 2019, the operating revenue had an average annual growth rate of 3%. Despite the variations then, it still went from $13.88 billion to $14.11 billion. It's a bit baffling to think about how it just grew by $203 million in 10 years. But one must understand that aside from its demand and output, the operating strategies of a company have a significant impact on its sales. The company has always been one of the strongest and most interesting businesses in the market. Also, it's been known for many acquisitions and divestitures it did before. In a nutshell, the company has a goal to reach in 2023 as it seeks to maintain stability in operations by raising its productivity while divesting its underperforming assets and business units. It was the primary reason behind the seemingly slow-moving growth in revenue. As more business units are sold, less revenue was generated. Nevertheless, one must consider the impact of such activities on the costs and expenses of the company.</p> <p>At the end of 2020, we may see a decline<span class=\"paywall-full-content invisible\"> in sales to $13.90 billion as estimated using the Linear Trend Analysis. It is a precise observation as the pandemic had a noticeable impact on the revenue during the first half. From 2017 to 2019, the values seemed stable, but in 2020, the sharp decline was evident, especially in 2Q. As a result, the accumulated value for the two quarters was 19% lower than the previous year. But for the next few years, it will start rising again and reach $14.24 billion in 2024.</span></p> <p class=\"paywall-full-content invisible\">The operating costs have been moving in almost the same direction as the operating revenue. But as one can see, the values before 2012 were relatively high. One could say that it's normal since the revenue was higher then. But if we look at 2009 and 2011 where the revenues were just $13.88 billion and $14.52 billion, the costs were still high at $9.14 billion and $9.10 billion, respectively. Upon divesting in 2012-2014, the revenue fell from $14.50 billion to $13.40 billion in 2015. It started increasing again until it exceeded $14 billion while the costs remained lower and almost unchanged at $8.40 billion on average. The value will remain in the range for the next five years as estimated.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2020/10/21/saupload_sMYpnySqTokL-0BqCxL7McuKox46Grx5dC1xztiXhrkBnEV-Z4Z_9ZVAwFfhdcJQZAVpK45cWntSpCqh3nX0jRMqDnUuLxxK0XyrUsNSqsgEh_rXAdwariVlEJkRgjrVIqmU1bIK.png\" width=\"602\" height=\"372\" data-width=\"1200\" data-height=\"742\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></p> <p class=\"paywall-full-content invisible\">Taken from <a href=\"https://www.marketwatch.com/investing/stock/itw/financials\" rel=\"nofollow\">MarketWatch: Illinois Tool Works Annual Financials</a></p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2020/10/21/saupload_1u9wXDT3PGHpr-NYJpVa_Hl1CqN3Bcc_J1V4vhe0s0QVh34hJ5Eod1ZYk1hjtQ_-hxwpyElq2FbN5I9TwBve9_0zvXJcfWcq6ST3lAT3d1DcvyqMaLvSpBQOSxdBDwL7xZdzgkcA.png\" width=\"602\" height=\"372\" data-width=\"1200\" data-height=\"742\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Taken from <a href=\"https://www.marketwatch.com/investing/stock/itw/financials/income/quarter\" rel=\"nofollow\">MarketWatch: Illinois Tool Works Quarterly Financials</a></p> <p class=\"paywall-full-content invisible\">Meanwhile, the gap has continued to widen upon its active divestment of underperforming business units in 2012-2014. From $4.74 million in 2009, gross profits rose to $5.67 million, but fell again a year later. In 2015, a year after the divestments, the value declined to $5.30 billion, but consistently grew for the next few years. In 2019, the value reached $5.76 billion. Over the past decade, one could see that the value has been generally increasing. On the other hand, the company has kept its operating expenses at a manageable level. As part of its strategic divestment, operating expenses were also controlled and even lessened. As a result, since the gross profit has been in an upward trend, the operating profit has substantially increased for the last 10 years as well. In 2019, the operating margin was 24%. It's near to the company's target of 28% in 2023. However, the impact of the pandemic may hamper the company's rapid growth. It will decline to 21% as estimated, but will go up again to 23%-24% for the next few years.</p> <p class=\"paywall-full-content invisible\">The continuous increase in operating profit over the years suggests that the company is more concerned about the long-term efficiency, viability, and stability of its operations. While revenue growth seems slow-moving, the costs and expenses were controlled and kept lower.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2020/10/21/saupload_ykzYSCM_AbZLAgMpQLFVB3Dem66_mOzEXHBZvMTB1ra-s9o0D2QY6jhZ3BIDI4cLSlBTorr5MTn22ISImdjqp4sr80u8O5-pbNVnWqAuq7JmNFvkM5OSOhJyvSmOLr1hgYnqFluE.png\" width=\"602\" height=\"372\" data-width=\"1200\" data-height=\"742\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Taken from MarketWatch: Annual Financials</p> <p class=\"paywall-full-content invisible\"><em>Net Income</em></p> <p class=\"paywall-full-content invisible\">While the company ensured a high amount of revenue that would not fall within its target, the costs and expenses were kept at a manageable level, which increased operating profits. Moreover, its non-core operations seemed to agree as the income generated here has been increasing generally over the years. The company's main focus in achieving its 2023 goals has been visible in the trend of net income. While there were some sharp increases and decreases, the value has been moving in a generally upward pattern. From $950 million in 2009, the earnings had an average annual growth of 17%. It moved continuously until it went up to $2.52 billion in 2019. Indeed, the company has maintained an ideal value of revenue while improving efficiency to achieve higher stability and profitability.</p> <p class=\"paywall-full-content invisible\">In 2020, we can check further how the core and non-core operations of the company are well-coordinated. The non-core transactions were also hurt by the pandemic. As a result, net income fell. Although the company remained firm in the first quarter as the earnings still amounted to $570 million, the effect was more visible in the second quarter. In a year-over-year comparison, it fell from $620 million to $320 million. As a result, the accumulated value amounted to $890 million and $330 million lower than the previous year. While the value decreased, it was still good to see a company in an industry that was heavily struck by the restrictions caused by the pandemic to remain viable and sustainable and get back shortly. Indeed, the company's goal and strategy protected its operations to remain efficient and profitable even in times like this. As the value is expected to decrease to $1.82 billion, the value will bounce back for the following years and rise to $2.46 billion.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2020/10/21/saupload_7faFiK4PKrvIMvclE_qwlS0sgCZRICdUNILhe0Er0v1BOIdl_pO4Sj871JPm0MFpCPPRu8Wk67wObV-rIromZPTdG9DSQPgpsrklTbymytBB5qFaCbZMhsLKWqKyiHmSgFoCkaWL.png\" width=\"602\" height=\"372\" data-width=\"1200\" data-height=\"742\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Taken from MarketWatch: Annual Financials</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2020/10/21/saupload_3Xw3XeY1lkzYdZJh9OoarfFeWU0pwxgqhZbZRX7SMCENBjFeLg-0szI4eJhO5b7WRAHdCBsjBsreR1ofnnJN_lrLMxGzUQT9VXj176EYDGbVcqSK2i2I4LJTOvXok36z9_Xrgioq.png\" width=\"602\" height=\"372\" data-width=\"1200\" data-height=\"742\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Taken from MarketWatch: Quarterly Financials</p> <p class=\"paywall-full-content invisible\"><em>Return on Asset</em></p> <p class=\"paywall-full-content invisible\">The company's goal was more visible in the Balance Sheet. As it chose to focus on long-term efficiency, sustainability, and profitability, it sold off its underperforming assets. Even if it decreased the units that generated revenue, it further decreased the high costs and expenses in utilizing those. As a result, the assets have decreased drastically, which affected the operations. From 2009 to 2011, the Return on Asset (ROA) just moved from 5% to 11%. While the value has always been ideal, it seemed that the company still had a lot to show. After its divestments, ROA started increasing to 13%. In 2018 and 2019, the value remained high at 17% approximately. Moreover, the identical trend of net income and ROA conveyed the consistency in its goals. As the company continued to realize higher earnings, its sustainability to further strengthen the operations in the long run increased as well. For the next few years, the trend of ROA will remain identical to net income. This is a testament to the company's ideal strategy and goal as it focuses more on balancing growth and efficiency to maintain consistency and stability in its operations.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2020/10/21/saupload_Hql3qklrq8--GeYvE9-4ph_IG8AMmayV3kf7_0vd78GdDn4etWfLuRvdUnughIOAOAtsooZobWD8N0I7BfZ_HrWyhmX-4Gk0jmlmK0GCFZEY0CEZ8VaCeS6t5K4iyYTpD7uA-Ztr.png\" width=\"602\" height=\"372\" data-width=\"1200\" data-height=\"742\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Taken from MarketWatch: Annual Financials</p> <h2 class=\"paywall-full-content invisible\">The Capacity of the Company to Raise Dividend Payments</h2> <p class=\"paywall-full-content invisible\"><em>Dividends Per Share</em></p> <p class=\"paywall-full-content invisible\">The company has been generously raising the dividends for the last 10 years. With an average rate of 12.97%, dividend growth has been substantial. It grew in huge chunks as it moved from $1.24 per share in 2009 to $4.14 per share in 2019. There were no years of slow growth as the lowest value was in 2009-2010 at 4.8%. Since 2014, the growth did not go below 13%. The largest increases were in 2017, 2018, and 2019 at 19%, 24%, and 16%, respectively. Indeed, investors realized rapid growth in their investments. As the company maintained the balance between growth and stability, it included dividend growth in its priorities, as the value rose more than thrice. At the end of the year, the value will most likely reach $4.42 per share as proposed. Using the Dividend Growth Model, the dividends are estimated to surpass $5 per share for the next few years.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2020/10/21/saupload_5fiVHyhhU2hMAJaT95bMk5f4k0j5OxVUjJ-AyxYzSirUeMdYR8cnyXzslB2_3N8T5cnLAvNV_MCA_X4ddDL9XZbmeBlL00ZJyZC_jj-nDLoH7aoXS-DVc8ZP0EptsXwsB8GKWYb9.png\" width=\"602\" height=\"372\" data-width=\"1200\" data-height=\"742\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Taken from <a href=\"https://www.nasdaq.com/market-activity/stocks/itw/dividend-history\" rel=\"nofollow\">Nasdaq: Dividend History</a></p> <p class=\"paywall-full-content invisible\"><em>Dividend Payout Ratio</em></p> <p class=\"paywall-full-content invisible\">The value of the dividends relative to the company's earnings remained substantial over the past decade. Even if net income were relatively low in 2009, the dividend payout ratio still reached 64%, which showed the company's commitment to its shareholders. Moreover, as the earnings grew fast, the dividends rose dramatically. Even if the ratio remained lower, one can easily see the substantial value and growth rate of the dividends. Since 2010, the Dividend Payout Ratio was 41% on average. It showed the company's effort and strategy to balance the shareholders' and the company's earnings to achieve its long-term goal, which would be more beneficial for both parties. At the end of the year, the value is expected to rise to 80%. This is the estimated outcome since the dividends per share are expected to increase to $4.42 while the earnings may decline from $7.74 to $5.52 per share. For the next few years, we can see in the estimation that the ratio will be lower at about 70% as the company will bounce back and continue to increase the dividends. Earnings per share (EPS) are estimated to rise again to $6.54. <a href=\"https://www.nasdaq.com/market-activity/stocks/itw/earnings#:~:text=Earnings%20announcement*%20for%20ITW%3A%20Oct%2023%2C%202020&amp;text=According%20to%20Zacks%20Investment%20Research,quarter%20last%20year%20was%20%242.04\" rel=\"nofollow\">Nasdaq Earnings Forecast</a> showed a more optimistic outlook as the EPS in 2023 will rise to $9.96, which showed a higher possibility for the company to reach its target ratio of 50% while ensuring continuous dividend growth.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2020/10/21/saupload_uFGppYq1IK1QEN6MJsJbY-cdhaDnzksKSB-Ejv690ppXoMu_aFzoxS1k69VUvZRAWa3buZV7SPGIN8-9oPHFVBgOBhL_ulgiYyX3vqJctiiZGq--C7rgyfxOhozSisPrLxn2TpPa.png\" width=\"602\" height=\"372\" data-width=\"1200\" data-height=\"742\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Taken from MarketWatch: Annual Financials and Nasdaq: Dividend History</p> <p class=\"paywall-full-content invisible\"><em>Dividends, Net Income, and Free Cash Flow</em></p> <p class=\"paywall-full-content invisible\">It is essential to verify the growth and consistency of earnings in the cash flow statement. Free Cash Flow (FCF) is an important indicator of the company's performance throughout the year as it accounts for the changes in its operations and the net change in its operating assets and liabilities, especially its capital expenditures (CAPEX).</p> <p class=\"paywall-full-content invisible\">Like net income, FCF has been generally increasing over the years. In 2018 and 2019, the value of FCF and net income were close at $2.45 billion versus $2.56 billion and $2.67 billion versus $2.52 billion respectively. As FCF grew faster and remained higher than the dividends, its trend became more similar to net income since 2014. We can conclude two things in this section. First, FCF proved that the earnings of the company were adequate to continue raising the dividends. Second, the consistency in their trend and values suggests the balance in the company's profitability and sustainability maintains stable growth in the operations in the long run. This is in line with the company's goal to realize an equal amount of net income and FCF in 2023.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2020/10/21/saupload_MH0-8qC56tkmTiR9Gy72MoLsvRJmLxTZiodgNkWMedTb20ZAEhKRE-3fIa3RbA499-pi3NgX9sBUdcIbuZqbaDEb3XTJmkENAI6tEXJjPFNb8VFtvWoqO2XDFtgWh1S2eou3UUou.png\" width=\"602\" height=\"372\" data-width=\"1200\" data-height=\"742\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Taken from MarketWatch: Annual Financials and Nasdaq: Dividend History</p> <h2 class=\"paywall-full-content invisible\">Stock Price</h2> <p class=\"paywall-full-content invisible\">The bullish trend of the stock price remains evident. After hitting its lowest value at $115.78 last March 23, the price made a huge jump and continued increasing for the next six months. Currently, the price seems high as it is set at $203.44. The PE ratio of 29.87 confirms the supposition and shows the overvaluation of the stock price. But it is also important to check it using the Dividend Discount Model.</p> <ul class=\"paywall-full-content invisible\"> <li>Current Price: $203.44</li> <li>Average Dividend Growth: 0.129719407</li> <li>Estimated Dividends Per Share: $4.42</li> <li>Cost of Capital Equity: 0.151555194</li> <li>Derived Value: $228.6778024 or $228.68</li> </ul> <p class=\"paywall-full-content invisible\">Given the derived value using the model, the stock price appears to be undervalued. Nevertheless, one must remember that this is limited to dividend growth. Other factors like the market trend and the uncertainties caused by the pandemic must be considered.</p> <h2 class=\"paywall-full-content invisible\">Opportunities for Further Growth</h2> <p class=\"paywall-full-content invisible\"><em>Illinois Tool Works, Inc. in the Time of Pandemic, and its 2023 Goals</em></p> <p class=\"paywall-full-content invisible\">The company's operations were affected by the pandemic as the sales and earnings considerably fell during the second quarter. It may hamper the progress of the company towards its goals. Nevertheless, the company adhered to its strategies as it continued to realize adequate sales and remained profitable. Its focus to stabilize growth while maintaining efficiency saved it from further damage. As the industries now learn to cope with the current situation, the company has to move along with it. Its strategy is more applicable now, which may help it get back on its feet in a short time especially when everything goes back to normal. The return of the employment may give more power to many customers, which will increase the company's sales. Moreover, Nasdaq is optimistic about its performance as it estimates the earnings to grow substantially for the next few years.</p> <h2 class=\"paywall-full-content invisible\">Conclusive Ideas</h2> <p class=\"paywall-full-content invisible\">As this concludes, one may be still wondering whether investing here is a great idea or not. The pandemic has caused a lot of restrictions which delayed the growth of the company. It also showed how the companies perform in uncertain situations like this. Many staggered, some remained strong, and some already closed their doors. Given the analysis, is it wise to invest here?</p> <p class=\"paywall-full-content invisible\">Short-term Investors: The price has started increasing and remained bullish after it hit the bottom last March 23. The upward trend continues and does not show any indication that it will fall. But the high PE ratio suggests overvaluation. It may be logical since the price kept increasing while the current earnings are not impressive. On the other hand, the exciting dividend growth says the opposite. As I can see, the price will continue to increase for the next few weeks. An investor is advised to always check the press releases of the company and the current market changes. Also, the release of the 3Q report will have a substantial impact on price changes.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Long-term Investors: The dividends tell that investing here is a sagacious move on an investor's part. The growth has been splendid. Moreover, the company has successfully maintained the balance between efficiency and growth, which increased its profitability and long-term sustainability. Revenue growth may not have been impressive for the past few years, but the strategy of the company focuses on long-term positioning to achieve greater results as shown by the increased earnings and ROA. While the pandemic may hamper ITW's progress and struck it during the first half, it proved the company's tenacity as sales and earnings remained adequate to continue the operations and raise the dividends.</p>", "twitContent": "$ITW - Illinois Tool Works: Taking The Right Path Towards Its 2023 Goals. https://seekingalpha.com/article/4380910-illinois-tool-works-taking-right-path-towards-2023-goals?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "105897", "type": "author"}}, "sentiments": {"data": [{"id": "297444", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2752", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "606207", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17913", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17917", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4380910-illinois-tool-works-taking-right-path-towards-2023-goals", "canonical": "https://seekingalpha.com/article/4380910-illinois-tool-works-taking-right-path-towards-2023-goals", "uriImage": "https://static.seekingalpha.com/uploads/2020/10/21/saupload_sMYpnySqTokL-0BqCxL7McuKox46Grx5dC1xztiXhrkBnEV-Z4Z_9ZVAwFfhdcJQZAVpK45cWntSpCqh3nX0jRMqDnUuLxxK0XyrUsNSqsgEh_rXAdwariVlEJkRgjrVIqmU1bIK.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2020/10/21/saupload_sMYpnySqTokL-0BqCxL7McuKox46Grx5dC1xztiXhrkBnEV-Z4Z_9ZVAwFfhdcJQZAVpK45cWntSpCqh3nX0jRMqDnUuLxxK0XyrUsNSqsgEh_rXAdwariVlEJkRgjrVIqmU1bIK.png"}}}, "included": [{"id": "105897", "type": "author", "attributes": {"company": null, "slug": "investigating-the-stock-market", "userId": 50389777, "tagId": 606207, "bio": "<p>Full-time equity analyst/Part-time Investor. Having adequate knowledge and reliable information can help in your investment decisions. Stock market success is possible as long as one is willing to study, risk, and learn. </p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/050/389/777/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/050/389/777/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/050/389/777/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/050/389/777/extra_large_pic.png"}, "nick": "Investigating The Stock Market", "deactivated": null, "memberSince": 2019, "isRss": false, "contributorSince": 2020, "followersCount": 1005}, "relationships": {"user": {"data": {"id": "50389777", "type": "user"}}, "userBioTags": {"data": [{"id": "975941", "type": "userBioTag"}, {"id": "975942", "type": "userBioTag"}, {"id": "975943", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/investigating-the-stock-market", "profileUrl": "/author/investigating-the-stock-market", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2752", "type": "tag", "attributes": {"slug": "itw", "name": "ITW", "company": "Illinois Tool Works Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "20", "type": "sector"}}}, "links": {"self": "/symbol/ITW"}}, {"id": "606207", "type": "tag", "attributes": {"slug": "investigating-the-stock-market", "name": "Investigating The Stock Market", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/investigating-the-stock-market"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17913", "type": "tag", "attributes": {"slug": "industrial-goods", "name": "Industrial Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/industrial-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17917", "type": "tag", "attributes": {"slug": "diversified-machinery", "name": "Diversified Machinery", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/diversified-machinery"}}, {"id": "297444", "type": "sentiment", "attributes": {"articleId": 4380910, "type": "bullish", "createdAt": "2020-10-23T07:09:02.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4380910", "type": "article"}}, "tag": {"data": {"id": "2752", "type": "tag"}}}}]}