{"data": {"id": "4579705", "type": "fullArticle", "attributes": {"publishOn": "2023-02-18T02:43:11-05:00", "isLockedPro": false, "commentCount": 21, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"khen-elazar": {"id": 486826, "slug": "khen-elazar", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "utilities": {"id": 55, "slug": "utilities", "kind": "sector", "path": "/stock-ideas/utilities", "title": "Utilities ", "sasource": "theme_breadcrumb"}}, "title": "Dominion Energy: A Steady Income Opportunity In The Utilities Sector", "summary": ["Dominion Energy is a regulated utility company with limited competition and a focus on renewable electricity.", "Despite slow earnings growth, the company has solid fundamentals and an attractive valuation.", "With a high dividend yield and commitment to maintaining it, Dominion Energy may be a good option for investors seeking steady income with growth potential."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-02-18T02:43:11-05:00", "isModerated": false, "closestTradingDate": "2023-02-21", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 4, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-w750\" alt='Warren Buffett\"s Berkshire Hathaway To Buy Dominion Energy' data-id=\"1224912113\" data-type=\"getty-image\" width=\"5521px\" height=\"3681px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"></picture><figcaption><p class=\"item-credits\">Zach Gibson</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Introduction</h2> <p>As an investor who prioritizes dividend growth, I am constantly searching for fresh opportunities to invest in assets that generate consistent income. When I come across attractively valued assets, I often add them to my current holdings. Additionally, I use market volatility<span class=\"paywall-full-content invisible\"> to my advantage by initiating new positions, which helps diversify my portfolio and increase my dividend income while minimizing the needed capital.</span></p> <p class=\"paywall-full-content invisible\">The utility sector presents an intriguing opportunity for investors since, due to the higher rates, we see higher-yielding stocks. Dominion Energy (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>), in particular, is an attractive option for investors due to its consistently high dividend yield. Dominion Energy operates in a stable market as a regulated utility and is well-positioned to continue generating income for investors.</p> <p class=\"paywall-full-content invisible\">I will analyze the company using my methodology for analyzing dividend growth stocks. I am using the same method to make it easier to compare researched companies. I will examine the company's fundamentals, valuation, growth opportunities, and risks. I will then try to determine if it's a good investment. Seeking Alpha's company overview shows that:</p> <blockquote class=\"paywall-full-content invisible\"><p>Dominion Energy produces and distributes energy in the United States. The company operates through four segments: Dominion Energy Virginia, Gas Distribution, Dominion Energy South Carolina, and Contracted Assets. The Dominion Energy Virginia segment generates, transmits, and distributes electricity in Virginia and North Carolina. The Gas Distribution segment is focused on natural gas sales, transportation, gathering, storage, and distribution operations in Ohio, West Virginia, North Carolina, Utah, southwestern Wyoming, and southeastern Idaho. The Dominion Energy South Carolina segment generates, transmits, and distributes electricity and natural gas in South Carolina. The Contracted Assets segment is involved in the nonregulated long-term contracted renewable electric generation and solar generation facility development operations, and gas transportation, LNG import, and storage operations, as well as in the liquefaction facility.</p></blockquote> <h2 class=\"paywall-full-content invisible\">Fundamentals</h2> <p class=\"paywall-full-content invisible\">Over the last decade, Dominion Energy has demonstrated impressive revenue growth over the last decade, with an increase of 33%. This growth can be attributed to both organic and inorganic factors. On the organic side, the company has been expanding its grid and benefiting from demographic growth, which has increased demand for its services. Meanwhile, the company has also pursued inorganic growth through strategic acquisitions, such as the purchase of Questar and the merger and subsequent sale of its midstream business. In the future, as seen on Seeking Alpha, the analyst consensus expects Dominion Energy to keep growing sales at an annual rate of ~2% in the medium term.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/17/saupload_5c5c96d5dfa0c7155bf678a8069cb7ba.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">While Dominion Energy has experienced impressive revenue growth over the past decade, its EPS (earnings per share) has grown slower. In GAAP figures, EPS has increased by 110%, a remarkable achievement. However, the non-GAAP figures tell a different story, with EPS growing by only 26%. There are a few reasons for the EPS growing slower than sales. One factor is the higher number of shares that Dominion Energy has issued over the years, which has diluted the earnings per share. The company's margins have also been under pressure, contributing to slower earnings growth. In the future, as seen on Seeking Alpha, the analyst consensus expects Dominion Energy to keep growing EPS at an annual rate of ~1% in the medium term.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/17/saupload_3ee61ce9c33eb8e6bd75f2dcf932a017.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Dominion Energy has faced criticism from investors over its dividend cut in recent years, as the company cut its dividend significantly following the sale of its midstream business. However, the company is now continuously growing the dividend and is committed to maintaining it. Currently, the dividend yield is an attractive 4.6%, and it appears safe with a payout ratio of 67% when using non-GAAP EPS. While the company is not yet back to the level of dividend growth that investors may desire, there is room for mid-single-digit dividend increases in the coming years, as indicated by the management's guidance.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/17/saupload_49b134939d022d77388563905a6f9fe6.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">In addition to paying dividends, companies often return capital to their shareholders through stock buybacks. However, Dominion Energy has not engaged in stock buybacks in recent years, as it has a payout ratio of 67% and is focused on investing in its projects. Buybacks can be an extremely efficient way to return value to shareholders when the share price is attractive, as in the case of Dominion Energy. It is worth noting that the number of shares outstanding has increased by 45% in recent years, as the company has used them to finance acquisitions. This dilution may have contributed to slower earnings.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/17/saupload_81188f7b2932c9e04844a186ae5a2528.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">Valuation</h2> <p class=\"paywall-full-content invisible\">Despite its challenges with dividend growth, Dominion Energy's current P/E ratio is attractive, trading at roughly 14 when using 2023 earnings estimates. While some investors may still lack confidence in the company's management due to the dividend cut, the shares appear to be trading at a discount relative to their potential value. Additionally, the current valuation is appealing, as it suggests that investors can purchase the stock at an attractive price.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/17/saupload_ea9253412a5860425f784aa5a54d8dd6.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">The graph below from Fastgraphs emphasizes that the shares of Dominion are attractive at the current valuation. The average P/E ratio over the last two decades was 17.2, significantly higher than the current 14.5. The company has been growing slowly, so there has been no significant change in the growth rate. Therefore, the current price is depressed due to future project uncertainty and the past dividend cut.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><span><a href=\"https://static.seekingalpha.com/uploads/2023/2/17/20475971-1676641859354464_origin.png\" rel=\"lightbox\" data-width=\"1251\" data-height=\"739\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/2/17/20475971-1676641859354464.png\" alt=\"Fastgraphs analysis\" contenteditable=\"false\" loading=\"lazy\"></a></span></picture><figcaption><p class=\"item-caption\">Fastgraphs.com</p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Dominion Energy is a regulated utility with a presence in several states. Over the past decade, Dominion Energy's revenue has increased over the past decade, but its earnings per share have grown at a slower pace due to a higher number of shares and lower margins. The company has a high dividend yield and does not engage in stock buybacks due to the need to invest in its projects. While the company has cut its dividend recently, its current payout ratio is stable, and its P/E ratio suggests the stock may be trading at a discount.</p> <h2 class=\"paywall-full-content invisible\">Opportunities</h2> <p class=\"paywall-full-content invisible\">Dominion Energy is a regulated utility, which means it operates in a highly stable and predictable industry with limited competition. This is because regulated utilities have a monopoly over their service area and are regulated by government agencies, which limit competition and ensure that the company can earn a fair return on its investments. Dominion Energy has a strong presence in several states in the US, including Virginia, North Carolina, and South Carolina, which means that it has a large customer base and can benefit from economies of scale. As a result, Dominion Energy can provide a reliable and affordable energy source to its customers, which has helped establish it as a leading player in the energy sector.</p> <p class=\"paywall-full-content invisible\">One of the key reasons to invest in Dominion Energy is its focus on renewable energy. The company has committed to reducing its carbon footprint by investing in renewable energy sources such as solar and wind power. In 2020, the company announced a goal to achieve net-zero greenhouse gas emissions by 2050. This focus on renewable energy is online with current trends and reflects the growing demand for clean energy solutions. Dominion Energy invests in a large offshore wind farm in Virginia as the world moves towards a more sustainable future.</p> <p class=\"paywall-full-content invisible\">Finally, Dominion Energy's presence in several states is essential to consider when evaluating the company's investment potential. This is because different state agencies regulate the company's operations, so it is not overly exposed to a single regulator. This reduces the risk of regulatory changes or challenges that could negatively impact the company's operations. Furthermore, Dominion Energy's diverse customer base and operations in multiple states help mitigate the impact of economic downturns in any region. This provides a level of stability and resilience that is attractive to investors, especially during economic uncertainty.</p> <h2 class=\"paywall-full-content invisible\">Risks</h2> <p class=\"paywall-full-content invisible\">Potential investors should also be aware of a few key risks. One of the most significant risks associated with investing in Dominion Energy is the inherent uncertainty of renewable energy projects. Unlike natural gas or other traditional energy sources, renewable energy projects often involve a greater degree of complexity and risk. This is because the technology is still relatively new and developing, and there is a greater degree of uncertainty around issues such as energy storage, grid integration, and weather variability. As a result, there is a risk that Dominion Energy's investments in the wind farm may not yield the expected returns, which could impact the company's financial performance and its ability to generate value for investors.</p> <p class=\"paywall-full-content invisible\">Another risk to consider when investing in Dominion Energy is the company's limited growth opportunities outside of regulated activities. Dominion Energy recently sold its natural gas transmission business to focus on its regulated activities and renewable energy projects. While this move has helped to streamline the company's operations and reduce risk, it also means that the company has limited growth opportunities outside of its regulated activities.</p> <p class=\"paywall-full-content invisible\">Finally, investors should be aware of the risks associated with Dominion Energy's reliance on regulators to increase prices. Dominion Energy is subject to government oversight as a regulated utility, and any regulatory environment changes could impact the company's financial performance. This is particularly true in an inflationary environment, where regulators may be hesitant to approve rate increases that could lead to higher consumer prices. This could limit the company's ability to generate returns for investors, especially if inflation remains high for an extended time.</p> <h2 class=\"paywall-full-content invisible\">Conclusions</h2> <p class=\"paywall-full-content invisible\">All in all, Dominion Energy appears to have solid fundamentals and a promising future. The company's focus on renewables in line with current trends and its presence in multiple states and limited competition should provide growth opportunities. While the company has cut its dividend recently, its current payout ratio is stable, and its P/E ratio suggests the stock may be trading at a discount. While there are risks, including the uncertainty of renewable projects and the need to rely on regulators for price increases, the overall outlook for Dominion Energy is positive, with limited risks and an attractive valuation.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">While Dominion Energy has many positive aspects, including solid fundamentals, an attractive valuation, and growth opportunities, the slow earnings growth may make the stock less appealing to some investors seeking rapid growth. Therefore, for these investors, the stock may not be a top choice and, therefore, a HOLD. However, for those looking for a steady income that will grow faster than inflation, Dominion Energy's high dividend yield and commitment to maintaining it may make the stock a good option.</p>", "twitContent": "$D - Dominion Energy: A Steady Income Opportunity In The Utilities Sector. https://seekingalpha.com/article/4579705-dominion-energy-steady-income-opportunity-utilities-sector?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "80836", "type": "author"}}, "sentiments": {"data": [{"id": "438594", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "486826", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4579705-dominion-energy-steady-income-opportunity-utilities-sector", "canonical": "https://seekingalpha.com/article/4579705-dominion-energy-steady-income-opportunity-utilities-sector", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1224912113/image_1224912113.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "80836", "type": "author", "attributes": {"company": null, "slug": "khen-elazar", "userId": 20475971, "tagId": 486826, "bio": "<p>Dividend growth investor</p>", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/020/475/971/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/020/475/971/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/020/475/971/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/020/475/971/extra_large_pic.png"}, "nick": "Khen Elazar", "deactivated": null, "memberSince": 2014, "isRss": false, "contributorSince": 2015, "followersCount": 9182}, "relationships": {"user": {"data": {"id": "20475971", "type": "user"}}, "userBioTags": {"data": [{"id": "509866", "type": "userBioTag"}, {"id": "509876", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/khen-elazar", "profileUrl": "/author/khen-elazar", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "55", "type": "sector"}}}, "links": {"self": "/symbol/D"}}, {"id": "486826", "type": "tag", "attributes": {"slug": "khen-elazar", "name": "Khen Elazar", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/khen-elazar"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "438594", "type": "sentiment", "attributes": {"articleId": 4579705, "type": "neutral", "createdAt": "2023-02-18T02:43:11.000-05:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4579705", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}