{"data": {"id": "4593264", "type": "fullArticle", "attributes": {"publishOn": "2023-04-10T15:56:13-04:00", "isLockedPro": false, "commentCount": 27, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"incomebent-investments": {"id": 164555, "slug": "incomebent-investments", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "utilities": {"id": 55, "slug": "utilities", "kind": "sector", "path": "/stock-ideas/utilities", "title": "Utilities ", "sasource": "theme_breadcrumb"}}, "title": "Dominion Energy: Navigating A Tricky Transition To Cleaner Energy Sources", "summary": ["Dominion Energy is undergoing a transition to cleaner energy sources, which has caused some short-term stock price volatility.", "Despite these challenges, Dominion Energy has taken steps to bolster its liquidity, including issuing long-term debt and securing a term loan facility.", "The company's stock is trading reasonably in terms of revenue multiples and offers a healthy dividend yield for now.", "There is an ongoing business review that may result in short-term negative headlines."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-04-10T15:56:13-04:00", "isModerated": false, "closestTradingDate": "2023-04-10", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 6, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of D either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w750\" alt=\"Inflation Reduction Act Boosts Federal Spending On Renewable Energy\" data-id=\"1417180248\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Chip Somodevilla</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Dominion Energy (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>) has been a stalwart of the US economy for some time now. It has long been one of those utility companies that has provided quite steady dividend income for shareholders for decades, but recently, things have<span class=\"paywall-full-content invisible\"> begun to change for the company. Higher interest rates, pricing issues and volatile energy markets have brought the stock to multiyear lows. Today we will take a look at what's going on with the company, why the stock is underperforming and discuss the right conditions for purchase at this level.</span></p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/10/saupload_52c5cab13e2e43709d0fb9e4366bebfd.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">Company Outlook</h2> <p class=\"paywall-full-content invisible\">Dominion Energy is a company undergoing a transition. With the widespread secular trend in developed nations to adopt more green energy sources, many of the big energy names have decided to take a proactive approach to build out these clean energy capabilities before they are mandated to do so. Before we go any further, it is important to affirm that oil is probably not going anywhere for the foreseeable future. We will likely continue to be a fossil fuel-burning species for the foreseeable future, but there is no doubt that clean energy solutions are gaining popularity. Dominion has stepped up to the plate and invested massively to make this shift work, but investors have paid the price with the stock performance recently. I firmly believe that this is the best move long-term and that management is taking a measured, responsible approach with respect to the company's future. This ties in with what utility investors should be. They should be long-term-focused investors who would rather receive and reinvest steady dividend payments versus sensational moves in the company stock price. I'm sure no investors will be thrilled about the massive selloff recently, but long-term-oriented investors should look at this as just a speed bump on the way to the long-term prize in my view.</p> <p class=\"paywall-full-content invisible\">It is not as if Dominion Energy's business model is broken by any means of the imagination. Revenue and EBITDA trends are all pointing in the right direction, the company has a strong and competent management team, and it is unlikely that they will be overthrown in any of their key markets.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/10/saupload_910c16a5a5f83ac6181068ea994ed38b.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">To bolster its liquidity, Dominion Energy has recently issued $850 million in long-term debt and secured a $2.5 billion 364-day term loan facility. The company will refresh its financing plans once the business review is completed. In the meantime, Dominion is also monitoring macroeconomic headwinds such as higher interest rates and fuel costs, and working with regulators to minimize any potential impact on customers.</p> <p class=\"paywall-full-content invisible\">As part of the ongoing business review, Dominion Energy aims to maintain high BBB range credit ratings for its parent company and single-A range ratings for its regulated operating companies. The company's objective is to consistently meet and exceed its downgrade threshold even during temporary periods of cost or regulatory pressure.</p> <p class=\"paywall-full-content invisible\">Dominion Energy will provide a business review update this spring, followed by an Investor Day in Q3, offering a comprehensive update of the business plan.</p> <p class=\"paywall-full-content invisible\">I believe the outcome of this review will likely be viewed as negative, but I also believe that the recent price action from the stock has priced in more trouble than one can reasonably expect. The company looks like it's moving past the customer billing issues in the past, its revenues are heading in the right direction and there are really no credible threats to its dominance and its key markets. The main issues for the company are the high-interest rates and its transition to cleaner options. It is hard to see how these challenges suggest that the company should remain more than 30% off all-time highs for the extended future.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/10/saupload_4a5cad96c5d88957a6133f4b7244e5f2.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">A look at EPS trends over the past quarters confirms this view. There are clearly some challenges for Dominion Energy, but this is nothing the company should have an issue with in regards to making it to the other side.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/10/saupload_89eb9225474076643a215ff4262f5338.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">This is simply not the trend you'd associate with a company that is failing, but it is appropriate for a company facing valuation compression due to high-interest rates and a transitioning business model, for example.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2023/4/9/11203311-16810876582196176_origin.png\" rel=\"lightbox\" data-width=\"873\" data-height=\"437\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/9/11203311-16810876582196176.png\" alt=\"Dominion energy has been delivering to EPS expectations for some time\" contenteditable=\"false\" loading=\"lazy\"></a></span> </picture><figcaption><p class=\"item-caption\"><span>Seeking Alpha</span></p></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">The Rate Problem</h2> <p class=\"paywall-full-content invisible\">High-interest rates pose multiple problems for the Dominion Energy business model. Dividend stocks and utility stocks like Dominion Energy are often seen as substitutes to bonds that provide risk-free income. As interest rates rise, the yield on bonds begins to compete with that of dividend stocks. For many investors buying a stock that can fluctuate very quickly, as Dominion shareholders have seen in the past few months, isn't worth the additional risk. This will cause some investors to shift cash into the safety of bonds locking in yields at these high levels rather than dividends. It is likely that this dynamic is at play and is partially to blame for the recent stock price.</p> <p class=\"paywall-full-content invisible\">Dominion also tends to carry a notable amount of debt.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/10/saupload_b30b73ddafe76327c0e8c30a9f619df4.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">High-interest rates obviously increase the overall cost of borrowing for companies like Dominion. As we discussed earlier, the company is in the middle of a green energy transition that will likely take years and using expensive cash to fund these projects becomes relatively more challenging. There is also inflation. The reason the Fed has been raising interest rates is because they want to lower the overall growth in the cost of consumer purchases. Energy costs spiraling were a big part of the inflation problem. High energy costs in North America have for some time been a political nonstarter for many firms. It seems as though whenever some imbalance in market conditions causes energy prices to spike, political parties become unified in a bid to protect the American household. We often see this sort of behavior manifest in the form of government controls that are particularly unwelcome for utility companies.</p> <p class=\"paywall-full-content invisible\">My expectation is that the Federal Reserve will slow down or pause on interest rate hikes over the next few months. It is likely that rates will remain elevated throughout the end of calendar year 2023. Despite the Fed's guidance about not seeing a rate cut this calendar year as their base case, my expectation is that we should begin to see rates come down towards the end of the year. This is based on the fact that inflation is coming down substantially, at least for the time being. Despite tensions with China, the country is open for business, and the fact is that high unemployment rates caused by a Federal Reserve overshooting would create a bigger problem than inflation. However, it is difficult to predict what the Federal Reserve will do given the increasingly adversarial relationship with China and the US opening the space for the early steps of the BRICK secondary economy. For the time being, it appears that concerns that this secondary economy will severely damage the United States' ability to provide economic stability for its nationals seem to be overblown. There are simply too many variables to consider at this time.</p> <h2 class=\"paywall-full-content invisible\">Dividend and Forward-Looking Commentary</h2> <p class=\"paywall-full-content invisible\">In terms of growth, leadership has pointed to an increase in the number of data centers in its market. This is the most exciting growth prospect out there, but as I mentioned earlier, utility companies aren't meant to be exciting. While investors will likely wait for the outcome of the business review to form any concrete opinions of the company, I believe the stock is fairly priced.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/10/saupload_3f76023a79bbb1a34a0ec52f437210ff.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">The company is trading reasonably low with respect to its revenue multiples. It currently holds a forward P/E ratio of 14.8, which isn't exactly cheap for utility companies. One also has to remember that as a dividend stock, it is in the middle of a transition, as we mentioned earlier. We may see cheaper prices in the short term, but no one should be ashamed of buying at this level. Speaking of dividends, the stock currently offers a healthy 4.6% yield. It is possible that the dividend may be revised given the outcome of this business review. It would be understandable at this point, with so many moving parts and the increased cost of capital.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/4/10/saupload_2b84b215740d7da62f20ae734d5307bf.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">The Risks</h2> <p class=\"paywall-full-content invisible\">As we mentioned earlier, the company is not without significant risks despite the massive selloff. The company is navigating a very tricky transition with a fairly new CEO following the tragic loss of its former CEO, Thomas Farrell. We have seen that transitions like this can have a much longer lead time than previously expected, as Splunk shareholders will be the first to tell you. In the long term, the transition to cleaner options helps the company hedge the legislative risk that would likely come at some point with respect to renewable energy.</p> <p class=\"paywall-full-content invisible\">Shareholders will most likely be concerned about the dividend, however. It would seem as though the risk of dividend cuts will remain relatively high in the near term, but I am confident that the company will return to performing on the other side of this transition.</p> <p class=\"paywall-full-content invisible\">The last major risk has to do with the Federal Reserve. As things stand, inflation is coming down steadily, and if this trend were to reverse or become more stubborn than anticipated, then the Federal Reserve would likely respond by raising interest rates higher and longer than expected, which would be particularly damaging to dividend stocks like Dominion Energy.</p> <h2 class=\"paywall-full-content invisible\">The Takeaway</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">This really isn't a very complex opportunity. We have one of the stalwarts of the American energy industry that has been brought down to buyable levels due to an energy transition and high interest rates. We can see very clear conditions for stock appreciation in the future when rates normalize, and the company makes more progress on its renewable energy push. The valuation isn't exactly a bargain but solid companies rarely are. It is perhaps prudent to wait for the outcome of the business review, but I am adding to my position now. I rate Dominion Energy as a long-term buy.</p>", "twitContent": "$D - Dominion Energy: Navigating A Tricky Transition To Cleaner Energy Sources. https://seekingalpha.com/article/4593264-dominion-energy-a-tricky-transition-to-cleaner-energy-sources?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "70415", "type": "author"}}, "sentiments": {"data": [{"id": "448947", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "164555", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4593264-dominion-energy-a-tricky-transition-to-cleaner-energy-sources", "canonical": "https://seekingalpha.com/article/4593264-dominion-energy-a-tricky-transition-to-cleaner-energy-sources", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1417180248/image_1417180248.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "70415", "type": "author", "attributes": {"company": null, "slug": "incomebent-investments", "userId": 11203311, "tagId": 164555, "bio": "I provide easy-to-digest insights on stocks and bonds. I am obsessed with growth stocks and cyclical plays, but I also provide analysis on Value opportunities where appropriate. I employ industry and fundamental analysis to give a clear picture of the opportunity over a reasonable timeframe.<br> <br><p></p>- MBA and over a decade as an investor and investment author. <br> <br><p></p>- My content is not geared to anyone's specific investment goals, time horizons, or risk tolerance. Content is for illustrative purposes only and is not intended to displace advice from a fee-based financial adviser. It is not to be taken as investment advice, or influence investor decision making. Accuracy of data is not guaranteed.<br>", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/011/203/311/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/011/203/311/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/011/203/311/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/011/203/311/extra_large_pic.png"}, "nick": "IncomeBent Investments", "deactivated": null, "memberSince": 2013, "isRss": false, "contributorSince": 2014, "followersCount": 1193}, "relationships": {"user": {"data": {"id": "11203311", "type": "user"}}, "userBioTags": {"data": [{"id": "547376", "type": "userBioTag"}, {"id": "547386", "type": "userBioTag"}, {"id": "547396", "type": "userBioTag"}, {"id": "547406", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/incomebent-investments", "profileUrl": "/author/incomebent-investments", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "55", "type": "sector"}}}, "links": {"self": "/symbol/D"}}, {"id": "164555", "type": "tag", "attributes": {"slug": "incomebent-investments", "name": "IncomeBent Investments", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/incomebent-investments"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "448947", "type": "sentiment", "attributes": {"articleId": 4593264, "type": "bullish", "createdAt": "2023-04-10T15:56:13.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4593264", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}