{"data": {"id": "4610939", "type": "fullArticle", "attributes": {"publishOn": "2023-06-12T11:00:35-04:00", "isLockedPro": false, "commentCount": 93, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"george-fisher": {"id": 49521, "slug": "george-fisher", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "quick-picks-lists": {"id": 692842, "slug": "quick-picks-lists", "kind": "breadcrumb", "path": "/stock-ideas/quick-picks", "title": "Quick Picks & Lists", "sasource": "theme_breadcrumb"}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "utilities": {"id": 55, "slug": "utilities", "kind": "sector", "path": "/stock-ideas/utilities", "title": "Utilities ", "sasource": "theme_breadcrumb"}}, "title": "Dominion Energy: Too Much Management Uncertainty", "summary": ["Dominion Energy is undergoing another strategic review, with potential asset sales and realignment of capital investments expected.", "The company's $10 billion bet on offshore wind development seems expensive and risky.", "I rate Dominion Energy as a Hold, but lean towards a Sell recommendation, preferring Southern Company and Emera."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-06-12T11:00:35-04:00", "isModerated": false, "closestTradingDate": "2023-06-12", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 20, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have a beneficial long position in the shares of D, BRK.B, EMRAF, SO, SWX either through stock ownership, options, or other derivatives.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-w750\" alt=\"Amazon Plans To Use 100% Renewable Energy By 2030\" data-id=\"1242600776\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Drew Angerer/Getty Images News</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Dominion Energy (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>) has offered investors a fascinating ride as the company seems to continue searching for its mission. I have owned D for well over 9 years, first through ownership of its short-lived Cove Point<span class=\"paywall-full-content invisible\"> LNG public offering (Dominion Midstream) in 2014, then by its acquisition of South Carolina’s SCANA Corp in 2018, and finally through buying and selling its common shares. The latest admission by management that it is still seeking a profitable purpose should be relatively concerning for long-term investors.</span></p> <p class=\"paywall-full-content invisible\">Dominion Energy is one of the largest regulated utilities in the US. According to their website, D provides state-regulated electricity and natural gas service to about 7 million customers in 8 states. In addition, D operates electricity generating facilities (28,600 mw capacity) using a combination of “all of the above” fuel sources and includes the country’s 2<sup>nd</sup> largest solar portfolio. D owns a partial interest in an LNG facility in MD, Cove Point. Dominion Energy Wexpro develops and produces natural gas reserves, with ventures in Wyoming, Colorado, and Utah. The graphic below, from D's 4<sup>th</sup> quarter <a href=\"https://s2.q4cdn.com/510812146/files/doc_presentations/2023/2023-02-08-DE-IR-4Q-2022-earnings-call-slides-vTC-Final.pdf\" rel=\"nofollow\">investors presentation</a>, outlines the states of regulated operation:</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <span><a href=\"https://static.seekingalpha.com/uploads/2023/6/11/4623221-16865191504257166_origin.png\" rel=\"lightbox\" data-width=\"1152\" data-height=\"413\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/6/11/4623221-16865191504257166.png\" alt=\"States of Operations\" contenteditable=\"false\" loading=\"lazy\"></a></span> </picture><figcaption><p class=\"item-caption\">Profile of States of Operations <span>(investors.dominionenergy.com)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">From this graphic and adding the number of customers in each state found in various Dominion Energy filings and presentations, the following table can be developed to further analyze D’s current regulated business profile. The table lists the state, the number of regulated customers by service type, the rating of each state’s regulatory support by S&amp;P’s Regulatory Research Associates (1-1 is Most Supportive, 2-2 is Average, and 3-3 is Least Supportive. Note: I prefer state’s oversight to be rated as Above Average 1-1, 1-2, 1-3, and 2-1), and the total number of customers by percentage.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture> <img src=\"https://static.seekingalpha.com/uploads/2023/6/11/4623221-16865191513805628.png\" alt=\"customers, rra rating by state\" contenteditable=\"false\" loading=\"lazy\"> </picture><figcaption><p class=\"item-caption\">Customers, RRA Ratings by State <span>(GMI, dominionenergy.com)</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Interestingly, by customer count, Dominion Energy services about equal number of electric (57%) and natural gas (43%) customers. In addition, 49% of customers are in preferred states rated 1-3 (NC) and 2-1 (VA) and 17% are in states with Average (UT, WY, ID) and 34% are in states with Below Average (OH, SC) rating for regulatory oversight. Contracted Assets from the graphic above represents the Cove Point LNG facility and long-term contracted solar and wind generating facilities.</p> <p class=\"paywall-full-content invisible\">A few years ago, Dominion Energy made a financial commitment to become a major player in the East Coast offshore wind business. D is in the process of developing both an offshore wind farm off the coast of Virginia and has contracted to build a $500 million specialized ship used in the construction of offshore wind assets. When fully constructed 27 miles off Virginia Beach in 2026, D’s Coastal Virginia Offshore Wind will provide sufficient electricity to power 660,000 homes.</p> <p class=\"paywall-full-content invisible\">At one point, management seemed to be moving in the direction of being a multiple utility and energy midstream conglomerate. Dominion purchased Questar Natural Gas in 2016 for $4.4 billion, creating a powerhouse natural gas company with FERC-regulated natural gas transmission, the largest FERC-regulated natural gas storage network in the country, LDC businesses in western states, the only Mid-Atlantic LNG export facility, and natural gas E&amp;P company. Midstream assets figure heavily into the Questar deal. This is in addition to its extensive electric utility footprint offering power generation, transmission, and distribution along the eastern seaboard.</p> <p class=\"paywall-full-content invisible\">Then, the “strategic” reviews and flipping of assets began. Dominion Midstream partnership units were bought back, returning Cove Point LNG terminal fully to D, where a 50% interest has subsequently been sold. Much of the Questar and Dominion owned FERC-regulated pipelines have been sold to Berkshire Hathaway (<a href=\"https://seekingalpha.com/symbol/BRK.B\" title=\"Berkshire Hathaway Inc.\">BRK.B</a>) (<a href=\"https://seekingalpha.com/symbol/BRK.A\" title=\"Berkshire Hathaway Inc.\">BRK.A</a>), and when Mr. Buffett had purchased his fill (BRK.B owns 18% of the total capacity of FERC-regulated gas pipelines in the US and <a href=\"https://www.reuters.com/business/energy/dominion-energy-berkshire-terminate-questar-pipelines-deal-2021-07-12/\" rel=\"nofollow\">reportedly</a> Mr. Buffett was concerned with government approval of more), D turned to Southwest Gas (<a href=\"https://seekingalpha.com/symbol/SWX\" title=\"Southwest Gas Holdings, Inc.\">SWX</a>) to finish the disposal of Questar assets. Management’s previous strategic review resulted in the disposal of all FERC-regulated assets.</p> <p class=\"paywall-full-content invisible\">As an investor who appreciates the benefits and stability of the higher allowed ROE historically offered by the FERC over state-regulated assets, the midstream asset disposal reduced Dominion’s investment attractiveness.</p> <p class=\"paywall-full-content invisible\">And the company is at it again.</p> <p class=\"paywall-full-content invisible\">In September 2022, management <a href=\"https://s2.q4cdn.com/510812146/files/doc_presentations/2022/09/2022-09-06-DE-IR-investor-meetings-vTC.pdf\" rel=\"nofollow\">announced</a> a very aggressive 2022-2026 5-yr capital investment plan of $37 billion, including $10 billion for offshore wind development, and an additional $36 billion in capital expenditures 2027-2035. But in November 2022, management announced another total company strategic review of its businesses. I agree that times change, and situations change, and business directions need to respond and change as well. However, it seems Dominion is more akin to a sailboat participating in the current around the world Ocean Sailing Race losing a rudder and finding themselves adrift. Due for completion by a 3<sup>rd</sup> quarter 2023 investor presentation, the “new business plan” is almost guaranteed to involve some level of asset sales and realignment of billions in capital investments.</p> <p class=\"paywall-full-content invisible\">It seems management is looking for buyers of several asset groups, starting with finding an offshore wind partner and its regulated natural gas LDC distribution business, followed by its 50% interest in Cove Point. However, buyer interest seems weak at the moment, especially when other utilities, such as New England-based Eversource (<a href=\"https://seekingalpha.com/symbol/ES\" title=\"Eversource Energy\">ES</a>), are also looking for partners to contribute capital for offshore wind development. Gas LDC businesses are also not a hot commodity, especially with the current political assault on their existence.</p> <p class=\"paywall-full-content invisible\">Currently, what Dominion Energy will look like in 2024 and beyond is impossible to tell. I find some of the matrix of D intriguing, such as the high percentage of utility customers in beneficial regulatory environments and an extensive on-land solar generating portfolio with “all of the above” fuel diversity exposure. However, I think offshore wind will become an albatross for utilities, and D’s $10 billion bet seems a bit expensive and risky.</p> <p class=\"paywall-full-content invisible\">I started selling down my position in early 2019, taking advantage of rallies between the high-$70s and high-$80s, with my last sale in late 2020. The remaining shares are what I consider a low-average position value, and I am giving serious consideration to exiting the position. It is difficult to recommend an investment stance with the uncertainty of what investors will own post September 2023. Which assets are being retained, which are being sold, what is the long-term earnings potential, and what will the balance sheet look like? Investors do not know the answers and it becomes difficult, at best, to place a current valuation of Dominion Energy shares - or even to determine how \"safe\" the dividend is. It seems Morningstar has lowered Dominion’s growth prospects to 5%, or below sector average of 6% to 9%.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">I rate it as a Hold but am leaning on a Sell recommendation. Personally, I prefer Southern Company (<a href=\"https://seekingalpha.com/symbol/SO\" title=\"The Southern Company\">SO</a>) and beaten-down Emera (<a href=\"https://seekingalpha.com/symbol/EMRAF\" title=\"Emera Incorporated\">OTCPK:EMRAF</a>), but the entire US political climate towards energy, combined with a ballooning utility cost/rate structure, is giving me pause on the sector.</p>", "twitContent": "$D - Dominion Energy: Too Much Management Uncertainty. https://seekingalpha.com/article/4610939-dominion-energy-too-much-uncertainty?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "35111", "type": "author"}}, "sentiments": {"data": [{"id": "462789", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "49521", "type": "tag"}, {"id": "692842", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4610939-dominion-energy-too-much-uncertainty", "canonical": "https://seekingalpha.com/article/4610939-dominion-energy-too-much-uncertainty", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1242600776/image_1242600776.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "35111", "type": "author", "attributes": {"company": null, "slug": "george-fisher", "userId": 4623221, "tagId": 49521, "bio": "<p>I am the author of Guiding Mast Investments monthly newsletter, focused on timely dividend paying stocks. Our mission at Guiding Mast Investments is to help investors keep a steady pace of wealth accumulation as they navigate through their financial voyage.  I have been a Registered Investment Advisor, financial author, and entrepreneur. I bring a variety of expertise to my clients, from personal investment planning and management to stock market analysis skills. I am the creator of the late 1990s investment newsletter Power Investing with DRIPs focused on timely selections of dividend paying stocks. I have also published two books through McGraw Hill, All About DRIPs and DSPs (2001), and The StreetSmart Guide to Overlooked Stocks (2002). My work experience covers a variety of fields.Prior to being a RIA, I spent 15 years as a corporate manager at Georgia-Pacific Corp before venturing out on my own, operating several businesses from manufacturing to export marketing management. President Ronald Reagan appointed me to the National Advisory Council overseeing the Small Business Administration from 1988 to 1991. </p><p><br></p><p>Now comes the obligatory disclaimers: The opinions and any recommendations expressed in this commentary are those of the author . None of the information or opinions expressed in this article constitutes a solicitation for the purchase or sale of any security or other instrument. Nothing in this commentary constitutes investment advice and any recommendations that may be contained herein have not been based upon a consideration of the investment objectives, financial situation or particular needs of any specific recipient. Any purchase or sale activity in any securities or other instrument should be based upon your own analysis and conclusions. Past performance is not indicative of future results. The information contained in this report does not purport to be a complete description of the securities market, or developments referred to in this material. The information has been obtained from sources considered to be reliable, but we do not guarantee that the foregoing material is accurate or complete. Any information is not a complete summary or statement of all available data necessary for making an investment decision and does not constitute a recommendation. Expressions of opinion are as of this date and subject to change without notice. Either Mr. Fisher or his employer, if any, may hold or control long or short positions in the securities or instruments mentioned.</p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/004/623/221/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/004/623/221/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/004/623/221/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/004/623/221/extra_large_pic.png"}, "nick": "George Fisher", "deactivated": null, "memberSince": 2012, "isRss": false, "contributorSince": 2012, "followersCount": 5602}, "relationships": {"user": {"data": {"id": "4623221", "type": "user"}}, "userBioTags": {"data": [{"id": "633166", "type": "userBioTag"}, {"id": "633176", "type": "userBioTag"}, {"id": "633196", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/george-fisher", "profileUrl": "/author/george-fisher", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "55", "type": "sector"}}}, "links": {"self": "/symbol/D"}}, {"id": "49521", "type": "tag", "attributes": {"slug": "george-fisher", "name": "George Fisher", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/george-fisher"}}, {"id": "692842", "type": "tag", "attributes": {"slug": "quick-picks-lists", "name": "Quick Picks & Lists", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=quick-picks-lists"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "462789", "type": "sentiment", "attributes": {"articleId": 4610939, "type": "neutral", "createdAt": "2023-06-12T11:00:35.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4610939", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}