{"data": {"id": "4616502", "type": "fullArticle", "attributes": {"publishOn": "2023-07-12T04:00:57-04:00", "isLockedPro": false, "commentCount": 23, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"daniel-jones": {"id": 163495, "slug": "daniel-jones", "kind": "common", "non_theme": true}, "m-n-a": {"id": 532656, "slug": "m-n-a", "kind": "common", "non_theme": true}, "brk.a": {"id": 4721, "slug": "brk.a", "kind": "common", "non_theme": true}, "brk.b": {"id": 6699, "slug": "brk.b", "kind": "common", "non_theme": true}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "tier-1": {"id": 603709, "slug": "tier-1", "kind": "general"}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "financials": {"id": 40, "slug": "financials", "kind": "sector", "path": "/stock-ideas/financial", "title": "Financials ", "sasource": "theme_breadcrumb"}}, "title": "Warren Buffett's Berkshire Hathaway Snags Another Chunk Of Dominion Energy", "summary": ["Berkshire Hathaway is purchasing a 50% stake in Cove Point LNG, LP from Dominion Energy for $3.5 billion, providing debt relief for Dominion and a promising asset for Berkshire Hathaway.", "Dominion will use the proceeds from the sale to reduce its debt, including a $2.3 billion term loan tied to the Cove Point assets and $1 billion of undisclosed debt.", "This is not the first time Berkshire Hathaway has acquired assets from Dominion; in 2020, it purchased Dominion's Gas Transmission and Storage operations for $9.7 billion.", "In all, this is a good move for both parties involved."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-07-12T04:00:57-04:00", "isModerated": false, "closestTradingDate": "2023-07-12", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 26, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-w750\" alt='Fortune\"s Most Powerful Women Summit - Day 2' data-id=\"492444164\" data-type=\"getty-image\" width=\"3000px\" height=\"2000px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Paul Morigi</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>July 10th proved to be a big day, both for shareholders of utilities giant <strong>Dominion Energy</strong> (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>) and for shareholders of <strong>Berkshire Hathaway</strong> (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BRK.A\" title=\"Berkshire Hathaway Inc.\">BRK.A</a></span>) (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/BRK.B\" title=\"Berkshire Hathaway Inc.\">BRK.B</a></span>). This is because news broke<span class=\"paywall-full-content invisible\"> that the two parties </span><a href=\"https://news.dominionenergy.com/2023-07-10-Dominion-Energy-Announces-Sale-of-Remaining-Interest-in-Cove-Point\" rel=\"nofollow\" class=\"paywall-full-content invisible\">agreed</a><span class=\"paywall-full-content invisible\"> that Berkshire Hathaway would buy a sizable chunk of assets from Dominion in a multibillion dollar transaction that should see both sides benefit. The way I see it, this maneuver, while small for Berkshire Hathaway, is promising for both enterprises. In the near term, it provides debt relief and a reduction in interest expense for Dominion as it continues its operational restructuring activities. And for Berkshire Hathaway, it provides an attractive asset that should fare quite well in the years to come.</span></p> <h2 class=\"paywall-full-content invisible\">An interesting deal</h2> <p class=\"paywall-full-content invisible\">According to the press release issued by Dominion, the company agreed to sell its remaining non-controlling interest in Cove Point LNG, LP to Berkshire Hathaway Energy, a subsidiary of Berkshire Hathaway, in a deal valuing the ownership interest at $3.5 billion. The ownership interest in question amounts to a 50% stake in the enterprise. For those who don't know, the Cove Point LNG Facility is an LNG export facility based out of Lusby, Maryland. In fact, it was actually the first such facility located on the eastern coast of the country. The terminal in question has a storage capacity of about 14.6 billion cubic feet and it is capable of processing 1.8 billion cubic feet of product per day. Using its own pipeline, the terminal connects to some of the major gas transmission systems in the region.</p> <p class=\"paywall-full-content invisible\">Cove Point was originally constructed with the goal in mind of replacing coal burning power plants in a bid for the country to move toward cleaner and healthier fuels. In the long run, there does seem to be significant room for growth for the facility. At present, its operations take up only about 131 acres of land on the coast. But the facility itself owns approximately 1,000 acres. So theoretically, the sky is the limit. The most recent data available shows that the 50% ownership interest owned by Dominion sat on the company's books at an equity value of approximately $2.7 billion.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/7/11/9866571-16890625969252982_origin.png\" rel=\"lightbox\" data-width=\"1884\" data-height=\"1074\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/7/11/9866571-16890625969252982.png\" alt=\"Deal\" width=\"640\" height=\"365\" contenteditable=\"false\" data-width=\"640\" data-height=\"365\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Dominion Energy</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Strictly speaking, Dominion is not going to receive proceeds amounting to $3.5 billion. The actual amount received will be $3.3 billion, which will be both the gross amount received and the after-tax amount. The other $200 million of consideration will come in the form of the termination of related interest rate derivatives that the company has been responsible for. Over the past few years, the Cove Point equity interest has generated some attractive returns for Dominion. In 2020, for instance, the company received $70 million worth of distributions from its ownership stake. This number shot up to $300 million in 2021 before climbing further to $344 million in 2022. During the first quarter of 2023, the company received $83 million worth of distributions. That's up from the $76 million generated the same time one year earlier.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/7/11/9866571-16890626102010996_origin.png\" rel=\"lightbox\" data-width=\"1912\" data-height=\"910\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/7/11/9866571-16890626102010996.png\" alt=\"Financials\" width=\"640\" height=\"305\" contenteditable=\"false\" data-width=\"640\" data-height=\"305\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Author - SEC EDGAR Data</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">According to the management team at Dominion, the estimated EBITDA generated by Cove Point will come out to $325 million per year by 2025. That implies an EV to EBITDA multiple on the transaction of 10.8. Considering that the current EV to EBITDA multiple that Dominion is trading for is about 10.9, this does not seem to be a bad deal. But it's not exactly great either. When you dig deeper though, you start to understand some of the rationale behind the transaction. Management has stated that they plan to use essentially all of the proceeds toward debt reduction. $2.3 billion worth of the proceeds will be used toward paying down a term loan that was tied to the Cove Point assets. And the remaining $1 billion will be used on other debt that management has not disclosed. Based on a review of the historical financial data provided by the company, I would say that this would likely be the unsecured senior debt that the company has coming due this year that has a value of $1 billion tied to it.</p> <p class=\"paywall-full-content invisible\">Dominion as it stands today is a cash cow. In 2022, the company <a href=\"https://www.sec.gov/edgar/browse/?CIK=715957&amp;owner=exclude\" rel=\"nofollow\">generated</a> $3.70 billion worth of operating cash flow. But if we adjust for changes in working capital, that number shoots up to $7.04 billion. Even so, the company has had a bit of an issue when it comes to interest expense. Interest expenses and related charges during the first quarter of the year totaled $586 million. That's up from the $174 million reported one year earlier. Most of this increase was driven by issues unrelated to interest expense. But the company's overall interest expense did rise by 22% year over year. This is largely attributable to the variable nature of some of its debts. The $2.3 billion term loan that the company is planning to pay off, for instance, saw its interest expense grow from 5.71% in 2022 to 6.11% in the most recent quarter. And for the other $1 billion of debt that I believe the company will pay off with the proceeds from the sale saw its interest rate grow from 5.30% to 5.40%. In all, the company will receive pre-tax savings of $194.5 million as a result of its debt reduction initiatives. If we assume a 21% tax rate for the enterprise as a whole, the operating cash flow from the assets that it decided to sell should be about $171.3 million. That's a multiple of about 20.4 on a price to operating cash flow basis.</p> <p class=\"paywall-full-content invisible\">Selling off the Cove Point assets should not exactly be a surprise for investors. For years now, management has been working to divest the company of its non-core assets. And when it comes to the equity method investments on its books, Cove Point was the big whale remaining. The entire cost of the facility it's about $4.1 billion. And yet, since the export project was placed in service in 2018, cumulative sale proceeds should be about $7.2 billion. This is on top of $1.7 billion of dividends that the company has received from the asset.</p> <p class=\"paywall-full-content invisible\">Of course, Dominion is not the only party that's going to benefit from this transaction. According to the company, the assets in question were sold off through a competitive bidding process. However, Berkshire Hathaway Energy was most certainly the most logical choice for a suitor. In addition to owning a 25% interest in Cove Point already, Berkshire Hathaway Energy also had a 100% ownership in the general partner of the enterprise and controlled its daily operations. In fact, the nature of this relationship resulted in the company consolidating Cove Point in its financial statements prior to this point.</p> <p class=\"paywall-full-content invisible\">It's important to distinguish between Berkshire Hathaway and Berkshire Hathaway Energy. The former is the industrial conglomerate controlled by billionaire investor Warren Buffett. The latter is a global energy company with a <a href=\"https://www.sec.gov/edgar/browse/?CIK=1067983&amp;owner=exclude\" rel=\"nofollow\">focus</a> that is largely on utility operations in the US. In fact, as of the end of the most recent fiscal year, the energy company served about 5.2 million retail customers and it operated five Interstate natural gas pipeline companies with a combined 21,200 miles of pipeline that are capable of collectively transporting 21 billion cubic feet of natural gas per day. Other assets are also mixed into this. In all, Berkshire Hathaway owns a 92% stake in Berkshire Hathaway Energy.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/7/11/9866571-1689062656100851_origin.png\" rel=\"lightbox\" data-width=\"2076\" data-height=\"912\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/7/11/9866571-1689062656100851.png\" alt=\"Financials\" width=\"640\" height=\"281\" contenteditable=\"false\" data-width=\"640\" data-height=\"281\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Author - SEC EDGAR Data</span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">All combined, Berkshire Hathaway Energy was responsible for $26.39 billion worth of revenue in 2022. That's up from $21.10 billion in 2020. And for Berkshire Hathaway specifically, it generated net profits of $3.90 billion. That compares to the $3.14 billion reported two years earlier. Even though bottom line results have experienced a bit of pain during the first quarter of this year compared to the same time last year, revenue continued to grow, expanding from $6.02 billion to $6.45 billion. This makes it a rather sizable chunk of the industrial conglomerate and continued growth by means of acquisition should not be shocking.</p> <p class=\"paywall-full-content invisible\">It should be pointed out that this is not the first time that Berkshire Hathaway has gone after assets owned by Dominion. Back in July of 2020, I wrote an <a href=\"https://seekingalpha.com/article/4357241-warren-buffetts-berkshire-hathaway-makes-big-play-for-dominion-energys-assets\">article</a> discussing how the industrial conglomerate purchased the Gas Transmission and Storage operations of Dominion in a deal valued at $9.7 billion. $5.7 billion of that consideration was in the form of debt being transferred over from Dominion to Berkshire Hathaway, with the remaining $4 billion coming in the form of cash. At that time, the only assets not included from those operations was the ownership interest in Cove Point and Dominion’s investments in RNG (Renewable Natural Gas).</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/7/11/9866571-16890627057879136_origin.png\" rel=\"lightbox\" data-width=\"1364\" data-height=\"1088\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/7/11/9866571-16890627057879136.png\" alt=\"LNG\" width=\"640\" height=\"510\" contenteditable=\"false\" data-width=\"640\" data-height=\"510\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Kinder Morgan </span></p></figcaption></figure></p> <p class=\"paywall-full-content invisible\">It makes a great deal of sense to me for Berkshire Hathaway to pick up the Cove Point assets at this time. According to pipeline operator <strong>Kinder Morgan</strong> (<a href=\"https://seekingalpha.com/symbol/KMI\" title=\"Kinder Morgan, Inc.\">KMI</a>), the <a href=\"https://s24.q4cdn.com/126708163/files/doc_presentations/2023/May/05/2q-2023-kmi-investor-presentation_v5.pdf\" rel=\"nofollow\">global market opportunity</a> for LNG is going to be massive over the next several years. Combined, the US and the Middle East account for roughly 75% of all LNG supply growth that should be experienced across the globe from 2021 through 2050. This growth, which will see us expand from roughly 44 billion cubic feet per day of consumption in 2021 to 63 billion cubic feet per day by 2050, will be fueled largely by robust import demand growth from Southeast Asia. It should also be noted that, while this growth implies 19 billion cubic feet per day of additional volume growth, it's likely that total new capacity needed will be around 25 billion cubic feet per day. This is because both Russia and North Africa are forecasted to experience declines that aggregate to roughly 6 billion cubic feet per day.</p> <p class=\"paywall-full-content invisible\">Between 2022 and 2030, it's estimated that annual spending on LNG will have to be about $281 billion. That number should remain elevated at $256 billion per annum between 2031 and 2050. Most of this will be in the form of production related spending. But it is estimated that, during this window of time, an estimated $2.3 trillion will have to be spent on infrastructure involving LNG. For those worried that the Middle East will be able to accomplish this work add a significant discount to what the US can achieve, I would say that concerns are overblown. At this time, US LNG exports are competitive on the global scale, with the industry capable of providing reliable and affordable gas at a cost of between $8 and $9 per MMBtu. And the great thing about a line of business that requires significant additional investment over an extended window of time is that the company is that already have the assets in question get tremendous pricing power that should help to fuel attractive returns for the time where demand is rising at a rapid pace.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2023/7/11/9866571-16890627197575798_origin.png\" rel=\"lightbox\" data-width=\"1060\" data-height=\"1060\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2023/7/11/9866571-16890627197575798.png\" alt=\"LNG\" width=\"640\" height=\"640\" contenteditable=\"false\" data-width=\"640\" data-height=\"640\" loading=\"lazy\"></a></span><figcaption><p class=\"item-caption\"><span>Kinder Morgan </span></p></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">Takeaway</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Based on all the data provided, I must say that I applaud this move. In many cases, I can point out a clear winner and a clear loser when it comes to a transaction. If I had to pick an absolute winner, I would say that it would probably be Berkshire Hathaway. After all, the continued growth in LNG demand over the next several years should prove bullish for any company that owns these types of assets. At the same time, however, Dominion is also making out just fine from the transaction. The company gets to reduce the debt on its books and it lowers its interest expense. After factoring in those interest savings, the implied multiple is quite lofty. So while the transaction may not seem to be fantastic from a valuation standpoint, it really is quite solid.</p>", "twitContent": "$BRK.A $BRK.B $D - Warren Buffett's Berkshire Hathaway Snags Another Chunk Of Dominion Energy. https://seekingalpha.com/article/4616502-warren-buffetts-berkshire-hathaway-snags-another-chunk-dominion-energy-buy?source=tweet ", "innerMarketing": "<p><a href=\"https://seekingalpha.com/checkout?slug=daniel-jones&amp;service_id=mp_1209\">Crude Value Insights</a> offers you an investing service and community focused on oil and natural gas. We focus on cash flow and the companies that generate it, leading to value and growth prospects with real potential.</p><p>Subscribers get to use a 50+ stock model account, in-depth cash flow analyses of E&amp;P firms, and live chat discussion of the sector.</p><p><strong>Sign up today for your <a href=\"https://seekingalpha.com/checkout?slug=daniel-jones&amp;service_id=mp_1209\">two-week free tria</a>l and get a new lease on oil &amp; gas!</strong></p>", "marketingBullet": "Looking for a helping hand in the market? Members of Crude Value Insights get exclusive ideas and guidance to navigate any climate.  <a href='/checkout?service_id=mp_1209&source=mp_marketing_text_top' sasource='mp_marketing_text_top'>Learn More »</a>", "isReit": false, "videoData": null, "marketingBulletVariant": "My name is Dan Jones. I have degrees in accounting and economics, and ran a registered investment advisor for nine years. I lead the investing group <a href=\"/checkout?service_id=mp_1209&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A9866571%7Csection_asset%3Aauthor_bullets%3A-crude-value-insights\" data-test-id=\"author-custom-template-link\">Crude Value Insights</a>.", "marketingBio": "Dan Jones has degrees in accounting and economics, and ran a registered investment advisor for nine years.\n\nI runs investment group <a href=\"/checkout?service_id=mp_1209&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A9866571%7Csection_asset%3Aauthor_bullets%3A-crude-value-insights\" data-test-id=\"author-custom-template-link\">Crude Value Insights</a>, which offers unique actionable insights on O&G companies. It focuses on what matters most, cash flow. <a href=\"/checkout?service_id=mp_1209&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A9866571%7Csection_asset%3Aauthor_bullets%3A-crude-value-insights\" data-test-id=\"author-custom-template-link\">Learn more.</a>\n<a href=\"/checkout?service_id=mp_1209&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A9866571%7Csection_asset%3Aauthor_root%3A-crude-value-insights\" data-test-id=\"author-custom-template-link\">Crude Value Insights</a>.\nprovides a regular deep dive into 36 publicly traded oil and gas exploration and production companies. This slice of the market is volatile, but very rewarding when approached in the right way. It most certainly is not, however, for the faint of heart. <a href=\"/checkout?service_id=mp_1209&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A9866571%7Csection_asset%3Aauthor_root%3A-crude-value-insights\" data-test-id=\"author-custom-template-link\">Learn more >></a>\n\nAfter graduating from Case Western Reserve University in 2013, I ran my own RIA for approximately 9 years before moving to manage my own assets. I have accumulated extensive experience researching various industries ranging from industrials, to banking, to oil, and more. I found myself particularly interested in the dynamics of the oil industry early on, turning that into my specialization for Crude Value Insights.", "audioDuration": null}, "relationships": {"author": {"data": {"id": "69675", "type": "author"}}, "sentiments": {"data": [{"id": "469707", "type": "sentiment"}, {"id": "469708", "type": "sentiment"}, {"id": "469709", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4721", "type": "tag"}, {"id": "6699", "type": "tag"}, {"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "163495", "type": "tag"}, {"id": "532656", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "603709", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4616502-warren-buffetts-berkshire-hathaway-snags-another-chunk-dominion-energy-buy", "canonical": "https://seekingalpha.com/article/4616502-warren-buffetts-berkshire-hathaway-snags-another-chunk-dominion-energy-buy", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/492444164/image_492444164.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "1209", "type": "authorResearch", "attributes": {"createdAt": "2017-09-22T10:49:22-04:00", "title": "Crude Value Insights", "rating": "0.0", "reviewCount": 0, "shortPitch": "Robust cash flow analyses of oil and gas companies", "categories": ["Energy", "Value"], "serviceAssistantIds": [], "inAppPurchasesAllowedInIos": false, "inAppPurchasesAllowedInAndroid": false, "activeSubscriptionsCount": 5, "androidIapPlan": "none", "iosIapPlan": "none", "description": "Crude Value Insights is an exclusive community of investors who have a taste for oil and natural gas firms. Our main interest is on cash flow and the value and growth prospects that generate the strongest potential for investors. You get access to a 50+ stock model account, in-depth cash flow analyses of E&P firms.", "landingPageColor": null, "adUnits": ["direct_access", "active_chat", "exclusive_idea", "monthly_portfolio", "access_all", "vibrant_community"], "tempData": {}, "price": 50.0, "wildcardText": "", "slug": "crude-value-insights", "annualPriceWithDiscount": 400.0, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": true}, "relationships": {"author": {"data": {"id": "69675", "type": "author"}}}}, {"id": "69675", "type": "author", "attributes": {"company": null, "slug": "daniel-jones", "userId": 9866571, "tagId": 163495, "bio": "<p>Daniel is an avid and active professional investor. </p>\r\nHe runs <a href=\"https://seekingalpha.com/checkout?service_id=mp_1209\">Crude Value Insights</a>, a value-oriented newsletter aimed at analyzing the cash flows and assessing the value of companies in the oil and gas space. His primary focus is on finding businesses that are trading at a significant discount to their intrinsic value by employing a combination of Benjamin Graham's investment philosophy and a contrarian approach to the market and the securities therein. <a href=\"https://seekingalpha.com/checkout?service_id=mp_1209\">Learn more</a>.", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/009/866/571/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/009/866/571/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/009/866/571/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/009/866/571/extra_large_pic.png"}, "nick": "Daniel Jones", "deactivated": null, "memberSince": 2013, "isRss": false, "contributorSince": 2014, "followersCount": 32970}, "relationships": {"user": {"data": {"id": "9866571", "type": "user"}}, "userBioTags": {"data": [{"id": "321535", "type": "userBioTag"}, {"id": "321545", "type": "userBioTag"}, {"id": "321555", "type": "userBioTag"}, {"id": "321565", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1209", "type": "authorResearch"}}}, "links": {"self": "/author/daniel-jones", "profileUrl": "/author/daniel-jones", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4721", "type": "tag", "attributes": {"slug": "brk.a", "name": "BRK.A", "company": "Berkshire Hathaway Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "40", "type": "sector"}}}, "links": {"self": "/symbol/BRK.A"}}, {"id": "6699", "type": "tag", "attributes": {"slug": "brk.b", "name": "BRK.B", "company": "Berkshire Hathaway Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/BRK.B"}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/D"}}, {"id": "163495", "type": "tag", "attributes": {"slug": "daniel-jones", "name": "Daniel Jones", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/daniel-jones"}}, {"id": "532656", "type": "tag", "attributes": {"slug": "m-n-a", "name": "M&A", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=m-n-a"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "603709", "type": "tag", "attributes": {"slug": "tier-1", "name": "Tier 1", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/tier-1"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "469707", "type": "sentiment", "attributes": {"articleId": 4616502, "type": "bullish", "createdAt": "2023-07-12T04:00:57.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4616502", "type": "article"}}, "tag": {"data": {"id": "4721", "type": "tag"}}}}, {"id": "469708", "type": "sentiment", "attributes": {"articleId": 4616502, "type": "bullish", "createdAt": "2023-07-12T04:00:57.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4616502", "type": "article"}}, "tag": {"data": {"id": "6699", "type": "tag"}}}}, {"id": "469709", "type": "sentiment", "attributes": {"articleId": 4616502, "type": "bullish", "createdAt": "2023-07-12T04:00:57.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4616502", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}