{"data": {"id": "4627923", "type": "fullArticle", "attributes": {"publishOn": "2023-08-13T07:24:44-04:00", "isLockedPro": false, "commentCount": 39, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"harrison-schwartz": {"id": 583904, "slug": "harrison-schwartz", "kind": "common", "non_theme": true}, "editors-picks": {"id": 1302, "slug": "editors-picks", "kind": "general", "path": "/editors-picks", "title": "Editors' Picks"}, "d": {"id": 165, "slug": "d", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "quality-multiplier": {"id": 606619, "slug": "quality-multiplier", "kind": "general"}, "inbound-seo-optimization": {"id": 608068, "slug": "inbound-seo-optimization", "kind": "general"}, "tier-1": {"id": 603709, "slug": "tier-1", "kind": "general"}, "more-tags": {"id": 698258, "slug": "more-tags", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "utilities": {"id": 55, "slug": "utilities", "kind": "sector", "path": "/stock-ideas/utilities", "title": "Utilities ", "sasource": "theme_breadcrumb"}}, "title": "Dominion Energy: Fairly Valued After Losing Its Valuation Premium", "summary": ["Dominion Energy's stock has lost over 40% of its value in the past year, raising concerns about its future potential.", "The company faces risks associated with its offshore wind project, including potential financing issues and cost overruns.", "Dominion's rates and profitability may be affected by political pressure and rising labor and materials costs in the utility sector.", "The utility giant has lost its valuation premium over the past year, now trading at a similar \"EV/EBITDA\" to the sector median.", "Dominion's valuation discount to its immediate peers is around 5 to 15%, giving it some upside if it can complete its controversial project without cost overruns."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2023-08-13T07:24:44-04:00", "isModerated": false, "closestTradingDate": "2023-08-14", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 17, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-w750\" alt=\"Offshore wind farm energy turbines at dawn. Surreal but natural sunrise at sea.\" data-id=\"844191430\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">Ian Dyball/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>In periods of increased uncertainty, many investors flock to utility stocks due to their typically resilient profit margins. For the most part, utility companies are guaranteed a profit because they can pass most costs, even <a href=\"https://www.utilitydive.com/news/make-or-buy-for-utilities-putting-services-and-capital-investments-on-a-le/527777/\" rel=\"nofollow\" class=\"paywall-full-content invisible\">some capital costs,</a><span class=\"paywall-full-content invisible\"> onto customers. Of course, the sharp rise in interest rates also creates issues for utilities, increasing capital costs and lowering the fair value of dividends. In most instances where a utility company loses significant value, poor managerial decisions are often the greatest culprit.</span></p> <p class=\"paywall-full-content invisible\">Years ago, PG&amp;E faced bankruptcy due to the company's failure to maintain safe <a href=\"https://seekingalpha.com/news/3995063-pge-scraps-tree-trimming-program-once-seen-as-key-to-fire-prevention-wsj\">systems, which started wildfires</a>. This year, utility investors are closely monitoring the Virginia power giant Dominion Energy (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/D\" title=\"Dominion Energy, Inc.\">D</a></span>). The stock has lost over 40% of its value over the past year, a staggering decline for a significant utility firm. I covered the company last January with a bearish outlook in \"Dominion Energy: Dividend Pressures Expected Amid High-Cost Projects.\" The stock <a href=\"https://seekingalpha.com/article/4570507-dominion-energy-stock-dividend-pressures-expected-amid-high-cost-projects\">has lost an 21%</a> of its value since then as investors lower their outlook due to costs associated with Dominion's offshore wind project. The performance gap between Dominion and the Utility sector has become very large recently. See below:</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/8/12/saupload_c871514dda057e707200beead41bd82c.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">Considering very few large utility companies suffer declines this large, many investors are curious about the firm's future potential. Such declines could theoretically indicate that the company's net equity value could fall underwater. The firm operates with relatively high leverage, so it would not necessarily take a huge loss to push it toward bankruptcy. That said, Dominion is also much cheaper than other utility stocks, offering a forward dividend yield of 5.6% compared to 3.2% for <a href=\"https://seekingalpha.com/symbol/XLU\">most utilities</a>. Its forward \"P/E\" <a href=\"https://seekingalpha.com/symbol/D/valuation/metrics\">valuation is</a> also 16% lower than the utility sector at 14.4X; however, its forward \"EV/EBITDA\" is nearly the same as the sector median at 11.5X.</p> <p class=\"paywall-full-content invisible\">Analysts expect a sharp EPS decline <a href=\"https://seekingalpha.com/symbol/D/earnings/estimates\">to $3.44 this year</a> but fully rebounding over the following years, so the stock is discounted if we assume that its struggle will be short-lived. Dominion is likely one of the most interesting stocks in the utility sector today because it offers discount potential rarely seen in the industry. That said, the company continues to face critical risks that could soon result in financing issues. Thus, a closer inspection of its status may aid investors in determining its risk and recovery potential.</p> <h2 class=\"paywall-full-content invisible\">Shareholder Value vs. Political Needs</h2> <p class=\"paywall-full-content invisible\">Utility companies have no choice but to engage in political trends because their ability to increase rates and many other business plans depends on legislative approval. Accordingly, they walk a fine line when engaging in political trends to improve the company's value, as this need certainly promotes <a href=\"https://www.investopedia.com/terms/a/agencyproblem.asp\" rel=\"nofollow\">agency risk factors</a>. Dominion is spending heavily on campaign contributions for many Virginia political candidates, most of whom are Democrats who are historically more supportive of its <a href=\"https://energyandpolicy.org/dominion-energy-loses-some-of-its-legislative-champions-in-virginia-primaries/\" rel=\"nofollow\">green energy projects. However, a large portion of the candidates supported</a> by Dominion lost in the primaries for the election later this year.</p> <p class=\"paywall-full-content invisible\">Virginia, a swing state, has shifted back toward the Republican party, with GOP governor <a href=\"https://www.washingtonpost.com/dc-md-va/2023/02/24/virginia-youngkin-dominion-energy-assembly/\" rel=\"nofollow\">Glenn Younkin looking to dramatically \"tighten the reigns\" on Dominion</a>, increasing the State Corporation Commission's capacity to review Dominion's rates. Importantly, they launched a proposal to specifically lower the company's return-on-equity target to 9.7% from 10.5%, paying excess profits back to customers; however, a more <a href=\"https://www.axios.com/local/richmond/2023/03/01/virginias-energy-politics-dominion-regulations\" rel=\"nofollow\">compromising bill was eventually passed</a>.</p> <p class=\"paywall-full-content invisible\">A significant catalyst for Dominion's political woes is its decision years ago to <a href=\"https://www.virginiamercury.com/2020/07/05/dominion-cancels-atlantic-coast-pipeline-announces-sale-of-natural-gas-transmission-and-storage-assets/#:~:text=In%20a%20sharp%20pivot%20away,to%20a%20Berkshire%20Hathaway%20affiliate.\" rel=\"nofollow\">halt a major natural gas Atlantic Coast Pipeline</a> project, instead pursuing a more expensive offshore wind project. This project will cost around $10B and is expected to be <a href=\"https://www.marinelink.com/news/dominion-sees-virginia-offshore-wind-farm-507013\" rel=\"nofollow\">completed by 2026, ideally producing</a> around 2.6 GW of power. If successful, the cost efficiency of this project should be considerably less per <a href=\"https://www.statista.com/statistics/654401/estimated-capital-cost-of-energy-generation-in-the-us-by-technology/#:~:text=As%20of%202021%2C%20capital%20costs,the%20most%20expensive%20to%20built.\" rel=\"noopener\">KW than nuclear but</a> about 3X <a href=\"https://www.statista.com/statistics/557322/installed-natural-gas-generator-construction-cost-in-the-us-by-type/\" rel=\"nofollow\">more than natural gas</a>. That said, the company threatened to cancel the project after the state asked for a <a href=\"https://www.utilitydive.com/news/dominion-offshore-wind-performance-standard/630397/#:~:text=Dominion%20Energy%20Virginia%20will%20abandon,rehearing%20request%20filed%20this%20week.\" rel=\"noopener\">42% efficiency performance guarantee</a>, which may cost more than expected; however, those costs <a href=\"https://richmond.com/news/state-and-regional/govt-and-politics/scc-backs-millions-in-rate-increases-for-dominions-offshore-wind-project/article_d0d3d113-bbad-5305-bf27-35e5a6421465.html\" rel=\"nofollow\">are mainly on customers</a>. Thus, the project is likely less efficient than a fossil fuel program (like the one it canceled); however, it is potentially cheaper than other green energy alternatives, particularly if the costs scale down if the project expands beyond its current scope.</p> <p class=\"paywall-full-content invisible\">The project is<a href=\"https://www.eenews.net/articles/biden-admin-advances-va-and-n-y-offshore-wind-projects/\" rel=\"nofollow\"> ultimately part of the Biden administration's long-term plan</a> to increase offshore wind production over the coming decade dramatically. Dominion also owns the first ship built specifically to install offshore wind farms, potentially creating a new revenue stream for the firm in the major east coast offshore wind program. <a href=\"https://fortune.com/2023/07/22/offshore-wind-projects-nixed-due-to-costs-despite-clean-energy-needs/\" rel=\"nofollow\">Problematically, numerous offshore wind projects</a> have been canceled over the past year due to skyrocketing labor and materials costs. While Dominion insists its own project is \"on time and budget,\" there is considerable risk that it will face higher charges and longer production than estimated<a href=\"https://www.bloomberg.com/news/articles/2023-07-22/biggest-offshore-wind-power-plans-in-crisis-iberdrola-orsted-vattenfall-hit\" rel=\"nofollow\"> due to inflation strains on related projects</a>. Of course, due to the controversy surrounding the project, I expect Dominion to avoid publically announcing potential project difficulties. While it has planned this project for some time, i<a href=\"https://seekingalpha.com/article/4624046-dominion-energy-inc-d-q2-2023-earnings-call-transcript\">t only invested $1.7B at the end of Q2, so</a> its construction is still in the early stages, giving it ample time for cost overruns.</p> <p class=\"paywall-full-content invisible\">Overall, this project will likely continue to play a critical role in Dominion's long-term success or failure. Given the potential for long-term growth and expansion of the offshore wind program, the company can justify the high associated costs. However, from a short-term perspective, the company, and its customers, would likely be better off if that money had been invested elsewhere. While the project certainly brings short-term political and financial risks, it could also create long-term profit opportunities, particularly if it can prove offshore wind is more viable than nuclear.</p> <p class=\"paywall-full-content invisible\">One other issue is the <a href=\"https://www.bayjournal.com/news/climate_change/whale-die-off-raises-stakes-in-virginia-offshore-wind-bid/article_ac9efa90-b23c-11ed-b342-6bd0441302a4.html\" rel=\"noopener noopener\">potential associated whale die-off with the project.</a> However, <a href=\"https://www.virginiamercury.com/2023/03/03/wind-and-whales-no-evidence-links-projects-to-deaths/\" rel=\"nofollow\">NOAA's review suggests</a> that the project is not likely to blame. Not unlike the economic efficiency of its project, the environmental benefit of it also remains in question. Still, the environmentalist consensus remains generally supportive of it.</p> <h2 class=\"paywall-full-content invisible\">What are Dominion's Financial Risks?</h2> <p class=\"paywall-full-content invisible\">The direct offshore wind project cost risk to Dominion is not huge. If the project costs over $1B more than expected, the company must<a href=\"https://www.virginiamercury.com/2022/12/15/regulators-approve-offshore-wind-settlement/#:~:text=The%20company%20will%20foot%20100,of%20both%20size%20and%20investment.\" rel=\"nofollow\"> make half or all of the costs</a> should it exceed $13.7B. Realistically, this gives Dominion a $1B to $5B potential liability associated with cost overruns. The company will also not be responsible should the project not produce nearly as much power as it should. However, the project controversy has increased GOP political pressure on the company. Should the party's majority continue to grow, Dominion could face more fantastic strains regarding its ability to <a href=\"https://www.theatlantic.com/ideas/archive/2023/06/plutocrat-vs-monopoly/674319/\" rel=\"nofollow\">self-manage its rates. Indeed, pressure on Dominion is</a> becoming bipartisan, with some Democrats looking to reduce its pricing power. Still, I do not believe this is a considerable risk factor for the firm because its operating margins and return on equity are close to that of its peer group. See below:</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/8/12/saupload_3fd999d55065a1965eb66c6783995d94.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">In all likelihood, Dominion's rates are not excessively high compared to other utility firms, so there is not much cause for a significant reduction in rates without a national reform on utility firms. Rising electricity prices may become a more critical political issue due to the sharp rate increase over the past three years, driven by a substantial cost increase. More recently, interest costs have also strained utilities; rising labor and materials costs are the primary issue. See below:</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2023/8/12/saupload_3eb60573a7f4dafc1772a43fd52d8920.png\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <p class=\"paywall-full-content invisible\">The increase in electricity prices has more to do with increasing labor and materials costs and the need to replace old infrastructure than with increased energy commodity prices. The company, and its peers, face exceptionally high pressure in the labor market due to a massive retirement <a href=\"https://www.utilitydive.com/spons/meet-the-utility-labor-shortage-challenge-through-a-true-training-culture/607311/#:~:text=Utilities%20will%20need%20to%20do,Department%20of%20Energy%20%28DOE%29.\" rel=\"nofollow\">wave among utility workers that is not being</a> replaced quickly enough. To a large extent, these increasing costs will be passed on to customers, allowing Dominion and its peers to maintain stable profit margins. However, in light of the rapid increase in electricity prices, I believe the political pressure on all utilities may grow, threatening a more significant decrease in their ability to guarantee profits. While the political tension in Virginia on Dominion exemplifies this trend, similar patterns are seen <a href=\"https://calmatters.org/newsletters/whatmatters/2023/03/california-utility-bills/\" rel=\"nofollow\">across most of the US today</a>.</p> <h2 class=\"paywall-full-content invisible\">The Bottom Line</h2> <p class=\"paywall-full-content invisible\">I believe Dominion is likely trading near or slightly below its fair value today, given its risk and reward potential. Based on current circumstances and the company's ability to lower its financial risks on its project, I do not believe Dominion faces excessively high risks associated with its current projects. The company's equity is leveraged by around 5X, so rising interest rates could hamper its profits. Further, any losses related to its management team's efforts could significantly negatively impact its equity. However, as long as the company finishes its project without significant cost overruns, I believe the risk is generally low today.</p> <p class=\"paywall-full-content invisible\">Dominion is trading at a slight discount to its immediate peer group based on an \"EV/EBITDA\" basis. The company's forward \"EV/EBITDA\" is ~11.5X, compared to a median amongst the large six US utilities of ~12.75X, with the <a href=\"https://seekingalpha.com/symbol/D/valuation/metrics\">utility sector median being 11.3X,</a> below Dominion's valuation. Based on sector statistics, Dominion's valuation is not lower than most; however, it is around 20-40% lower than its five-year average valuation based on most measures. Thus, Dominion's 40% decline is mainly attributable to a decrease in its valuation <em>premium</em>, meaning it is not necessarily discounted compared to peers today. While Dominion is trading at a slight discount to the largest utility companies, it also faces higher regulatory and financial risks than its peers.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">I believe this small discount reflects the <em>relatively</em> small risks facing Dominion today. Looking forward, I have a neutral outlook on the company and think it should continue to trade near its current price. Its management team has made questionable decisions that impaired its immediate value but <em><strong>potentially</strong> </em>improved its long-term value. Based on its performance since those decisions were made, I imagine Dominion's management will take a more conservative approach to avoid extending the stock's decline. By the end of 2023, the actual costs associated with its wind project will be much clearer, giving D some upside potential if it keeps costs and project timelines in check by then.</p>", "twitContent": "$D - Dominion Energy: Fairly Valued After Losing Its Valuation Premium. https://seekingalpha.com/article/4627923-dominion-energy-fairly-valued-after-losing-valuation-premium?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104609", "type": "author"}}, "sentiments": {"data": [{"id": "477729", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "165", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "583904", "type": "tag"}, {"id": "1302", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "606619", "type": "tag"}, {"id": "608068", "type": "tag"}, {"id": "603709", "type": "tag"}, {"id": "698258", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4627923-dominion-energy-fairly-valued-after-losing-valuation-premium", "canonical": "https://seekingalpha.com/article/4627923-dominion-energy-fairly-valued-after-losing-valuation-premium", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/844191430/image_844191430.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "104609", "type": "author", "attributes": {"company": null, "slug": "harrison-schwartz", "userId": 49544530, "tagId": 583904, "bio": "<p></p><p>Harrison is a financial analyst who has been writing on Seeking Alpha since 2018 and has closely followed the market for over a decade. He has professional experience in the private equity, real estate, and economic research industry. Harrison also has an academic background in financial econometrics, economic forecasting, and global monetary economics.</p><p></p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/049/544/530/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/049/544/530/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/049/544/530/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/049/544/530/extra_large_pic.png"}, "nick": "Harrison Schwartz", "deactivated": null, "memberSince": 2018, "isRss": false, "contributorSince": 2018, "followersCount": 16063}, "relationships": {"user": {"data": {"id": "49544530", "type": "user"}}, "userBioTags": {"data": [{"id": "945805", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/harrison-schwartz", "profileUrl": "/author/harrison-schwartz", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "165", "type": "tag", "attributes": {"slug": "d", "name": "D", "company": "Dominion Energy, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "55", "type": "sector"}}}, "links": {"self": "/symbol/D"}}, {"id": "583904", "type": "tag", "attributes": {"slug": "harrison-schwartz", "name": "Harrison Schwartz", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/harrison-schwartz"}}, {"id": "1302", "type": "tag", "attributes": {"slug": "editors-picks", "name": "Editors' Picks", "company": null, "tagKind": "Tags::SpecialType"}, "links": {"self": "/listing/editors-picks"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "606619", "type": "tag", "attributes": {"slug": "quality-multiplier", "name": "Quality Multiplier", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/quality-multiplier"}}, {"id": "608068", "type": "tag", "attributes": {"slug": "inbound-seo-optimization", "name": "Inbound SEO Optimization", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/inbound-seo-optimization"}}, {"id": "603709", "type": "tag", "attributes": {"slug": "tier-1", "name": "Tier 1", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/tier-1"}}, {"id": "698258", "type": "tag", "attributes": {"slug": "more-tags", "name": "More Tags", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/more-tags"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "477729", "type": "sentiment", "attributes": {"articleId": 4627923, "type": "neutral", "createdAt": "2023-08-13T07:24:44.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4627923", "type": "article"}}, "tag": {"data": {"id": "165", "type": "tag"}}}}]}