{"data": {"id": "4298966", "type": "fullArticle", "attributes": {"publishOn": "2019-10-25T00:53:52-04:00", "isLockedPro": false, "commentCount": 39, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"cory-cramer": {"id": 543756, "slug": "cory-cramer", "kind": "common", "non_theme": true}, "itw": {"id": 2752, "slug": "itw", "kind": "common", "non_theme": true}, "industrial-goods": {"id": 17913, "slug": "industrial-goods", "kind": "common", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "diversified-machinery": {"id": 17917, "slug": "diversified-machinery", "kind": "common", "non_theme": true}, "industrials": {"id": 20, "slug": "industrials", "kind": "sector", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "sasource": "theme_breadcrumb"}}, "title": "Illinois Tool Works: A 10-Year, Full-Cycle Analysis", "summary": ["This analysis of Illinois Tool Works stock uses a 10-year time frame and assumes a recession will occur at some point over that period.", "It projects expected returns from sentiment reversion-to-mean and business/shareholder yield based on the last economic cycle.", "It offers a Buy/Sell/Hold suggestion and shares a strategy to take advantage of Illinois Tool Works' current sentiment cycle."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2019-10-25T00:53:52-04:00", "isModerated": false, "closestTradingDate": "2019-10-25", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 5, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long RSP, SPLV.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><img src=\"https://static.seekingalpha.com/uploads/2019/10/23/17186012-15718501301116245.jpg\" width=\"640\" height=\"480\" data-width=\"640\" data-height=\"480\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></p> <p>(<a href=\"https://pixabay.com/photos/blur-chart-computer-data-finance-1853262/\" rel=\"nofollow\">Source</a>)</p> <h2>Introduction</h2> <p>Traditionally, most of my analysis on Seeking Alpha has focused on how to avoid losses and how to profit from the price cycles of classic cyclical stocks. There is another group of stocks, however, whose stock prices and earnings fluctuate far less than the classic cyclical stocks I have traditionally written about. While these stocks aren't as cyclical as a \"classic cyclical,\" they can still be subject to large swings in sentiment and can go through what I call \"sentiment cycles.\" Recently, I have been adopting some of the techniques I've used with classic cyclicals and applying them to sentiment-driven cyclicals. Today's stock, Illinois Tool Works (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ITW\" title=\"Illinois Tool Works Inc.\">ITW</a></span>), is one of those. As part of the analysis, I calculate what I consider to be the two main drivers of future total returns: Market Sentiment returns and Business/Shareholder returns. I then combine the CAGR estimates from Market Sentiment and Business/Shareholder returns to get an expected 10-year, full-cycle CAGR estimate. Currently, I consider an expected 10-year CAGR &gt; 12% a \"Buy,\" 4-12% a \"Hold\" and &lt; 4% a \"Sell.\"</p> <p>With that, let's get into the analysis.</p> <h2>How Cyclical Are Earnings?</h2> <p>Since I use different approaches for analyzing a stock based on how cyclical earnings are, historical earnings cyclicality is the first thing I examine. Let's take a look at ITW's historical earnings using a F.A.S.T. Graph, which is a great tool for this sort of analysis:</p> <p><span><a href=\"https://static.seekingalpha.com/uploads/2019/10/23/17186012-15718393539762619_origin.png\" rel=\"lightbox\" data-width=\"1274\" data-height=\"1001\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/10/23/17186012-15718393539762619.png\" width=\"640\" height=\"503\" data-width=\"640\" data-height=\"503\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p>I break down earnings cyclicality into five basic categories. The first category I call \"secular growth.\" This category describes earnings that continue to rise every year, even during economic recessions. The next three categories are \"low,\" \"moderate\" and \"deep.\" \"Low\" is usually for businesses which have earnings that have a history of declining in the single digits percentage-wise during downturns, but not much further than that. \"Deep\" I consider earnings that fall more than -50%, and \"moderate\" somewhere in between low and deep. And<span class=\"paywall-full-content invisible\"> last but not least are businesses whose earnings go negative during cyclical downturns but recover soon after that, which I call \"highly cyclical.\" For businesses that have earnings in the deep or highly cyclical categories, I use an entirely different type of analysis, so it's important to determine at the outset which category a stock falls into.</span></p> <p class=\"paywall-full-content invisible\">ITW has experienced some fairly significant EPS declines over the past 20 years. It experienced a -17% decline in 2001, a -43% decline during the Great Recession, and a -11% decline in 2013. This degree of earnings fluctuations is enough to put the stock in the \"moderate\" category, and on a scale of 1-8, I would rate the company's historical earnings cyclicality a \"4.\"</p> <p class=\"paywall-full-content invisible\">For stocks with a 4 or 5 earnings cyclicality rating, it is possible to use historical price fluctuations as a guide, but I have found that a \"full-cycle analysis\" provides a more accurate picture of the stock. The full-cycle analysis can take into account moderate earnings fluctuations fairly well as long as the earnings aren't really oscillating deeply, so that is what I'll use here. I will include some historical price data in the last section of the article as well.</p> <h2 class=\"paywall-full-content invisible\">Market Sentiment Returns</h2> <p class=\"paywall-full-content invisible\">In order to estimate what sort of returns we might expect over the next 10 years, let's begin by examining what return I could expect 10 years from now if the P/E multiple were to revert to its mean from the previous economic cycle. I start the previous cycle around 2007, about a year before the last recession.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/10/23/17186012-15718394373748555_origin.png\" rel=\"lightbox\" data-width=\"1275\" data-height=\"1004\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/10/23/17186012-15718394373748555.png\" width=\"640\" height=\"504\" data-width=\"640\" data-height=\"504\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">ITW's current blended P/E is 21.17, while its normal P/E this past cycle has been 18.22. If, over the course of the next 10 years, the P/E were to revert to 18.22 and everything else was held equal, it would produce a 10-year CAGR of about <strong>-1.49%</strong>.</p> <h2 class=\"paywall-full-content invisible\">Business/Shareholder Yield</h2> <p class=\"paywall-full-content invisible\">There are four components to the business/shareholder yield: the dividend yield, the expected buyback yield, the portion of the earnings yield that the business keeps to reinvest itself, and the full-cycle earnings growth rate. Ultimately, the business/shareholder yield is going to be limited by the earnings yield, so let's take a look at that.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\" data-id=\"null\" data-name=\"null\"><img src=\"https://static.seekingalpha.com/uploads/2019/10/24/saupload_653a2c8ea8c51585b355f9638ab514c0.png\" class=\"sa-ycharts-img\" alt=\"Chart\" data-width=\"635\" data-height=\"366\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\">Data by YCharts</figure></p> <p class=\"paywall-full-content invisible\">ITW's current forward earnings yield is +4.72%.</p> <p class=\"paywall-full-content invisible\">Since I'm using historical EPS estimates from F.A.S.T. Graphs for many of my calculations, I like to have a way to quickly check to see if a business is taking on debt (or already taken on debt) as a way to prop up those EPS numbers (often through stock buybacks). I like to look at free cash flow to equity/enterprise value yield in order to highlight potential problems. Looking at the longer-term chart typically also will show events like acquisitions, and there will often be a downward spike in the FCFE/EV yield associated with those. I tend to avoid stocks that have made bigger acquisitions or mergers and stocks that are borrowing money to buy back shares. So, this is a good, quick check for me to know whether I need to dig deeper or not.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\" data-id=\"null\" data-name=\"null\"><img src=\"https://static.seekingalpha.com/uploads/2019/10/24/saupload_a47a6c2394799d4dd90bcb4978894054.png\" class=\"sa-ycharts-img\" alt=\"Chart\" data-width=\"635\" data-height=\"366\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\">Data by YCharts</figure></p> <p class=\"paywall-full-content invisible\">The FCFE/EV yield as of the end of last quarter was 4.10%, which is pretty close to the earnings yield, so nothing seems out of the ordinary here, and I'll just use the basic forward earnings yield for my calculations.</p> <p class=\"paywall-full-content invisible\">Personally, I don't really care how management chooses to allocate earnings as long as it isn't completely irrational. It is perfectly fine for me if a company takes its earnings and reinvests them in the business as long as it can do so successfully. And if the business is no longer growing much, I am satisfied with collecting a large dividend. Or, if the company's shares are cheap, I'm also happy with it buying back stock. Mostly what I care about is what the earnings yield is and how much I can expect it to grow over the next 10 years so that I can estimate my likely return on the investment over that time frame.</p> <p class=\"paywall-full-content invisible\">Currently, +2.65% is coming back in the form of a dividend from ITW. Let's see if we can expect something to come back in the form of a stock buyback.</p> <p class=\"paywall-full-content invisible\">Examining the buyback history serves two purposes. The first is, much like the dividends, we want to know as investors <em>how</em> our money is being allocated. If the stock price of the business is low, then buybacks are a very efficient way of returning money to shareholders, especially if they are paid for with earnings instead of borrowed money. If the stock price is high, then buybacks are not a wise use of funds, because the returns might be lower than an investor might be able to get if they received a dividend and invested in something else, or if the business invested in itself. The worst case is when a business is borrowing money to buy back expensive shares. I usually avoid businesses that are doing this, and I consider the practice a flashing warning sign that management's interests are not aligned with shareholders.</p> <p class=\"paywall-full-content invisible\">Second, since I use long-term EPS trends in order to estimate earnings growth, I want to know how much stock was repurchased over the last cycle so that I can back out those stock repurchases when making my earnings growth estimates.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\" data-id=\"null\" data-name=\"null\"><img src=\"https://static.seekingalpha.com/uploads/2019/10/24/saupload_6123ae495622ae0e18836372d287102f.png\" class=\"sa-ycharts-img\" alt=\"Chart\" data-width=\"635\" data-height=\"366\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\">Data by YCharts</figure></p> <p class=\"paywall-full-content invisible\">Illinois Tool Works has purchased a lot of shares back during this past cycle. I will back those out of my EPS growth expectations later on in the analysis.</p> <p class=\"paywall-full-content invisible\">Next, I want to check the more recent 3-year and 1-year buyback trends in order to estimate what sort of buyback yield we might expect over the next cycle.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\" data-id=\"null\" data-name=\"null\"><img src=\"https://static.seekingalpha.com/uploads/2019/10/24/saupload_18fdc2b667ba6af672673a81cc80df9a.png\" class=\"sa-ycharts-img\" alt=\"Chart\" data-width=\"635\" data-height=\"366\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\">Data by YCharts</figure><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\" data-id=\"null\" data-name=\"null\"><img src=\"https://static.seekingalpha.com/uploads/2019/10/24/saupload_30f5531a8ad1856adcc17637bbcd1ea5.png\" class=\"sa-ycharts-img\" alt=\"Chart\" data-width=\"635\" data-height=\"366\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\">Data by YCharts</figure></p> <p class=\"paywall-full-content invisible\">I think we can expect a 1.41% buyback yield along with the 2.65% dividend yield from ITW going forward. Basically, 2/3rds of its earnings are going out in the form of a dividend and 1/3rd is being used for buybacks, with basically no earnings being reinvested into the business.</p> <p class=\"paywall-full-content invisible\">Since I am interested in how much money ITW might earn over the next 10 years, I also want to take into account any additional earnings from EPS growth that might occur over this time period. I'll estimate that by looking at the previous cycle, in this case measured from 2007 through 2019, and I'll remove the effects of stock buybacks. When I do the math on that, I get a cyclically adjusted earnings growth rate of +3.01%, which is a pretty low growth rate, slightly above inflation over this time period.</p> <p class=\"paywall-full-content invisible\">Next, I'll apply that growth rate to current earnings looking forward 10 years in order to get a final 10-year CAGR estimate. The way I think about this is, if I bought ITW's whole business for $100, it would pay me back $4.72 per year, and that amount would grow at +3.01% per year for 10 years. I want to know how much money I would have in total at the end of 10 years on my $100 investment, which I calculate to be about $155.77, and that translates to a <strong>+4.53%</strong> 10-year CAGR.</p> <h2 class=\"paywall-full-content invisible\">10-Year, Full-Cycle CAGR Estimate</h2> <p class=\"paywall-full-content invisible\">Potential future returns can come from two main places: market sentiment or business/shareholder returns. If we assume that market sentiment reverts to the mean from the last cycle over the next 10 years, ITW will produce a -1.49% CAGR. If the business/shareholder yield and growth are similar to the last cycle, the company should produce a +4.53% 10-year CAGR. If we put the two together, we get an expected 10-year, full-cycle CAGR of<strong> +3.04%</strong>. This is significantly below the 4% threshold I use for a \"Sell\" rating, so ITW is currently a \"Sell\" for me.</p> <h2 class=\"paywall-full-content invisible\">Opportunity Risk/Reward</h2> <p class=\"paywall-full-content invisible\">Since I think Illinois Tool Works is a good business but is simply priced too high, it's worth looking at the odds of the price falling to a level where we could buy it near its average P/E ratio if we sell at today's levels versus what we might miss out on by rotating out of the stock at today's prices.</p> <p class=\"paywall-full-content invisible\">The first step of this process is to see how many years over the past two decades ITW has traded below its average P/E of 18.22, and at some point during each year in 14 out of the past 20 years, you would have had a chance to buy the stock below its average P/E. The most recent year the P/E traded that low was in January of this year. So, it doesn't seem unreasonable to me to think that during the next economic slowdown, or perhaps even before then, ITW's P/E will fall at least to that 18.22 level. (During the last recession, the P/E fell below 10.) If the company's P/E contracts from its current multiple of 21.17 to 18.22 while earnings are held steady, the price would drop about -14%.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2019/10/23/17186012-15718492161230845_origin.png\" rel=\"lightbox\" data-width=\"1272\" data-height=\"986\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2019/10/23/17186012-15718492161230845.png\" width=\"640\" height=\"496\" data-width=\"640\" data-height=\"496\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Forecasting out 2-3 years to end 2021, including dividends, we can expect to add $27.13 to ITW's current price. That gives us a price estimate 2-3 years from now of $188.71 using a 21 P/E ratio. If the stock price at that point reverts to its mean, it would lose about -14% of its value and produce a price of $162.29, which is right around where the stock trades at today. So, even if we were to go over two years before the stock price reverts to its average P/E ratio and assume the analysts' growth expectations between now and then are correct, we would still probably get a chance to at least get back to even on the stock. If a correction were to start tomorrow, however, we could expect to lose over -14% of today's price.</p> <p class=\"paywall-full-content invisible\">If we were to have a recession or bear market, it's worth taking a look at ITW's historical drawdowns over the past few decades.</p> <span class=\"table-responsive paywall-full-content invisible\"><span class=\"table-scroll-wrapper\"><span data-intersection-boundary=\"start\"></span><table> <tr> <td><strong>~Year</strong></td> <td><strong>~Time Until Bottom</strong></td> <td><strong>~Duration</strong></td> <td><strong>~Depth</strong></td> </tr> <tr> <td>1973</td> <td>2 years</td> <td>10 years</td> <td>54%</td> </tr> <tr> <td>1998</td> <td>6 months</td> <td>1 year</td> <td>37%</td> </tr> <tr> <td>1999</td> <td>9 months</td> <td>4.5 years</td> <td>36%</td> </tr> <tr> <td>2007</td> <td>21 months</td> <td>4.5 years</td> <td>56%</td> </tr> </table> <span data-intersection-boundary=\"end\"></span></span><button class=\"table-enlarge-button\"><svg viewbox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\" class=\"table-enlarge-icon\"><path fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M16 11a5 5 0 0 1-5 5H5a5 5 0 0 1-5-5V5a5 5 0 0 1 5-5h6a5 5 0 0 1 5 5v6zm-4.5-2.5h2v-6h-6v2h4v4zm-9-1h2v4h4v2h-6v-6z\"></path></svg>Click to enlarge</button></span> <p class=\"paywall-full-content invisible\">The company's historical drawdowns typically have been equal or less than that of the market. However, going into the Great Recession, it had a peak P/E of around 18, so it's a little more expensive this time around.</p> <p class=\"paywall-full-content invisible\">Selling ITW here and achieving a big share gain using my rotational strategy here isn't exactly an easy \"slam dunk,\" but there also isn't likely much opportunity risk given the company's fairly slow earnings growth. For these reasons, I don't see much opportunity risk in rotating out of ITW stock today.</p> <h2 class=\"paywall-full-content invisible\">Long-Only Rotational Strategy Suggestion</h2> <p class=\"paywall-full-content invisible\">I am currently writing a series about high-quality businesses that are overvalued, like Illinois Tool Works. You can read about the strategy in these three articles: <a href=\"https://seekingalpha.com/article/4285297-ignore-sentiment-cycles-your-own-risk\">Part 1</a> - \"Ignore Sentiment Cycles At Your Own Risk,\" <a href=\"https://seekingalpha.com/article/4285934-mitigating-sentiment-cycles-ignore-sentiment-cycles-your-own-risk-part-2\">Part 2</a> - \"Mitigating Sentiment Cycles\" and <a href=\"https://seekingalpha.com/article/4287258-sentiment-cycles-when-to-sell-and-when-to-buy-back-again\">Part 3</a> - \"Sentiment Cycles: When To Sell And When To Buy Back Again.\"</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">My current suggestion is that owners of ITW who would like to avoid part of the eventual correction in the stock rotate out of it and into a 50/50 mix of the Invesco S&amp;P 500 Low Volatility ETF (<a href=\"https://seekingalpha.com/symbol/SPLV\" title=\"Invesco S&amp;P 500 Low Volatility ETF\">SPLV</a>) and the Invesco S&amp;P 500 Equal Weight ETF (<a href=\"https://seekingalpha.com/symbol/RSP\" title=\"Invesco S&amp;P 500 Equal Weight ETF\">RSP</a>) until ITW's price falls to a more reasonable level that offers better forward returns. My expectation is that owners would be able to increase the number of ITW shares they own by 20-25% using this strategy without spending any additional money. (To see how this strategy works, read the three articles linked above.)</p>", "twitContent": "$ITW - Illinois Tool Works: A 10-Year, Full-Cycle Analysis. https://seekingalpha.com/article/4298966-illinois-tool-works-10-year-full-cycle-analysis?source=tweet ", "innerMarketing": "<p>If you have found my strategies interesting, useful, or profitable, consider supporting my continued research by joining the <a href=\"https://seekingalpha.com/author/cory-cramer/research\">Cyclical Investor's Club</a>. It's only $29/month, and it's where I share my latest research and exclusive small-and-midcap ideas. Two-week trials are free.</p>", "marketingBullet": "Looking for a helping hand in the market? Members of The Cyclical Investor’s Club get exclusive ideas and guidance to navigate any climate.  <a href='/checkout?service_id=mp_1262' sasource='mp_marketing_text_top'>Get started today »</a>", "isReit": false, "videoData": null, "marketingBulletVariant": "I am Cory Cramer and I run the investing group <a href=\"/checkout?service_id=mp_1262&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A17186012%7Csection_asset%3Aauthor_bullets%3A-the-cyclical-investors-club\" data-test-id=\"author-custom-template-link\">The Cyclical Investor's Club</a>, where my background in poli-sci informs my macro views in my unique approach that uses historical cycles to identify tops and bottoms.", "marketingBio": "Cory Cramer is an award-winning political scientist and a long-only cyclical investor capitalizing on market cycles. He has been investing since the 1990s and still invests his own money in the companies he writes about. Cory leads the investing group <a href=\"/checkout?service_id=mp_1262&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A17186012%7Csection_asset%3Aauthor_root%3A-the-cyclical-investors-club\" data-test-id=\"author-custom-template-link\">The Cyclical Investor's Club</a> where he shares his unique approach to estimating the fair value of stocks by capitalizing on downcycles for undervalued companies. He teaches 4 unique cyclical strategies, offers a master valuation spreadsheet, and is available to answer any questions via chat or direct message. <a href=\"/checkout?service_id=mp_1262&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A17186012%7Csection_asset%3Aauthor_root%3A-the-cyclical-investors-club\" data-test-id=\"author-custom-template-link\">Learn more</a>.", "audioDuration": null}, "relationships": {"author": {"data": {"id": "95006", "type": "author"}}, "sentiments": {"data": [{"id": "76346", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2752", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "543756", "type": "tag"}, {"id": "17913", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17917", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4298966-illinois-tool-works-10-year-full-cycle-analysis", "canonical": "https://seekingalpha.com/article/4298966-illinois-tool-works-10-year-full-cycle-analysis", "uriImage": "https://static.seekingalpha.com/uploads/2019/10/23/17186012-15718501301116245.jpg", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2019/10/23/17186012-15718501301116245.jpg"}}}, "included": [{"id": "1262", "type": "authorResearch", "attributes": {"createdAt": "2018-05-04T15:12:59-04:00", "title": "The Cyclical Investor’s Club", "rating": "5.0", "reviewCount": 10, "shortPitch": "One-of-a-kind research using historical cycles to identify tops and bottoms", "categories": ["Value", "GARP"], "serviceAssistantIds": [], "inAppPurchasesAllowedInIos": false, "inAppPurchasesAllowedInAndroid": false, "activeSubscriptionsCount": 14621, "androidIapPlan": "sa_approved", "iosIapPlan": "sa_approved", "description": "My research uses a quantitative approach based on long-term, stock-specific, historical cycles to find good entry-points for stocks near the bottom of their individual cycles, and then uses qualitative analysis to determine the stocks that are likely to rebound from their cyclical lows in a timely manner. It also provides medium-term rotational strategies and model portfolio.", "landingPageColor": "light-blue", "adUnits": ["direct_access", "active_chat", "model_portfolio", "exclusive_idea", "industry_tracker", "access_all"], "tempData": {}, "price": 40.0, "wildcardText": "", "slug": "the-cyclical-investors-club", "annualPriceWithDiscount": 400.0, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": false}, "relationships": {"author": {"data": {"id": "95006", "type": "author"}}}}, {"id": "95006", "type": "author", "attributes": {"company": null, "slug": "cory-cramer", "userId": 17186012, "tagId": 543756, "bio": "<p>Cory Cramer has been investing in markets since the 1990s and providing stock analysis for independent investors since 2015.</p> Cory leads the investing group <a href=\"https://seekingalpha.com/checkout?service_id=mp_1262\">The Cyclical Investor's Club</a> where he shares his unique mix of investing strategies that focus on All-Weather-Growth. The goals of the CIC strategies are to be sensitive to both economic and market cycles while also investing for long-term growth. This helps to reduce the risk of losses without reducing medium and long-term portfolio returns. <a href=\"https://seekingalpha.com/checkout?service_id=mp_1262\">Learn more</a>.", "image": {"small": "https://static.seekingalpha.com/images/users_profile/017/186/012/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/017/186/012/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/017/186/012/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/017/186/012/extra_large_pic.png"}, "nick": "Cory Cramer", "deactivated": null, "memberSince": 2013, "isRss": false, "contributorSince": 2015, "followersCount": 23863}, "relationships": {"user": {"data": {"id": "17186012", "type": "user"}}, "userBioTags": {"data": [{"id": "799186", "type": "userBioTag"}, {"id": "799196", "type": "userBioTag"}, {"id": "799206", "type": "userBioTag"}, {"id": "799216", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1262", "type": "authorResearch"}}}, "links": {"self": "/author/cory-cramer", "profileUrl": "/author/cory-cramer", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2752", "type": "tag", "attributes": {"slug": "itw", "name": "ITW", "company": "Illinois Tool Works Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "20", "type": "sector"}}}, "links": {"self": "/symbol/ITW"}}, {"id": "543756", "type": "tag", "attributes": {"slug": "cory-cramer", "name": "Cory Cramer", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/cory-cramer"}}, {"id": "17913", "type": "tag", "attributes": {"slug": "industrial-goods", "name": "Industrial Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/industrial-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17917", "type": "tag", "attributes": {"slug": "diversified-machinery", "name": "Diversified Machinery", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/diversified-machinery"}}, {"id": "76346", "type": "sentiment", "attributes": {"articleId": 4298966, "type": "bearish", "createdAt": "2019-10-25T00:53:52.000-04:00", "typeId": 3}, "relationships": {"article": {"data": {"id": "4298966", "type": "article"}}, "tag": {"data": {"id": "2752", "type": "tag"}}}}]}