{"data": {"id": "4300432", "type": "fullArticle", "attributes": {"publishOn": "2019-10-30T13:55:32-04:00", "isLockedPro": false, "commentCount": 10, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"david-h-lerner": {"id": 599385, "slug": "david-h-lerner", "kind": "common", "non_theme": true}, "investing-strategy-main": {"id": 39, "slug": "investing-strategy-main", "kind": "breadcrumb", "path": "/investing-strategy", "title": "Investing Strategy", "sasource": "theme_breadcrumb"}, "portfolio-strategy-asset-allocation": {"id": 17190, "slug": "portfolio-strategy-asset-allocation", "kind": "breadcrumb", "path": "/investing-strategy/portfolio-strategy", "title": "Portfolio Strategy", "sasource": "theme_breadcrumb"}, "akam": {"id": 1401, "slug": "akam", "kind": "common", "non_theme": true}, "ba": {"id": 769, "slug": "ba", "kind": "common", "non_theme": true}, "ebay": {"id": 547, "slug": "ebay", "kind": "common", "non_theme": true}, "googl": {"id": 148893, "slug": "googl", "kind": "common", "non_theme": true}, "hon": {"id": 3213, "slug": "hon", "kind": "common", "non_theme": true}, "intc": {"id": 1017, "slug": "intc", "kind": "common", "non_theme": true}, "lscc": {"id": 1120, "slug": "lscc", "kind": "common", "non_theme": true}, "mchp": {"id": 1714, "slug": "mchp", "kind": "common", "non_theme": true}, "mu": {"id": 1309, "slug": "mu", "kind": "common", "non_theme": true}, "adi": {"id": 1299, "slug": "adi", "kind": "common", "non_theme": true}, "now": {"id": 44151, "slug": "now", "kind": "common", "non_theme": true}, "nvda": {"id": 1150, "slug": "nvda", "kind": "common", "non_theme": true}, "nxpi": {"id": 16316, "slug": "nxpi", "kind": "common", "non_theme": true}, "smh": {"id": 401, "slug": "smh", "kind": "common", "non_theme": true}, "utx-defunct-2436": {"id": 2436, "slug": "utx-defunct-2436", "kind": "common", "non_theme": true}, "xli": {"id": 420, "slug": "xli", "kind": "common", "non_theme": true}, "amd": {"id": 1016, "slug": "amd", "kind": "common", "non_theme": true}, "ge": {"id": 101, "slug": "ge", "kind": "common", "non_theme": true}, "itw": {"id": 2752, "slug": "itw", "kind": "common", "non_theme": true}, "nke": {"id": 917, "slug": "nke", "kind": "common", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "etf-portfolio-strategy": {"id": 17189, "slug": "etf-portfolio-strategy", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "industrials": {"id": 20, "slug": "industrials", "kind": "sector", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "sasource": "theme_breadcrumb"}}, "title": "Nike, Just Do It, But Not Yet; General Electric Brings Good Things And What That Means For Industrials", "summary": ["Nike looks like it is setting up for an interesting trade. If it doesn't hit our price target, move on.", "GE is a trade and possibly an investment. We are seeing a historic turnaround.", "The Industrials are getting interesting, we look at ITW as a trade if it hits our price.", "The analysts are falling all over themselves to upgrade the chips. I am looking at AMD, but there are a lot of opportunities here. Most interesting are the industrial chip upgrades as a riposte to Texas Instruments."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2019-10-30T13:55:32-04:00", "isModerated": false, "closestTradingDate": "2019-10-30", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 25, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long GE.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I expressed this trade through Call options. The initial position is small but I plan to add to it over time.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<h3><strong>Very quietly Nike breaks under $90</strong></h3> <p>Traders have been calling for Nike (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/NKE\" title=\"NIKE, Inc.\">NKE</a></span>) to run to $100 and beyond. No one was talking about NKE to break down. Running to $100 and beyond was conventional wisdom. You all know what I think of conventional wisdom by now. The \"stop\" was variously cited at $90-91. So of course, very quietly without being noted, NKE broke that level. I think that this will draw more selling.</p> <p>However, NKE looks to have good support at $87-ish. I would target that level to set up a trade. I am calling for you to do nothing other than keeping an eye on it. If it stays below $90, stop-loss discipline will take charge. It just will.</p> <p>Let's chart the levels and you can decide whether it's worth a trade. My trading thesis is that it breaks to a lower support level, to the point that traders pay attention again, before possibly attracting some shorts on top of it. It then becomes an undeniable \"bargain\", the bulls rush back in and THEN power it to $100 (or close to it).</p> <p><a href=\"https://static.seekingalpha.com/uploads/2019/10/30/saupload_img1.png\"><img src=\"https://static.seekingalpha.com/uploads/2019/10/30/saupload_img1_thumb1.png\" hspace=\"6\" vspace=\"6\" data-width=\"640\" data-height=\"433\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></p> <p>Source: <a href=\"https://www.tradingview.com/x/yUc9SJjd/\" rel=\"nofollow\">tradingview.com</a></p> <p>The diagonal line is the uptrend which was decisively broken on news that Mark Parker was stepping away from the CEO chair. No matter that John Donahoe is the right man for a company that must excel in executing on DTC. Direct-to-Consumer is the way that NKE will differentiate itself while disintermediating the mall-based retailers that are going the way of the Dodo. Donahoe has the digital chops, and the eCommerce savvy having been the CEO of ServiceNow (<a href=\"https://seekingalpha.com/symbol/NOW\" title=\"ServiceNow, Inc.\">NOW</a>) and eBay (<a href=\"https://seekingalpha.com/symbol/EBAY\" title=\"eBay Inc.\">EBAY</a>).</p> <p>So let me state that I am a NKE bull. I am not throwing shade on the company, but stocks like trees don't grow to the sky. They need to consolidate, and often at significantly lower<span class=\"paywall-full-content invisible\"> levels before they go higher. Now that we got that out of the way, NKE has clearly broken trend. The 3 horizontal lines can show where NKE may fall, while the top two lines are where what I would call is the \"congestion\" area where NKE could get support. The 3rd line is the next lower level, where I don't think NKE will fall to, but in case it does, you should leave some cash allocated to purchase more. I am asking you to be patient, and if NKE bounces off of the $90 level and goes higher, there are other stocks to trade or speculate in. I expect the former alternative to the latter so keep your eyes peeled and have a plan, keep cash ready.</span></p> <h3 class=\"paywall-full-content invisible\"><strong>General Electric beats on earnings and revenues</strong></h3> <p class=\"paywall-full-content invisible\">General Electric (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/GE\" title=\"General Electric Company\">GE</a></span>) getting higher prices on Aerospace parts, also higher prices for the health division, and has gotten hold of the power division with Wind doing better. Power will be a multi-year turnaround process, but Larry Culp once again has stated his confidence that things are getting better. I have written in the months and more past that GE is a viable turnaround story. After Larry Culp committed to making GE a dividend payer, I made an exception and called GE a long-term investment albeit a risky one.</p> <p class=\"paywall-full-content invisible\">I find it encouraging that GE is getting higher prices for their aerospace parts. I think that is tied to airliners keeping older planes in the air since a major supply of new capacity is restrained. I am still optimistic about the Boeing (<a href=\"https://seekingalpha.com/symbol/BA\" title=\"The Boeing Company\">BA</a>) story. Even as Dennis Muilenburg was being shredded in the Senate, BA rose quite strongly yesterday. Still, I say it gets certified before this year ends, planes start flying in earnest late February/early March. That means that BA is going to take a while to get back to the planned 57 Maxes a month. That means that the supply of new equipment will be constrained. That, in turn, means greater demand for GE parts and services. GE jet engines really throw off profits on parts and services, all engine suppliers basically look to break even on the actual equipment to make bank.</p> <p class=\"paywall-full-content invisible\">I have called for GE to get to $14 a share for a while now, and I was \"early\". Now I think the rally will take off in earnest. Now I am calling GE a TRADE. Look at the chart, the chart was broadcasting this rally for a while now, and clearly you see the breakout...</p> <p class=\"paywall-full-content invisible\"><a href=\"https://static.seekingalpha.com/uploads/2019/10/30/saupload_img1_1.png\"><img src=\"https://static.seekingalpha.com/uploads/2019/10/30/saupload_img1_1_thumb1.png\" hspace=\"6\" vspace=\"6\" data-width=\"640\" data-height=\"433\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></p> <p class=\"paywall-full-content invisible\">Source: <a href=\"https://www.tradingview.com/x/ClIz0XOY/\" rel=\"nofollow\">tradingview.com</a></p> <p class=\"paywall-full-content invisible\">Prior to the rocket-ship that GE is this morning, we see a pennant formation. This usually portends a sharp move up or down (purple/red lines) as the higher lows and lower highs resolve into a point. I also highlighted (black line) what is essentially a rising \"W\" which is a strong bullish formation. I would not be surprised if it breaks even higher in short order. I would monitor volume and block trades, as I expect \"sponsorship\" to come into play. By that, I mean that institutional money will come back to GE.</p> <p class=\"paywall-full-content invisible\">Larry Culp has gotten a hold on GE and one of the greatest industrial turnaround stories in recent memory is unfolding before our eyes. I just checked, in the first hour of trading, 90 million shares just changed hands, that is nearly 50% more trades than an entire day. GE is a fast money trade.</p> <h3 class=\"paywall-full-content invisible\"><strong>Industrials for a trade</strong></h3> <p class=\"paywall-full-content invisible\"><strong>Illinois Tool Works (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ITW\" title=\"Illinois Tool Works Inc.\">ITW</a></span>):</strong> When ITW reported earnings, it was very well received. It was characterized as exceptional in an economy that was hostile to manufacturing. What if we take the good results from Honeywell (<a href=\"https://seekingalpha.com/symbol/HON\" title=\"Honeywell International Inc.\">HON</a>), from ITW, United Technologies (<a href=\"https://seekingalpha.com/symbol/UTX\">UTX</a>) beating on revenue, earnings and raising forward guidance, and now with GE. If you are looking to get long some of these names, here are some charts to think about an entry point.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://static.seekingalpha.com/uploads/2019/10/30/saupload_img1_2.png\"><img src=\"https://static.seekingalpha.com/uploads/2019/10/30/saupload_img1_2_thumb1.png\" hspace=\"6\" vspace=\"6\" data-width=\"640\" data-height=\"433\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></a></p> <p class=\"paywall-full-content invisible\">Source: <a href=\"https://www.tradingview.com/x/ktVgPIP0/\" rel=\"nofollow\">tradingview.com</a></p> <p class=\"paywall-full-content invisible\">The above is a 5-day chart of ITW. I have a blue arrow on the left. This is highlighting what was a \"gap up\" formation. In charting, we often see price action filling gaps either up or down. It might be hard to imagine that after ITW beat earnings so well, and surprised the market. At the same time, there is skepticism that the Industrial sector still has room to run, that ITW could fall. It can, and as the simple chart shows, it may likely will.</p> <p class=\"paywall-full-content invisible\">The diagonal red line is the uptrend line, and ITW has broken that line. I agree that this is just a 5-day chart, but I think this is all you need to see. The price target you should monitor is the $168 level. If it violates that level, then that gap up will likely be filled and you could buy below that $162 level, for a long-term speculation. ITW does have a 2.48% dividend so it qualifies for a long-term account as well.</p> <p class=\"paywall-full-content invisible\">There is more optimism for many names including 3M (<a href=\"https://seekingalpha.com/symbol/MMM\" title=\"3M Company\">MMM</a>) which is now trading almost 20 points from its 52-week low, and even the industrial ETF (<a href=\"https://seekingalpha.com/symbol/XLI\" title=\"Industrial Select Sector SPDR® Fund ETF\">XLI</a>) is at 52-week highs. With all the skepticism, and even with weakness in the oil and gas space, I think we have further upside from here.</p> <p class=\"paywall-full-content invisible\">It's not just the industrial space. The banks, both regional and the big money center banks, are doing well. There is a lot of reason to be bullish if you just listen to the market and ignore the prophets of doom.</p> <h3 class=\"paywall-full-content invisible\"><strong>Think about insurance</strong></h3> <p class=\"paywall-full-content invisible\">That is not to say we are not going to experience volatility. So just remember, cash is the cheapest hedge, and the VIX is only at 13, put options should be relatively cheap. Look at the areas that you have the most concentration and find some cheap short-term put options in an ETF for that sector.</p> <h3 class=\"paywall-full-content invisible\"><strong>Analyst Corner</strong></h3> <p class=\"paywall-full-content invisible\"><em>Looks like there are is more enthusiasm for tech, especially in chips.</em></p> <p class=\"paywall-full-content invisible\">Analysts upgraded <strong>Akamai (<a href=\"https://seekingalpha.com/symbol/AKAM\" title=\"Akamai Technologies, Inc.\">AKAM</a>).</strong> From D.A. Davidson, Morgan Stanley and Royal Bank Canada to lesser-known firms upgrading prices and recommendations from Buy to Outperform, to sector perform for RBC.</p> <p class=\"paywall-full-content invisible\"><strong>My take:</strong> I like AKAM. I think Alphabet (<a href=\"https://seekingalpha.com/symbol/GOOGL\" title=\"Alphabet Inc.\">GOOGL</a>) (<a href=\"https://seekingalpha.com/symbol/GOOG\" title=\"Alphabet Inc.\">GOOG</a>) should buy them. AKAM has been around from the first days of the internet commercialization. That said, it hasn't grown into a behemoth, and at the size it is, with the \"steady Eddie\" type growth, it doesn't get much attention. One day a suitor will come along and it will finally get the price that it deserves. Perhaps PE in the form of a Thoma Bravo or a Silverlake Partners will take them out, then use it as a base to add on other Cloud services businesses to grow them before bringing them back on the market for a big return.</p> <p class=\"paywall-full-content invisible\"><strong>Advanced Micro Devices (<a href=\"https://seekingalpha.com/symbol/AMD\" title=\"Advanced Micro Devices, Inc.\">AMD</a>) </strong>was upgraded by analysts at Loop Capital with a $41 PT. Rosenblatt Securities raised the PT of AMD to $52 for a 57.4% upside.</p> <p class=\"paywall-full-content invisible\"><strong>My Take:</strong> I am an Advanced Micro Devices bull and a total fan of Lisa Su. I think she underpromised on forward guidance, and based on the great results on the data center, AMD goes higher. I think AMD continues to take share from Intel (<a href=\"https://seekingalpha.com/symbol/INTC\" title=\"Intel Corporation\">INTC</a>) and also holds its own when it comes to Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\" title=\"NVIDIA Corporation\">NVDA</a>). I want to wait another day or so and see if we can get AMD a bit cheaper. But I think AMD is going to break above recent highs going into year-end. It's a buy, and if you aren't as patient as me, and you want to trade it today, have at it.</p> <p class=\"paywall-full-content invisible\"><strong>Microchip Technology (<a href=\"https://seekingalpha.com/symbol/MCHP\" title=\"Microchip Technology Incorporated\">MCHP</a>) </strong>was upgraded by Raymond James from market-perform to a strong buy. PT is $115 with a 21% upside.</p> <p class=\"paywall-full-content invisible\"><strong>My Take:</strong> This is a really interesting call. MCHP builds chips that go into machinery and industrial equipment. This is counter to the Texas Instruments (<a href=\"https://seekingalpha.com/symbol/TXN\" title=\"Texas Instruments Incorporated\">TXN</a>) results. Perhaps MCHP has found some better niches in this space, or perhaps Ray-Jay is looking forward and seeing a pick up in the industrial sector as talk has turned to a rebound. I am not the only one with this opinion is what I am getting at.</p> <p class=\"paywall-full-content invisible\">More chip price target upgrades from multiple banks for Lattice Semiconductor (<a href=\"https://seekingalpha.com/symbol/LSCC\" title=\"Lattice Semiconductor Corporation\">LSCC</a>), Maxim Integrated (<a href=\"https://seekingalpha.com/symbol/ADI\">MXIM</a>), and NXP Semiconductors (<a href=\"https://seekingalpha.com/symbol/NXPI\" title=\"NXP Semiconductors N.V.\">NXPI</a>). I think this marks a general turn in attitude towards the chips, even though the chip ETF (<a href=\"https://seekingalpha.com/symbol/SMH\" title=\"VanEck Semiconductor ETF\">SMH</a>) is already at highs, it is obvious that it is going higher as many names are getting rerated upward. Maybe the fast money trade is the SMH. I have my eye on Micron (<a href=\"https://seekingalpha.com/symbol/MU\" title=\"Micron Technology, Inc.\">MU</a>) and AMD, however...</p> <h3 class=\"paywall-full-content invisible\"><strong>My Trading Corner</strong></h3> <p class=\"paywall-full-content invisible\">I initiated a long position in GE. I starting out small and will add over time. I expressed this trade using options that are slightly OTM with a December expiration. Study GE on your own. GE is not immune to tape bombs, meaning headline risk. It might be more prudent to go with the underlying equity and do the same. Start very small and add to the position over time.</p> <p class=\"paywall-full-content invisible\">As for a long-term investment, it only makes sense if Larry Culp makes good on his commitment to growing the dividend back so that it is meaningful. Generally, a stock like this is too risky for a \"widows and orphans\" type account. Talk to your financial advisor, she may talk you out of it, and I would not argue.</p> <p class=\"paywall-full-content invisible\">That said, if you do have room for a bit of risk, and obviously the decision is yours as to how much, I think you can buy GE. A final caveat for long-term investors. I would not put anywhere near a full position until GE really proves it can get past the restructuring. GE is a battleground stock and some new joker can come along and make claims about fraud and whatnot to hammer it back down to $8-ish. So +1 points on the downside and possibly 3-5 points of upside looks good to me. I think GE is a medium-term trade going into 2020 as well as a fast money trade if you can buy it right.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">As I said above, I expressed my positive view of GE with options. If you would like to learn more about options and have a place to discuss how to set them up, this is one of the ideas we will explore in the Put-Call Community. It is a subscription service that will soon debut. It won't be just about leveraging returns while lowering risk through straight trading long calls. We will explore different ways to use options defensively and conservatively as well. Stay tuned!</p>", "twitContent": "$GE $ITW $NKE - Nike, Just Do It, But Not Yet; General Electric Brings Good Things And What That Means For Industrials. https://seekingalpha.com/article/4300432-nike-just-not-yet-general-electric-brings-good-things-and-what-means-for-industrials?source=tweet ", "innerMarketing": null, "marketingBullet": null, "isReit": false, "videoData": null, "marketingBulletVariant": "I am David H. Lerner. For the past decade I have utilized my background in tech consulting to identify market trends and provide investment ideas.  I am the leader of the investing group <a href=\"/checkout?service_id=mp_1327&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A43755796%7Csection_asset%3Aauthor_bullets%3A-group-mind-investing\" data-test-id=\"author-custom-template-link\">Group Mind Investing</a>", "marketingBio": "David H. Lerner is an analyst with a decade of experience utilizing his professional background in software consulting and technology to identify market trends and provide long and short trading ideas. David employs a combination of technical analysis and market psychology to capitalize on narratives for outsized returns. He also utilizes “Cash Management Discipline,” a simple trading style to hedge against the volatility of today’s market climate. CMD plays a very strong role in maintaining a healthy mindset while trading, an often overlooked component of successful trading/investing. The overall theme of Group Mind is to anticipate and not just react.\n\nHe leads the investing group <a href=\"/checkout?service_id=mp_1327&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A43755796%7Csection_asset%3Aauthor_root%3A-group-mind-investing\" data-test-id=\"author-custom-template-link\">Group Mind Investing</a> where he uncovers actionable trading and investing ideas nearly every day. Other features include: long and short swing trade alerts, daily macro analysis, weekly articles, and chat for community interaction and questions. <a href=\"/checkout?service_id=mp_1327&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A43755796%7Csection_asset%3Aauthor_root%3A-group-mind-investing\" data-test-id=\"author-custom-template-link\">Learn more</a>.", "audioDuration": null}, "relationships": {"author": {"data": {"id": "105256", "type": "author"}}, "sentiments": {"data": [{"id": "77786", "type": "sentiment"}, {"id": "77784", "type": "sentiment"}, {"id": "77785", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "101", "type": "tag"}, {"id": "2752", "type": "tag"}, {"id": "917", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "1401", "type": "tag"}, {"id": "769", "type": "tag"}, {"id": "547", "type": "tag"}, {"id": "148893", "type": "tag"}, {"id": "3213", "type": "tag"}, {"id": "1017", "type": "tag"}, {"id": "1120", "type": "tag"}, {"id": "1714", "type": "tag"}, {"id": "1309", "type": "tag"}, {"id": "1299", "type": "tag"}, {"id": "44151", "type": "tag"}, {"id": "1150", "type": "tag"}, {"id": "16316", "type": "tag"}, {"id": "401", "type": "tag"}, {"id": "2436", "type": "tag"}, {"id": "420", "type": "tag"}, {"id": "1016", "type": "tag"}]}, "otherTags": {"data": [{"id": "599385", "type": "tag"}, {"id": "17190", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "17189", "type": "tag"}, {"id": "326", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4300432-nike-just-not-yet-general-electric-brings-good-things-and-what-means-for-industrials", "canonical": "https://seekingalpha.com/article/4300432-nike-just-not-yet-general-electric-brings-good-things-and-what-means-for-industrials", "uriImage": "https://static.seekingalpha.com/uploads/2019/10/30/saupload_img1_thumb1.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2019/10/30/saupload_img1_thumb1.png"}}}, "included": [{"id": "1327", "type": "authorResearch", "attributes": {"createdAt": "2019-08-29T15:12:35-04:00", "title": "Group Mind Investing", "rating": "4.7", "reviewCount": 27, "shortPitch": "We strive to anticipate, not react. We take a long/short approach with CMD", "categories": ["Macro", "Quantitative"], "serviceAssistantIds": [], "inAppPurchasesAllowedInIos": true, "inAppPurchasesAllowedInAndroid": true, "activeSubscriptionsCount": 19, "androidIapPlan": "semi_annual", "iosIapPlan": "annual", "description": "Is your portfolio underperforming? We promote healthy trading/investment habits, helping those deep in the red via Cash Management Discipline (CMD). Subscribers receive our exclusive curated Microcap Biotech 30 list, Fallen Angel list, and Long Hold list, and exclusive weekly tactical articles. We have a long and short approach - with lively chatroom discussions each market day. ", "landingPageColor": "light-blue", "adUnits": ["direct_access", "trading_alert", "active_chat", "daily_market", "vibrant_community", "wildcard"], "tempData": {}, "price": 60.0, "wildcardText": "curated microcap biotech 30 list, Fallen Angel list", "slug": "group-mind-investing", "annualPriceWithDiscount": 499.0, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": true}, "relationships": {"author": {"data": {"id": "105256", "type": "author"}}}}, {"id": "105256", "type": "author", "attributes": {"company": null, "slug": "david-h-lerner", "userId": 43755796, "tagId": 599385, "bio": "<p>David H. Lerner is an analyst with a decade of experience utilizing his professional background in software consulting and technology to identify market trends and provide long and short trade ideas. David employs a combination of technical analysis and market psychology to capitalize on narratives for outsized returns. He also utilizes “Cash Management Discipline,” a simple trading style to hedge against the volatility of today’s market climate.</p><p>He leads the investing group <a href=\"https://seekingalpha.com/checkout?service_id=mp_1327\">Group Mind Investing</a> where he uncovers actionable trading and investing ideas nearly every day. Other features include: long and short swing trade alerts, daily macro analysis, weekly articles, and chat for community interaction and questions. <a href=\"https://seekingalpha.com/checkout?service_id=mp_1327\">Learn More</a>.</p>", "image": {"small": "https://static.seekingalpha.com/images/users_profile/043/755/796/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/043/755/796/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/043/755/796/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/043/755/796/extra_large_pic.png"}, "nick": "David H. Lerner", "deactivated": null, "memberSince": 2015, "isRss": false, "contributorSince": 2019, "followersCount": 30489}, "relationships": {"user": {"data": {"id": "43755796", "type": "user"}}, "userBioTags": {"data": [{"id": "957496", "type": "userBioTag"}, {"id": "957497", "type": "userBioTag"}, {"id": "957498", "type": "userBioTag"}, {"id": "957499", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1327", "type": "authorResearch"}}}, "links": {"self": "/author/david-h-lerner", "profileUrl": "/author/david-h-lerner", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "101", "type": "tag", "attributes": {"slug": "ge", "name": "GE", "company": "General Electric Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "20", "type": "sector"}}}, "links": {"self": "/symbol/GE"}}, {"id": "2752", "type": "tag", "attributes": {"slug": "itw", "name": "ITW", "company": "Illinois Tool Works Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/ITW"}}, {"id": "917", "type": "tag", "attributes": {"slug": "nke", "name": "NKE", "company": "NIKE, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/NKE"}}, {"id": "1401", "type": "tag", "attributes": {"slug": "akam", "name": "AKAM", "company": "Akamai Technologies, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/AKAM"}}, {"id": "769", "type": "tag", "attributes": {"slug": "ba", "name": "BA", "company": "The Boeing Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/BA"}}, {"id": "547", "type": "tag", "attributes": {"slug": "ebay", "name": "EBAY", "company": "eBay Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/EBAY"}}, {"id": "148893", "type": "tag", "attributes": {"slug": "googl", "name": "GOOGL", "company": "Alphabet Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/GOOGL"}}, {"id": "3213", "type": "tag", "attributes": {"slug": "hon", "name": "HON", "company": "Honeywell International Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/HON"}}, {"id": "1017", "type": "tag", "attributes": {"slug": "intc", "name": "INTC", "company": "Intel Corporation", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/INTC"}}, {"id": "1120", "type": "tag", "attributes": {"slug": "lscc", "name": "LSCC", "company": "Lattice Semiconductor Corporation", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/LSCC"}}, {"id": "1714", "type": "tag", "attributes": {"slug": "mchp", "name": "MCHP", "company": "Microchip Technology Incorporated", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MCHP"}}, {"id": "1309", "type": "tag", "attributes": {"slug": "mu", "name": "MU", "company": "Micron Technology, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MU"}}, {"id": "1299", "type": "tag", "attributes": {"slug": "adi", "name": "ADI", "company": "Analog Devices, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/ADI"}}, {"id": "44151", "type": "tag", "attributes": {"slug": "now", "name": "NOW", "company": "ServiceNow, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/NOW"}}, {"id": "1150", "type": "tag", "attributes": {"slug": "nvda", "name": "NVDA", "company": "NVIDIA Corporation", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/NVDA"}}, {"id": "16316", "type": "tag", "attributes": {"slug": "nxpi", "name": "NXPI", "company": "NXP Semiconductors N.V.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/NXPI"}}, {"id": "401", "type": "tag", "attributes": {"slug": "smh", "name": "SMH", "company": "VanEck Semiconductor ETF", "tagKind": "Tags::Ticker", "equityType": "etf", "exchange": "NASDAQ", "fundTypeId": 1, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": true}, "relationships": {}, "links": {"self": "/symbol/SMH"}}, {"id": "2436", "type": "tag", "attributes": {"slug": "utx-defunct-2436", "name": "UTX", "company": "United Technologies Corporation", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": true, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/UTX-DEFUNCT-2436"}}, {"id": "420", "type": "tag", "attributes": {"slug": "xli", "name": "XLI", "company": "The Industrial Select Sector SPDR® Fund ETF", "tagKind": "Tags::Ticker", "equityType": "etf", "exchange": "NYSEARCA", "fundTypeId": 1, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": true}, "relationships": {}, "links": {"self": "/symbol/XLI"}}, {"id": "1016", "type": "tag", "attributes": {"slug": "amd", "name": "AMD", "company": "Advanced Micro Devices, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/AMD"}}, {"id": "599385", "type": "tag", "attributes": {"slug": "david-h-lerner", "name": "David H. Lerner", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/david-h-lerner"}}, {"id": "17190", "type": "tag", "attributes": {"slug": "portfolio-strategy-asset-allocation", "name": "Portfolio Strategy & Asset Allocation", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=portfolio-strategy-asset-allocation"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "17189", "type": "tag", "attributes": {"slug": "etf-portfolio-strategy", "name": "ETFs & Portfolio Strategy", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/etf-portfolio-strategy"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "77786", "type": "sentiment", "attributes": {"articleId": 4300432, "type": "very_bullish", "createdAt": "2019-10-30T13:55:32.000-04:00", "typeId": 0}, "relationships": {"article": {"data": {"id": "4300432", "type": "article"}}, "tag": {"data": {"id": "101", "type": "tag"}}}}, {"id": "77784", "type": "sentiment", "attributes": {"articleId": 4300432, "type": "bullish", "createdAt": "2019-10-30T13:55:32.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4300432", "type": "article"}}, "tag": {"data": {"id": "2752", "type": "tag"}}}}, {"id": "77785", "type": "sentiment", "attributes": {"articleId": 4300432, "type": "bullish", "createdAt": "2019-10-30T13:55:32.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "4300432", "type": "article"}}, "tag": {"data": {"id": "917", "type": "tag"}}}}]}