{"data": {"id": "3358785", "type": "fullArticle", "attributes": {"publishOn": "2015-07-28T06:15:00-04:00", "isLockedPro": false, "commentCount": 13, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"keuka-capital": {"id": 518206, "slug": "keuka-capital", "kind": "common", "non_theme": true}, "editors-picks": {"id": 1302, "slug": "editors-picks", "kind": "general", "path": "/editors-picks", "title": "Editors' Picks"}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "ati": {"id": 2607, "slug": "ati", "kind": "common", "non_theme": true}, "industrial-goods": {"id": 17913, "slug": "industrial-goods", "kind": "common", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "small-cap-insight": {"id": 103561, "slug": "small-cap-insight", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "metal-fabrication": {"id": 17927, "slug": "metal-fabrication", "kind": "common", "non_theme": true}, "materials": {"id": 15, "slug": "materials", "kind": "sector", "path": "/stock-ideas/basic-materials", "title": "Basic Materials", "sasource": "theme_breadcrumb"}}, "title": "After Sell-Off, Allegheny Technologies Incorporated Is Appropriately Priced For A Small, Speculative Entry Position", "summary": ["Allegheny Technologies Incorporated has sold off over 15% in five days and over 35% in YTD 2015.", "Lower nickel prices, weaker oil & gas demand, and a surge in foreign imports are negatively impacting volumes, prices, and margins.", "ATI has a strong secular aerospace tailwind at its back, providing some volume/sales ballast to the speculative investor whilst riding out current challenges.", "A recovery in nickel/crude oil prices, a weakening of the dollar, improved management/operational execution, and/or the entry of a strategic acquirer/activist investor are all upside catalysts for the stock.", "I believe ATI is now appropriately priced for a small, speculative-entry long position for speculative (non-value oriented) investors willing to take substantial risk and average down."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2015-07-28T06:15:00-04:00", "isModerated": false, "closestTradingDate": "2015-07-28", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, but may initiate a long position in ATI over the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Allegheny Technologies Incorporated's (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ATI\" title=\"ATI Inc.\">ATI</a></span>) recent fall from grace has been impressive. Despite high exposure to growing aerospace and defense end-markets, a confluence of factors, including weak nickel pricing, lower demand from oil &amp; gas customers, operational execution issues, poor management, and stronger foreign competition (from a strong US dollar) has led to a stock decline of 38.5%, versus the S&amp;P 500's 1% increase (not including dividends) in YTD 2015 (see Figure 1 below).</p> <p><strong>Figure 1</strong></p> <p><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/7/27/saupload_40423716_14379574070747_rId6.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/7/27/saupload_40423716_14379574070747_rId6_thumb1.png\" hspace=\"6\" vspace=\"6\" fetchpriority=\"high\"></a></span></p> <p><em>Source: Google Finance</em></p> <p>The stock's decline appears to be an all-out capitulation by investors. The buy side has waited years for ATI to turn things around and become at least somewhat more comparable to \"peers\" RTI, CRS, or HAYN. But it hasn't. And the recent sell-off reeks of long-term holders finally dumping shares.</p> <p>At current levels, though, ATI has become hard to ignore. While poor margins/free cash flow and poor management continue to haunt the stock, many weaknesses and fears appear to be baked in. And there are positives. The company's high-performance metals segment has undeniably strong aerospace and defense end-market tailwinds at its back, a higher-margin profile, and could make ATI the target of a strategic acquirer or an activist investor seeking to spin-off this segment. The stock now yields a surprising 3.4%, which (if ATI can shed costs and ramp up titanium production) appears to be sustainable (previously, the stock's dividend was always an afterthought). Prices of nickel have tanked with the global commodity rout and are trading near decade-lows, despite its use in specialty metals required in major industrial end-markets. And ATI's margins are tied to nickel, so should nickel prices improve, ATI's fortunes would improve with it.</p> <p>In short, blood is in the streets, and I believe that investors seeking a long-term, speculative investment with ties to commodity pricing (both oil and nickel) and aerospace &amp; defense growth<span class=\"paywall-full-content invisible\"> should now consider a small entry position in Allegheny Technologies Incorporated.</span></p> <p class=\"paywall-full-content invisible\"><strong>ATI is a steel and specialty metal supplier with two business segments</strong></p> <p class=\"paywall-full-content invisible\">Allegheny Technologies Incorporated makes stainless steel and specialty metal products in basic forms (bar, rod, plate) and precisely fabricated forms (for assembly into aircraft engines, for example). The company is separated into two divisions: 1) flat-rolled products, which (primarily) produces lower-value standard stainless steel products; and 2) high-performance metals, which (primarily) focuses on nickel-alloy and titanium smelting and fabrication. These are generalizations, as both segments work with nickel-alloys, for example, but the generalized view is that the flat-rolled segment has lower value-added products and the high performance segment has higher value-added products (read low and high margins, respectively). The high performance segment is an increasingly vertically integrated specialty metal supplier, now capable of Titanium sponge production through titanium part fabrication and Nickel-alloy part production from powder through part fabrication.</p> <p class=\"paywall-full-content invisible\"><strong>ATI's primary end-market - Aerospace &amp; Defense - provides a strong volume tailwind</strong></p> <p class=\"paywall-full-content invisible\">Allegheny Technologies Incorporated primarily delivers stainless steel and specialty metal products to the aerospace &amp; defense end-market (mostly for use in engines), as seen in Figure 2 below:</p> <p class=\"paywall-full-content invisible\"><strong>Figure 2</strong></p> <p class=\"paywall-full-content invisible\"><em><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/7/26/40423716-14379575270598626-Keuka-Capital_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/7/26/40423716-14379575270598626-Keuka-Capital.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></em></p> <p class=\"paywall-full-content invisible\"><em>Source: ATI June 2015 Investor Relations presentation</em></p> <p class=\"paywall-full-content invisible\">In the first half of 2015, the aerospace &amp; defense end-market comprised 37% of sales, up from 34% in 2014, driven by higher next-generation aircraft build-rates at Boeing (<a href=\"https://seekingalpha.com/symbol/BA\" title=\"The Boeing Company\">BA</a>) and Airbus (<a href=\"https://seekingalpha.com/symbol/EADSF\" title=\"Airbus SE\">OTCPK:EADSF</a>) (including the B737MAX, B787, and A350). Notably, ATI has higher dollar content on next-generation aircraft than legacy aircraft. For example, the company has <a href=\"https://ir.atimetals.com/phoenix.zhtml?c=98187&amp;p=irol-presentations\" rel=\"nofollow\">$1.1M of content</a> on every B737MAX built versus $0.55M of content on the prior legacy B737. Figure 3 below illustrates ATI's expected aircraft build-rates through 2019, illustrating the volume growth opportunity ahead in its aerospace &amp; defense end-market.</p> <p class=\"paywall-full-content invisible\"><strong>Figure 3</strong></p> <p class=\"paywall-full-content invisible\"><em><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/7/26/40423716-143795756159078-Keuka-Capital_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/7/26/40423716-143795756159078-Keuka-Capital.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></em></p> <p class=\"paywall-full-content invisible\"><em>Source: ATI June 2015 Investor Relations presentation</em></p> <p class=\"paywall-full-content invisible\">Higher dollar content on next-generation planes, combined with increasing build rates provide a secular aerospace tailwind for volume growth going forward.</p> <p class=\"paywall-full-content invisible\">Validating this end-market tailwind thesis, ATI's aerospace &amp; defense sales increased nearly 12% YoY in 1H15. But performance was lumpy, with strength in 1Q15 offset by declines in 2Q15. Customers appear to have re-stocked inventories in 1Q15, providing a temporary pop in revenue in that quarter, only for demand to subsequently drop off in 2Q15. ATI's aerospace &amp; defense volume is, in part, driven by customer inventory stocking and de-stocking; this can substantially impact the company's performance quarter-over-quarter. Nonetheless, 1H15 results demonstrate the continued ramp-up of aerospace volumes, even if volumes have been lumpy.</p> <p class=\"paywall-full-content invisible\"><strong>Oil &amp; gas and automotive end-market headwinds are weighing on company performance</strong></p> <p class=\"paywall-full-content invisible\">Countering aerospace end-market strength, ATI's exposure to oil &amp; gas end-markets has acted as a volume and pricing headwind in 2015 for all the known reasons (lower crude oil prices, declining rig count, and resulting deterioration in energy company CapEx). In Figure 4 below, we look at Baker Hughes' U.S. rig count, noting the dramatic decline in rig count as crude oil prices tanked.</p> <p class=\"paywall-full-content invisible\"><strong>Figure 4</strong></p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/7/40423716_14379574070747_rId9.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/7/40423716_14379574070747_rId9_thumb.jpg\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em>Source: Business Insider and Baker Hughes</em></p> <p class=\"paywall-full-content invisible\">In ATI's most recent 2Q15 earnings report - an unmitigated disaster characterized by lower selling prices, volumes, margins, and the postponement of the Rowley titanium and hot-rolled processing facility (HRPF) benefits - the company indicated that sales to oil &amp; gas end-markets declined substantially, down 17.5% QoQ from 1Q15. Surprisingly, though, 1H15 oil &amp; gas sales increased 7% YoY, from roughly <a href=\"https://ir.atimetals.com/phoenix.zhtml?c=98187&amp;p=irol-newsArticle&amp;ID=1949650\" rel=\"nofollow\">$358M (17% of total sales) in 1H14</a> to <a href=\"https://ir.atimetals.com/phoenix.zhtml?c=98187&amp;p=irol-newsArticle&amp;ID=2069408\" rel=\"nofollow\">$383M (18% of total sales) </a><a href=\"https://ir.atimetals.com/phoenix.zhtml?c=98187&amp;p=irol-newsArticle&amp;ID=2069408\" rel=\"nofollow\">in 1H15</a>. But this growth was driven by a large oil &amp; gas pipeline project, for which shipments are expected to be completed this month. The recent stock sell-off is, in part, being driven by investor fear that the bottom is \"nowhere in sight\" on the oil &amp; gas side - a fear that was piqued by 2Q15's poor results.</p> <p class=\"paywall-full-content invisible\">Another item for concern on the end-market front is the company's automotive exposure. Auto sales have skyrocketed in recent years, and the industry is producing a record numbers of cars. Yet, ATI's automotive end-market comprised 8% of total sales in 1H15, compared to 10% of sales in FY2014. That marks a significant decline in sales to the automotive market (assuming FY2014 is representative of 1H14), and possibly even a customer loss, as I would have expected sales to automotive customers to have risen with higher industry production. Yet, ATI's 2Q15 earnings call would lead one to believe that automotive end-market sales were strong in the quarter.</p> <p class=\"paywall-full-content invisible\">While oil &amp; gas and automotive end-market weakness is a concern, ATI is not an oil &amp; gas or automotive volume story (combined, they account for 26% of sales); it's an aerospace &amp; defense one (37% of sales), and that's an end-market in which ATI has secured long-term agreements with major players, including Boeing, Airbus, Pratt &amp; Whitney, and Rolls Royce (<a href=\"https://seekingalpha.com/symbol/RYCEY\" title=\"Rolls-Royce Holdings plc\">OTCPK:RYCEY</a>). The secular aerospace tailwinds at ATI's back are both compelling and more secure than any other end-market.</p> <p class=\"paywall-full-content invisible\"><strong>While aerospace &amp; defense drives long-term volume growth potential, margins are tied to nickel-pricing</strong></p> <p class=\"paywall-full-content invisible\">Nickel is used in the production of stainless steel and nickel alloys, which together comprise over 50% of ATI's product sales. Nickel is therefore a key input into ATI's smelting and metal production process. Intuitively, an investor would surmise that lower nickel pricing would be positive for ATI's margins as a primary input cost. However, this is not the case. On the contrary, its margins are positively correlated with nickel prices, as the company passes along the cost of higher nickel prices to customers (in the form of surcharges), and realizes lower pricing when nickel prices decline. Essentially, costs appear to rise faster than prices when nickel prices increase, and prices appear to fall faster than costs when nickel prices decrease; a dangerous combination.</p> <p class=\"paywall-full-content invisible\">As we can see in Figure 5 below, nickel pricing (at around $11,000 per tonne) is nearing a decade-low, driven, in part, by the strengthening dollar, and coinciding with a global commodity rout.</p> <p class=\"paywall-full-content invisible\"><strong>Figure 5</strong></p> <p class=\"paywall-full-content invisible\"><em><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/7/26/40423716-1437957599064534-Keuka-Capital_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/7/26/40423716-1437957599064534-Keuka-Capital.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></em></p> <p class=\"paywall-full-content invisible\"><em>Source: <a href=\"https://www.lme.com/metals/non-ferrous/nickel/#tab2\" rel=\"nofollow\">London Metal Exchange</a></em></p> <p class=\"paywall-full-content invisible\">And so it's not too surprising to see that ATI's stock price has closely tracked nickel pricing, as seen when comparing Figure 6 below with Figure 5 above.</p> <p class=\"paywall-full-content invisible\"><strong>Figure 6</strong></p> <p class=\"paywall-full-content invisible\"><em><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/7/26/40423716-1437957684070441-Keuka-Capital_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/7/26/40423716-1437957684070441-Keuka-Capital.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></em></p> <p class=\"paywall-full-content invisible\"><em>Source: Google Finance</em></p> <p class=\"paywall-full-content invisible\"><strong>Due to higher exposure to raw nickel and possible contractual weakness, ATI's margins are near its peers' lows</strong></p> <p class=\"paywall-full-content invisible\">Relative to its peers, Allegheny Technologies Incorporated is struggling. The company has lower margins and free cash flow than other specialty metal suppliers, in part because most peers are not encumbered by a large flat-rolled stainless steel product business that has become increasingly commoditized and subject to foreign competition (resulting in lower volumes and margins). The strengthening of the US dollar has not helped, as foreign stainless steel has become more competitive relative to only one year ago. And ATI is feeling the effects.</p> <p class=\"paywall-full-content invisible\">In Figure 7 below, we look at some basic latest fiscal year ratios as provided by Google Finance. Suffice to say, ATI's margins are lower than specialty metal competitors, which has caused EPS to plummet and P/E ratios to skyrocket.</p> <p class=\"paywall-full-content invisible\"><strong>Figure 7</strong></p> <p class=\"paywall-full-content invisible\"><em><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/7/26/40423716-14379576977569273-Keuka-Capital_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/7/26/40423716-14379576977569273-Keuka-Capital.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></em></p> <p class=\"paywall-full-content invisible\"><em>Source: Google Finance</em></p> <p class=\"paywall-full-content invisible\">There are other items worth noting in Figure 7 above. ATI's capital structure, in terms of long-term debt to assets, is in line with that of its peers. The company's current ratio is a healthy 2.6x and in line with peers. And it now sports one of the lower price-to-sales multiples in the industry - a multiple that would suggest that ATI is solely focused on low-value added stainless steel products. And this, we know, is increasingly not the case as ATI's nickel-alloy and titanium product sales grow as a portion of total volumes, revenue, and operating profit.</p> <p class=\"paywall-full-content invisible\"><strong>Operating execution mishaps and non-existent management credibility are exacerbating the low nickel pricing (margin) environment</strong></p> <p class=\"paywall-full-content invisible\">In May 2015, Allegheny Technologies Incorporated announced the discovery of a defective rotary crop shear during routine maintenance at its new Hot-Rolling and Processing Facility (HRPF). The company has invested roughly $1.3B in constructing the new HRPF, which is expected to generate $150M-250M in cost benefits annually relative to the legacy operation. However, whereas these cost benefits were anticipated to begin harvesting in 2015, the rotary crop shear incident has pushed expected benefits into 2016, <a href=\"https://ir.atimetals.com/phoenix.zhtml?c=98187&amp;p=irol-newsArticle&amp;ID=2054239\" rel=\"nofollow\">according to ATI management</a>.</p> <p class=\"paywall-full-content invisible\">When you consider that ATI has a history of unfulfilled promises and projects that have gone over-schedule or were poorly executed, this latest mishap, combined with poor 2Q15 results, represented the last nails in the proverbial coffin. And investors have dumped shares as a result. Management has sold the line that \"this is the year that we will begin harvesting passed CapEx deployment\" for several years now. And yet, benefits from the Rowley titanium site and the HRPF are less than expected, or delayed, or both. Management credibility is, therefore, now a key issue when considering an investment in ATI. On the other hand, this could represent an opportunity for a savvy activist investor willing to get his/her hands dirty.</p> <p class=\"paywall-full-content invisible\">At some point, management (whether current or new) will straighten things out. The move to vertically integrate its titanium supply chain was a smart move with \"so-so\" execution. It theoretically allows ATI to purchase titanium sponge at a lower cost and with less price volatility. The HRPF decision is more questionable, in my opinion, as the facility's products are less value-added and subject to more commoditized foreign competition.</p> <p class=\"paywall-full-content invisible\"><strong>Free cash flow should strengthen, supporting ATI's dividend and servicing debt</strong></p> <p class=\"paywall-full-content invisible\">ATI's free cash flow has been a marked weakness of the company over the past five years. As illustrated in Figure 8 below, high capital expenditures have been driven primarily by the development of the Rowley, UT titanium sponge facility and the HRPF. As a result, free cash flow has been negative for two of the last three years.</p> <p class=\"paywall-full-content invisible\"><strong>Figure 8</strong></p> <p class=\"paywall-full-content invisible\"><em><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2015/7/26/40423716-14379577334535697-Keuka-Capital_origin.jpg\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2015/7/26/40423716-14379577334535697-Keuka-Capital.jpg\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></em></p> <p class=\"paywall-full-content invisible\"><em>Source: ATI June 2015 Investor Relations presentation</em></p> <p class=\"paywall-full-content invisible\">Management has touted each successive year as the year that free cash flow would permanently move higher, as CapEx recedes and ATI harvests the benefits of prior deployment. If current or new management can successfully make this transition (from growth-oriented capital deployment to execution and harvesting), I believe free cash flow should begin improving over the next few years. With stronger FCF on the horizon, I believe ATI's current dividend yield of 3.4% is sustainable (requiring roughly $77M annually), and now represents an important supporting mechanism for the stock at current price levels.</p> <p class=\"paywall-full-content invisible\">On the debt side, ATI has net debt of $1.27B as of 2Q15, compared to book shareholder's equity of $2.6B (37% debt-to-equity ratio). I believe the company can service its debt load (roughly $100M annually of interest expense) and sustain the current dividend through free cash flow, beginning in 2016. Supporting this view, FY2014 EBITDA was <a href=\"https://www.sec.gov/Archives/edgar/data/1018963/000101896315000005/atify201410-k.htm\" rel=\"nofollow\">$283M</a>, with roughly 2.8x expected annual interest expense in FY2015 and enough left over to cover the dividend.</p> <p class=\"paywall-full-content invisible\"><strong>ATI trades below the book value of its equity, but above peers on EV/EBITDA</strong></p> <p class=\"paywall-full-content invisible\">The company current trades at a market cap of $2.34B, compared to shareholders' equity book value of $2.7B. That translates into a price-to-book (P/B) of 0.87x, indicative of the market's view that ATI's returns on capital deployed will not exceed its weighted average cost of capital. I see the P/B ratio as one more sign that investor fears are beginning to dominate the stock.</p> <p class=\"paywall-full-content invisible\">On an EV/EBITDA basis, ATI is now trading at a FY2014 EV/EBITDA ratio of 12.8x ($3,610M Enterprise Value divided by $283M FY2014 EBITDA). Relative to annualized 1H2015 EBITDA of $289M ($144.5M through 2Q15), that ratio improves marginally. Adjusting for $10.8M of start-up and qualification costs, annualized 1H15 adjusted EBITDA of $340M implies an EV/EBITDA ratio of 10.6x. Considering that 2H15 results may continue to be negatively impacted by oil &amp; gas weakness, foreign exchange/competition headwinds, and continued nickel pricing weakness, one can reasonably expect ATI to report FY2015 adjusted EBITDA roughly in line with FY2014, which brings us back to the 12.8x ratio; within the realm of reason for ATI, but above that of peers (USAP, CRS, PCP) trading in the 7x-11x TTM EV/EBITDA range (according to Yahoo Finance).</p> <p class=\"paywall-full-content invisible\">There are precedent transactions worth considering. Alcoa (<a href=\"https://seekingalpha.com/symbol/AA\" title=\"Alcoa Corporation\">AA</a>) announced the acquisition of RTI for 13x TTM EV/EBITDA in early 2015, but RTI is a titanium business with a higher value-added product portfolio than ATI, which had only 15% titanium sales in FY2014 (an amount that will increase going forward, but nonetheless, a minority portion of its sales). And Alcoa expects to realize strong sales growth and margin expansion in the acquired business, implying far lower EV/EBITDA valuation expectations on a go-forward basis.</p> <p class=\"paywall-full-content invisible\">One has to adopt a similar improvement view to understand ATI's current valuation. Relative to peers, it still looks expensive, with room to drop further. But the possibility that ATI is acquired by a larger competitor, that an activist steps in and replaces management and/or spins off the high-performance metals segment, or that current management can (finally) turn things around all point to far higher EBITDA in future years, implying lower EV/EBITDA ratios. And that poses upside to the stock at the current levels.</p> <p class=\"paywall-full-content invisible\"><strong>The same factors driving current financial weakness could pose upside, should they reverse</strong></p> <p class=\"paywall-full-content invisible\">At current levels, many of the major risks to ATI are well known and (arguably) baked in. Low nickel prices, strong foreign competition driving lower volumes, zero management credibility, and oil &amp; gas end-market erosion are all known quantities. And each of these factors, should they turn around over the next few years, pose upside to ATI's business. A recovery in oil prices could re-start drilling rig count in North America, pushing the company's volumes higher (and volumes matter in this high-fixed cost business, as incremental volumes absorb fixed costs). The reversal of YTD 2015 US dollar strength could make foreign imports less competitive, leading to higher volumes sold. And higher nickel pricing - the king of them all - would lead to expanding margins and a rapid increase in profitability.</p> <p class=\"paywall-full-content invisible\"><strong>There are many reasons insiders sell, and only one reason they buy - ATI insider are buying</strong></p> <p class=\"paywall-full-content invisible\">The old adage above rings true in this case. Insiders may sell company stock for many reasons, including paying for children's/grandchildren's college educations, to buy that second (or tenth) house they've always wanted, or simply to diversify their investment portfolios. But insider buying only represents one thing: insiders believe current prices are favorable relative to the intrinsic value of the company.</p> <p class=\"paywall-full-content invisible\">And insiders at Allegheny Technologies are accumulating shares at these record low prices. On July 23rd, ATI's CEO and CMO acquired <a href=\"https://www.lulegacy.com/2015/07/25/insider-buying-richard-j-harshman-buys-20000-shares-of-allegheny-technologies-stock-ati/560081/\" rel=\"nofollow\">$415K</a> and $48K of company stock, respectively. That brings Mr. Richard Harshman's (CEO) total holdings to over $10M. One might say he has skin in the game and significant incentive to turns things around; the opportunity is there to do just that.</p> <p class=\"paywall-full-content invisible\"><strong>ATI is now priced appropriately for a speculative, long-term entry position</strong></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">The company has many headwinds, but they appear to be known and (at least partially) baked into the current stock price. A reversal of these headwinds, the potential that a strategic acquirer or activist investor comes along, or the spin-off of more profitable business segments are all possible catalysts that would drive the stock higher. With insiders now buying the stock, I believe now is an appropriate time for speculative (non-value oriented) investors to establish a small, speculative long-term holding in Allegheny Technologies Incorporated, noting the very real possibility that the lows are not yet in and further accumulation may be necessary to realize a high return on your investment. But when you consider strong (and ramping) aerospace volume tailwinds and nickel pricing approaching record lows, I like speculative investors' chances here.</p>", "twitContent": "$ATI - After Sell-Off, Allegheny Technologies Incorporated Is Appropriately Priced For A Small, Speculative Entry Position. https://seekingalpha.com/article/3358785-after-sell-off-allegheny-technologies-incorporated-is-appropriately-priced-for-a-small-speculative-entry-position?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "89426", "type": "author"}}, "sentiments": {"data": [{"id": "159451", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2607", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "518206", "type": "tag"}, {"id": "1302", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17913", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "103561", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17927", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/3358785-after-sell-off-allegheny-technologies-incorporated-is-appropriately-priced-for-a-small-speculative-entry-position", "canonical": "https://seekingalpha.com/article/3358785-after-sell-off-allegheny-technologies-incorporated-is-appropriately-priced-for-a-small-speculative-entry-position", "uriImage": "https://static.seekingalpha.com/uploads/2015/7/27/saupload_40423716_14379574070747_rId6.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2015/7/27/saupload_40423716_14379574070747_rId6.png"}}}, "included": [{"id": "89426", "type": "author", "attributes": {"company": null, "slug": "keuka-capital", "userId": 40423716, "tagId": 518206, "bio": "<p>Keuka Capital, LLC is an unregistered investment advisor that partners with clients to manage their investment account. Keuka Capital has a long-term, value-oriented approach to evaluating investments opportunities and building client portfolios. Our client portfolios are typically comprised of fifteen to twenty individual stocks complemented by low-cost bond and commodity exchange traded funds. Contrarian by nature, Keuka Capital tends to open long positions in out-of-favor stocks that are trading below their intrinsic value. Keuka Capital is incubating a total return fund with the objective of maximizing risk-adjusted returns over the long-term. Please see www.keukacapital.com for more information. </p>", "image": {"small": "https://static.seekingalpha.com/images/users_profile/040/423/716/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/040/423/716/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/040/423/716/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/040/423/716/extra_large_pic.png"}, "nick": "Keuka Capital", "deactivated": null, "memberSince": 2015, "isRss": false, "contributorSince": 2015, "followersCount": 563}, "relationships": {"user": {"data": {"id": "40423716", "type": "user"}}, "userBioTags": {"data": [{"id": "914756", "type": "userBioTag"}, {"id": "914757", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/keuka-capital", "profileUrl": "/author/keuka-capital", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2607", "type": "tag", "attributes": {"slug": "ati", "name": "ATI", "company": "ATI Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "15", "type": "sector"}}}, "links": {"self": "/symbol/ATI"}}, {"id": "518206", "type": "tag", "attributes": {"slug": "keuka-capital", "name": "Keuka Capital", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/keuka-capital"}}, {"id": "1302", "type": "tag", "attributes": {"slug": "editors-picks", "name": "Editors' Picks", "company": null, "tagKind": "Tags::SpecialType"}, "links": {"self": "/listing/editors-picks"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17913", "type": "tag", "attributes": {"slug": "industrial-goods", "name": "Industrial Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/industrial-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "103561", "type": "tag", "attributes": {"slug": "small-cap-insight", "name": "PRO", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/small-cap-insight"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17927", "type": "tag", "attributes": {"slug": "metal-fabrication", "name": "Metal Fabrication", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/metal-fabrication"}}, {"id": "159451", "type": "sentiment", "attributes": {"articleId": 3358785, "type": "bullish", "createdAt": "2015-07-28T06:15:00.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "3358785", "type": "article"}}, "tag": {"data": {"id": "2607", "type": "tag"}}}}]}