{"data": {"id": "2206623", "type": "fullArticle", "attributes": {"publishOn": "2014-05-09T11:26:47-04:00", "isLockedPro": false, "commentCount": 1, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"valuentum": {"id": 34650, "slug": "valuentum", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "mat": {"id": 1748, "slug": "mat", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Why Hasbro Still Has Material Upside", "summary": ["Though physical toy demand continues to face pressure, Hasbro's performance has been resilient.", "The company is one of our favorite dividend growth ideas, having paid dividends since 1977. It has a strong Valuentum Dividend Cushion score.", "Hasbro registers a 6 on the Valuentum Buying Index, a solid rating."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2014-05-09T11:26:47-04:00", "isModerated": false, "closestTradingDate": "2014-05-09", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Is there really a physical toy maker in this digital age that has a strong and growing dividend? The answer is yes. It's Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>). Let's take a look at the firm's business, calculate a cash-flow-derived intrinsic value estimate, and evaluate the company through the Valuentum style.</p> <p>But first, a little background to help with the understanding of some of the terminology in this piece. At our boutique research firm, we think a comprehensive analysis of a firm's discounted cash flow valuation, relative valuation versus industry peers, as well as an assessment of technical and momentum indicators is the best way to identify the most attractive stocks at the best time to buy. We think stocks that are cheap (undervalued) and just starting to go up (momentum) are some of the best ones to evaluate for addition to the portfolios. These stocks have both strong valuation and pricing support. This process culminates in what we call our Valuentum Buying Index, which ranks stocks on a scale from 1 to 10, with 10 being the best.</p> <p><img src=\"https://static.seekingalpha.com/uploads/2014/4/27/saupload_Keynes_beauty_for_13_steps_thumb1.jpg\" fetchpriority=\"high\"></p> <p>Most stocks that are cheap and just starting to go up are also adored by value, growth, GARP, and momentum investors, all the same and across the board. Though we are purely fundamentally-based investors, we find that the stocks we like (underpriced stocks with strong momentum) are the ones that are soon to be liked by a large variety of money managers. We think this characteristic is partly responsible for the outperformance of our ideas -- as they are soon to experience heavy buying interest. Regardless of a money manager's focus, the Valuentum process covers the bases.</p> <p>We liken stock selection to a modern-day beauty contest. In order to pick the winner of a beauty contest, one must know the preferences of the judges of a beauty<span class=\"paywall-full-content invisible\"> contest. The contestant that is liked by the most judges will win, and in a similar respect, the stock that is liked by the most money managers will win. We may have our own views on which companies we like or which contestant we like, but it doesn't matter much if the money managers or judges disagree. That's why we focus on the DCF -- that's why we focus on relative value -- and that's why we use technical and momentum indicators. We think a comprehensive and systematic analysis applied across a coverage universe is the key to outperformance. We are tuned into what drives stocks higher and lower. Some investors know no other way to invest than the Valuentum process. They call this way of thinking common sense.</span></p> <p class=\"paywall-full-content invisible\">At the methodology's core, if a company is undervalued both on a discounted cash flow basis and on a relative valuation basis, and is showing improvement in technical and momentum indicators, it scores high on our scale. Hasbro posts a <a href=\"https://www.valuentum.com/articles/20110622\" rel=\"nofollow\">Valuentum Buying Index</a> score of 6, reflecting our \"fairly valued\" DCF assessment of the firm, its neutral relative valuation versus peers, and bullish technicals. This is a solid score. Even though the firm does not generate the highest rating of a 9/10 (equivalent to a \"we'd consider buying\" rating), a 6 is a better score than most in our expansive coverage universe, and the company's dividend yield of 3.1% at the time of this writing is worth a look. With that said, let's now dig into the report.</p> <p class=\"paywall-full-content invisible\"><strong>Hasbro's Investment Considerations</strong></p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994687784380562-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><strong>Investment Highlights</strong></p> <p class=\"paywall-full-content invisible\">• Hasbro's business quality (an evaluation of our ValueCreation™ and ValueRisk™ ratings) ranks among the best of the firms in our coverage universe. The firm has been generating economic value for shareholders with relatively stable operating results for the past few years, a combination we view very positively. The company has a solid <a href=\"https://www.valuentum.com/articles/Valuentums_Economic_Castle_Rating\" rel=\"nofollow\">Economic Castle</a>™ rating, too.</p> <p class=\"paywall-full-content invisible\">• Hasbro's products include toys/games, television programming, motion pictures and digital gaming. The firm owns well-known brands such as Transformers, Nerf, Playskool, My Little Pony, G.I. Joe, Magic: The Gathering, and Monopoly.</p> <p class=\"paywall-full-content invisible\">• Hasbro has a good combination of strong free cash flow generation and manageable financial leverage. We expect the firm's free cash flow margin to average about 11.8% in coming years. Total debt-to-EBITDA was 2 last year, while debt-to-book capitalization stood at 45.4%.</p> <p class=\"paywall-full-content invisible\">• Hasbro is focused on re-igniting its world-class portfolio of brands. The company is targeting long term revenue CAGR of 5%, operating profit to exceed revenue expansion, and operating cash flow to average roughly $500 million annually.</p> <p class=\"paywall-full-content invisible\">• We're big fans of Hasbro's dividend growth potential. Plus, the company has been paying dividends since 1977, so its track record is fantastic. The firm has a strong Valuentum <a href=\"https://www.valuentum.com/articles/20111126\" rel=\"nofollow\">Dividend Cushion</a> score.</p> <p class=\"paywall-full-content invisible\">• Hasbro has fared much better than its peer Mattel (<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a>), and we made a great call in choosing Hasbro over its peer in the Dividend Growth portfolio. In a difficult revenue environment for physical toys, Hasbro still grew revenue 2% in <a href=\"https://investor.hasbro.com/releasedetail.cfm?ReleaseID=841244\" rel=\"nofollow\">its first quarter</a> thanks to strength in its international segment and its licensing business.</p> <p class=\"paywall-full-content invisible\"><strong>Business Quality</strong></p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994687920948753-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><strong>Economic Profit Analysis</strong></p> <p class=\"paywall-full-content invisible\">The best measure of a firm's ability to create value for shareholders is expressed by comparing its return on invested capital with its weighted average cost of capital. The gap or difference between ROIC and WACC is called the firm's economic profit spread. Hasbro's 3-year historical return on invested capital (without goodwill) is 39.5%, which is above the estimate of its cost of capital of 9.8%. As such, we assign the firm a ValueCreation™ rating of EXCELLENT. In the chart below, we show the probable path of ROIC in the years ahead based on the estimated volatility of key drivers behind the measure. The solid grey line reflects the most likely outcome, in our opinion, and represents the scenario that results in our fair value estimate.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994688079090571-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-1399468815073463-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><strong>Cash Flow Analysis</strong></p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994688296970778-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Firms that generate a free cash flow margin (free cash flow divided by total revenue) above 5% are usually considered cash cows. Hasbro's free cash flow margin has averaged about 10.7% during the past 3 years. As such, we think the firm's cash flow generation is relatively STRONG. The free cash flow measure shown above is derived by taking cash flow from operations less capital expenditures and differs from enterprise free cash flow (FCFF), which we use in deriving our fair value estimate for the company. For more information on the differences between these two measures, please visit our website at Valuentum.com. At Hasbro, cash flow from operations increased about 48% from levels registered two years ago, while capital expenditures expanded about 13% over the same time period.</p> <p class=\"paywall-full-content invisible\"><strong>Valuation Analysis</strong></p> <p class=\"paywall-full-content invisible\">Our discounted cash flow model indicates that Hasbro's shares are worth between $50-$76 each. Shares are trading at roughly $55 each at the time of this writing, below the midpoint of the fair value range (fair value estimate = $63 per share). The margin of safety around our fair value estimate is driven by the firm's LOW ValueRisk™ rating, which is derived from the historical volatility of key valuation drivers. Our model reflects a compound annual revenue growth rate of 4.2% during the next five years, a pace that is higher than the firm's 3-year historical compound annual growth rate of 0.7%. The five-year revenue forecast is front-end loaded, with revenue expected to expand 7% in 2014 and fade to 3% in 2018. Our model reflects a 5-year projected average operating margin of 15.6%, which is above Hasbro's trailing 3-year average. We're expecting efficiency improvements and higher-margin licensing revenue to drive the profit margin expansion. Beyond year 5, we assume free cash flow will grow at an annual rate of 2.3% for the next 15 years and 3% in perpetuity. For Hasbro, we use a 9.8% weighted average cost of capital to discount future free cash flows.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994688407952564-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994688499347332-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">We understand the critical importance of assessing firms on a relative value basis, versus both their industry and peers. Many institutional money managers -- those that drive stock prices -- pay attention to a company's price-to-earnings ratio and price-earnings-to-growth ratio in making buy/sell decisions. With this in mind, we have included a forward-looking relative value assessment in our process to further augment our rigorous discounted cash flow process. If a company is undervalued on both a price-to-earnings ratio and a price-earnings-to-growth ratio versus industry peers, we would consider the firm to be attractive from a relative value standpoint. For relative valuation purposes, we compare Hasbro to peers a variety of industry peers, including competitor Mattel.</p> <p class=\"paywall-full-content invisible\"><em><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-1399468861817929-Valuentum_origin.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-1399468861817929-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></em></p> <p class=\"paywall-full-content invisible\"><strong>Margin of Safety Analysis</strong></p> <p class=\"paywall-full-content invisible\">Our discounted cash flow process values each firm on the basis of the present value of all future free cash flows. Although we estimate the firm's fair value at about $63 per share, every company has a range of probable fair values that's created by the uncertainty of key valuation drivers (like future revenue or earnings, for example). After all, if the future was known with certainty, we wouldn't see much volatility in the markets as stocks would trade precisely at their known fair values. Our ValueRisk™ rating sets the margin of safety or the fair value range we assign to each stock. In the graph below, we show this probable range of fair values for Hasbro. We think the firm is attractive below $50 per share (the green line), but quite expensive above $76 per share (the red line). The prices that fall along the yellow line, which includes our fair value estimate, represent a reasonable valuation for the firm, in our opinion.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994688731160996-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><strong>Future Path of Fair Value</strong></p> <p class=\"paywall-full-content invisible\">We estimate Hasbro's fair value at this point in time to be about $63 per share. As time passes, however, companies generate cash flow and pay out cash to shareholders in the form of dividends. The chart below compares the firm's current share price with the path of Hasbro's expected equity value per share over the next three years, assuming our long-term projections prove accurate. The range between the resulting downside fair value and upside fair value in Year 3 represents our best estimate of the value of the firm's shares three years hence. This range of potential outcomes is also subject to<br>change over time, should our views on the firm's future cash flow potential change. The expected fair value of $79 per share in Year 3 represents our existing fair value per share of $63 increased at an annual rate of the firm's cost of equity less its dividend yield. The upside and downside ranges are derived in the same way, but from the upper and lower bounds of our fair value estimate range.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994688917561982-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><strong>Pro Forma Financial Statements</strong></p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994689022883146-Valuentum_origin.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994689022883146-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994689102655687-Valuentum_origin.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994689102655687-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994689206642308-Valuentum_origin.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2014/5/7/933684-13994689206642308-Valuentum.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">In the spirit of transparency, we show how the performance of the Valuentum Buying Index has stacked up per underlying score as it relates to firms in the <a href=\"https://www.valuentum.com/categories/20110616\" rel=\"nofollow\">Best Ideas portfolio</a>. Past results are not a guarantee of future performance.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2013/11/3/saupload_Performance_10_26_2013_final_thumb1.jpg\" loading=\"lazy\"></p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\"><strong>Disclosure: </strong>I have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.</p>", "twitContent": "$HAS - Why Hasbro Still Has Material Upside. https://seekingalpha.com/article/2206623-why-hasbro-still-has-material-upside?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "24491", "type": "author"}}, "sentiments": {"data": []}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "1748", "type": "tag"}]}, "otherTags": {"data": [{"id": "34650", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/2206623-why-hasbro-still-has-material-upside", "canonical": "https://seekingalpha.com/article/2206623-why-hasbro-still-has-material-upside", "uriImage": "https://static.seekingalpha.com/uploads/2014/4/27/saupload_Keynes_beauty_for_13_steps_thumb1.jpg", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2014/4/27/saupload_Keynes_beauty_for_13_steps_thumb1.jpg"}}}, "included": [{"id": "24491", "type": "author", "attributes": {"company": null, "slug": "valuentum", "userId": 933684, "tagId": 34650, "bio": "<p>We offer subscriptions and exclusive newsletters. Visit our website at www.valuentum.com for more information. Valuentum is an independent investment research publisher, offering premium equity reports and dividend reports, as well as commentary across all sectors/companies, a Best Ideas Newsletter (spanning market caps, asset classes), a Dividend Growth Newsletter, modeling tools/products, and more. Valuentum is based in the Chicagoland area. Valuentum is not a money manager, broker, or financial advisor. Valuentum is a publisher of financial information. Please read our Disclaimer that applies to all articles published on Seeking Alpha: https://www.valuentum.com/categories/20110613. Follow us on Twitter: @Valuentum</p>", "image": {"small": "https://static.seekingalpha.com/images/users_profile/000/933/684/small_pic.png", "medium": "https://static.seekingalpha.com/images/users_profile/000/933/684/medium_pic.png", "big": "https://static.seekingalpha.com/images/users_profile/000/933/684/big_pic.png", "extra_large": "https://static.seekingalpha.com/images/users_profile/000/933/684/extra_large_pic.png"}, "nick": "Valuentum", "deactivated": null, "memberSince": 2011, "isRss": false, "contributorSince": 2011, "followersCount": 17929}, "relationships": {"user": {"data": {"id": "933684", "type": "user"}}, "userBioTags": {"data": [{"id": "956533", "type": "userBioTag"}, {"id": "956534", "type": "userBioTag"}, {"id": "956535", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/valuentum", "profileUrl": "/author/valuentum", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "1748", "type": "tag", "attributes": {"slug": "mat", "name": "MAT", "company": "Mattel, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MAT"}}, {"id": "34650", "type": "tag", "attributes": {"slug": "valuentum", "name": "Valuentum", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/valuentum"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}]}