{"data": {"id": "2468505", "type": "fullArticle", "attributes": {"publishOn": "2014-09-03T14:31:56-04:00", "isLockedPro": false, "commentCount": 0, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"negative-returns": {"id": 166235, "slug": "negative-returns", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "ati": {"id": 2607, "slug": "ati", "kind": "common", "non_theme": true}, "industrial-goods": {"id": 17913, "slug": "industrial-goods", "kind": "common", "path": "/stock-ideas/industrial-goods", "title": "Industrial ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "metal-fabrication": {"id": 17927, "slug": "metal-fabrication", "kind": "common", "non_theme": true}, "materials": {"id": 15, "slug": "materials", "kind": "sector", "path": "/stock-ideas/basic-materials", "title": "Basic Materials", "sasource": "theme_breadcrumb"}}, "title": "Specialty Metals Firm Allegheny Technologies Up 60% In The Past Year", "summary": ["ATI's portfolio focuses on high-value specialty-metal products such as super nickel alloys and titanium.", "The Aerospace and Defense segment, which accounts for 35% of sales, is in the midst of a cyclical rebound.", "ATI's new Hot-Rolling and Processing Facility will result in higher capacity and improved operational efficiencies."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2015-02-18T02:59:02-05:00", "isModerated": false, "closestTradingDate": "2014-09-03", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>The author has no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> The author wrote this article themselves, and it expresses their own opinions. The author is not receiving compensation for it (other than from Seeking Alpha). The author has no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Allegheny Technologies Incorporated (<span class=\"ticker-hover-wrapper\">NYSE:<a href=\"https://seekingalpha.com/symbol/ATI\" title=\"ATI Inc.\">ATI</a></span>) is a specialty materials and component producer. The following <a href=\"https://ir.atimetals.com/phoenix.zhtml?c=98187&amp;p=irol-reportsannual\" rel=\"nofollow\">image</a> taken from the 2013 Annual Report breaks down ATI sales by industry:</p> <p><img src=\"https://static.seekingalpha.com/uploads/2014/9/2/7756551-14096927458000593-Negative-Returns.png\" hspace=\"6\" vspace=\"6\" fetchpriority=\"high\"></p> <p><strong>Markets Served</strong></p> <p>Aerospace and Defense</p> <p>ATI produces premium titanium alloys, nickel and cobalt-based alloys, superalloys, and vacuum-melted specialty alloys used in the manufacture of components for commercial and military jet engines, airframes and missiles.</p> <p>Titanium and titanium alloys are used to produce jet engine components such as blades, vanes, discs, and casings, and airframe components such as structural members, landing gear, hydraulic systems, and fasteners. Nickel-based alloys and superalloys remain extremely strong at high temperatures and resist degradation under extreme conditions. Typical aerospace applications for nickel-based alloys and superalloys and advanced powder alloys include jet engine shafts, discs, blades, vanes, rings and casings.</p> <p>Oil and Gas and Chemical Process Industry</p> <p>The environments in which oil and gas can be found in commercial quantities have become more challenging, involving deep offshore wells, high pressure and high temperature conditions in sour wells and unconventional sources, such as shale oil and gas, and oil sands. ATI's Datalloy 2 and Datalloy HP specialty stainless are used for non-magnetic drill collars that enable directional and horizontal drilling techniques to be guided to the exact position desired for reservoirs.</p> <p>Electrical Energy</p> <p>ATI manufactures corrosion-resistant alloys (CRAs) for coal, nuclear, and natural gas applications. In coal-fired plants, CRAs are used for pipe, tube, and heat exchanger applications in water systems. In nuclear power plants, CRAs are used in water systems, fuel cladding components, and process equipment. In natural gas land-based turbines, large diameter nickel-based superalloys are used for power generation. ATI alloys are also used for solar, fuel cell and geothermal applications.</p> <p><strong>Operations</strong></p> <p>ATI has two business segments:</p> <p>1. High Performance Metals</p> <p>The following image from the 2013 Annual Report breaks<span class=\"paywall-full-content invisible\"> down High Performance Metals segment by products and industry served:</span></p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2014/9/2/7756551-14096927870028145-Negative-Returns_origin.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2014/9/2/7756551-14096927870028145-Negative-Returns.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Approximately 64% of High Performance Metals segment revenue is derived from the aerospace and defense market. The Boeing Company, Bombardier, Embraer, GE Aviation, Pratt &amp; Whitney and Rolls-Royce form a substantial part of the customer base in this business segment. The following image (from the 2013 Annual Report) breaks down the segment's performance in FY 2012 and 2013:</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2014/9/2/7756551-14096928184930627-Negative-Returns.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Reasons for the decline in segment revenue and operating profit can be found in the <a href=\"https://yahoo.brand.edgar-online.com/displayfilinginfo.aspx?FilingID=9816307-920-535451&amp;type=sect&amp;TabIndex=2&amp;companyid=4515&amp;ppu=%252fdefault.aspx%253fcik%253d1018963\" rel=\"nofollow\">10-K</a>:</p> <blockquote class=\"quote paywall-full-content invisible\"><p>Sales in 2013 decreased 16% to $1.95 billion, with sales to the aerospace and defense market down $170.9 million, or 12%, primarily due to lower raw material surcharges/indices and continued aggressive supply chain inventory management in the jet engine market. Sales to the oil and gas market declined 27%, or $63.0 million, in 2013 and were impacted by falling nickel raw material surcharges and by destocking in the oil and gas supply chain. Sales to the medical market declined 3%, as volume increases were offset by declines in selling prices. Operating profit for the High Performance Metals segment was $209.1 million, or 10.8% of sales, in 2013, compared to $385.4 million or 16.7% of sales in 2012. Results for 2013 reflect lower mill product shipment volume for all specialty materials mill products, as well as lower demand for forged and cast products. High Performance Metals segment operating profit in 2013 also includes a $35.0 million inventory valuation reserve, reflecting a reduction in the carrying value of LIFO-based inventory in the segment, which exceeded current replacement cost, to its net realizable value.</p></blockquote> <p class=\"paywall-full-content invisible\">2. Flat-Rolled Products</p> <p class=\"paywall-full-content invisible\">The following image (from the 2013 Annual Report) breaks down the Flat-Rolled Products segment by products and industry served:</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2014/9/2/7756551-14096929469887772-Negative-Returns_origin.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2014/9/2/7756551-14096929469887772-Negative-Returns.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">This segment produces and distributes plate, sheet, engineered strip, and rolled strip products, as well as grain-oriented electrical steel. In 2013, approximately:</p> <ul class=\"paywall-full-content invisible\"> <li>50% by volume of stainless sheet products were sold to independent service centers, which have slitting, cutting or other processing facilities, with the remainder sold directly to end-use customers.</li> <li>90% of engineered strip and rolled strip products were sold directly to end-use customers or through ATI's distribution network, with the remainder sold to independent service centers.</li> <li>55% of plate products were sold to independent service centers, with the remainder sold directly to end-use customers.</li> </ul> <p class=\"paywall-full-content invisible\">The following image (from the 2013 Annual Report) breaks down the segment's performance in FY 2012 and 2013:</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2014/9/2/7756551-14096930604634411-Negative-Returns.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Reasons for the decline in segment revenue and operating profit can be found in the 10-K:</p> <blockquote class=\"quote paywall-full-content invisible\"><p>In our Flat-Rolled Products segment, sales decreased 11% in 2013 to $2.10 billion, primarily as a result of lower raw material surcharges and reduced base prices for most products. Total product shipments were flat compared to 2012, as shipments of standard stainless products increased 1% while shipments of high-value products decreased 2%. Volatile raw material costs and the resulting impact on surcharges affected demand as customers managed inventory levels and the timing of purchases. Operating results for the Flat-Rolled Products segment in 2013 were a loss of $44.7 million, or (2.1%) of sales, compared to segment operating profit of $127.8 million, or 5.4% of sales, due to lower base prices for most products and inventory costs not aligning with raw material surcharges. Flat-Rolled Products segment operating results in 2013 also include a $20.5 million lower of cost or market inventory valuation reserve for industrial titanium products.</p></blockquote> <p class=\"paywall-full-content invisible\"><b>Growth Outlook</b></p> <p class=\"paywall-full-content invisible\">ATI has invested roughly $1.2 billion in a Hot-Rolling and Processing Facility (HRPF) for its Flat-Rolled Products segment. It is designed to produce thinner and wider hot-rolled coils of exceptional quality and reduced cost with shorter lead times, with lower working capital requirements. The HRPF is designed to provide unsurpassed manufacturing capability and versatility in the production of a wide range of flat-rolled specialty metals. The HRPF is also designed to produce high-strength carbon steel alloys and hot bands. The facility is expected to produce all of ATI's flat-rolled products by the end of 2014.</p> <p class=\"paywall-full-content invisible\">ATI has also invested $0.5 billion in its Rowley, UT titanium sponge production facility. The investment will enable ATI to provide a secure, domestic supply source for PQ titanium sponge used in jet engine rotating parts. The investment will expand annual capacity to approximately 42 million pounds from the current capacity of 24 million pounds and result in operational improvements in yield and cake size.</p> <p class=\"paywall-full-content invisible\">On the <a href=\"https://seekingalpha.com/article/2330155-allegheny-technologies-ati-ceo-richard-harshman-on-q2-2014-results-earnings-call-transcript?part=single\">Q2 2014 conference call</a>, management noted improved demand from customers and less competition:</p> <blockquote class=\"quote paywall-full-content invisible\"> <p>Demand from the jet engine market is improving for both new builds and aftermarket spares and it appears that we are at or close to the end of aerospace inventory destocking of the past few years.</p> <p>The oil and gas supply chain appears to be in better balance and we are seeing demand improvement. We are tracking new projects both oil and gas and chemical process industry that are beginning to move forward. Lean times are extending for most of our products. Both the April and June 6% cold-rolled stainless price increases are an effect in the market. These price increases have had an immediate impact on non-contract business. We expect to see the full effect of the price increases as we move through 2014 into 2015.</p> <p>The headwinds created by continued falling raw material prices over the last few years appear to amended. In fact, most raw materials prices are increasing. The trade actions implemented against countries that have been illegally dumping product into the U.S. market have stabilized grain-oriented electrical steel priced in U.S. This comes after five years of declining prices.</p> </blockquote> <p class=\"paywall-full-content invisible\">Market conditions should continue to improve for ATI, as the cyclical commercial airplane market booms. The <a href=\"https://ir.atimetals.com/phoenix.zhtml?c=98187&amp;p=irol-presentations\" rel=\"nofollow\">image</a> below shows how many aircraft orders have already been announced:</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2014/9/2/7756551-14096933190345387-Negative-Returns_origin.png\" rel=\"lightbox\"><img src=\"https://static.seekingalpha.com/uploads/2014/9/2/7756551-14096933190345387-Negative-Returns.png\" hspace=\"6\" vspace=\"6\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">According to management, ATI is strategically positioned to benefit from this trend.</p> <blockquote class=\"quote paywall-full-content invisible\"> <p>We have been preparing for this business cycle improvement through strategic capital investments and acquisitions that have significantly expanded our manufacturing capabilities to meet the current and expected demand growth from ATI's targeted end markets including aerospace, oil and gas, chemical process industry, electrical energy and medical market.</p> <p>Most of our capital investments are now qualified to produce next generation alloys parts and components that are expected to grow faster than the aerospace market growth, because we have earned greater content on next generation airplanes and engines compared to legacy models.</p> <p>ATI's technical talent has developed new products that have either been fully qualified or nearing qualification for the next-generation of jet engine and airframe applications. These new products include the nickel-based superalloy ATI 718Plus and Rene 65, which are used in the hot section of the next-generation as well as legacy jet engines.</p> </blockquote> <p class=\"paywall-full-content invisible\"><strong>Restructuring</strong></p> <p class=\"paywall-full-content invisible\">I chose not to evaluate ATI's valuation or compare it with peers because management has been using FY 2013 &amp; 2014 to restructure the business. In September 2013, ATI sold its tungsten materials business in for a pre-tax gain of approximately $428 million. However, ATI also recorded $19.5 million of pre-tax charges in 2013 for the impairment of long-lived assets associated with its iron castings and fabricated components businesses. ATI is targeting $100 million in new gross cost reductions for the full year 2014. However, to achieve its goal, ATI is incurring multiple one-time expenses and is expected to only breakeven for FY 2014. Significant capital expenses for its HRPF and sponge production facilities have also weighed on recent results. However, neither the restructuring or elevated capital expense will continue into FY 2015.</p> <p class=\"paywall-full-content invisible\"><strong>My views</strong></p> <p class=\"paywall-full-content invisible\">Considering that ATI trades at 20x estimated 2015, it is hard to claim the stock is a bargain. However, I do not think ATI is overvalued after its recent run from $25 to $41. The Hot-Rolling and Processing Facility and titanium sponge production facility investments will result in significant organic growth for ATI. The rebound in commercial airline orders also provides upside earnings potential as the manufacturers will need ATI's specialty products.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Anyone afraid of mean reversion after the 60% gain should remember that ATI traded around $65 in 2011 and $100 in 2007. The stock is currently mean reverting higher. I would recommend holding ATI and expect its returns to be in line compared with the Industrial sector.</p>", "twitContent": "$ATI - Specialty Metals Firm Allegheny Technologies Up 60% In The Past Year. https://seekingalpha.com/article/2468505-specialty-metals-firm-allegheny-technologies-up-60-percent-in-the-past-year?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "71335", "type": "author"}}, "sentiments": {"data": [{"id": "139979", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "2607", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "166235", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17913", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17927", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/2468505-specialty-metals-firm-allegheny-technologies-up-60-percent-in-the-past-year", "canonical": "https://seekingalpha.com/article/2468505-specialty-metals-firm-allegheny-technologies-up-60-percent-in-the-past-year", "uriImage": "https://static.seekingalpha.com/uploads/2014/9/2/7756551-14096927458000593-Negative-Returns.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2014/9/2/7756551-14096927458000593-Negative-Returns.png"}}}, "included": [{"id": "71335", "type": "author", "attributes": {"company": null, "slug": "negative-returns", "userId": 7756551, "tagId": 166235, "bio": "I favor a mean reversion approach of buying losers and selling winners.\r\n\r\nI have made 530 equity derivative trades using an brokerage account. Taking $182 to $27,700 in a span of three months.\r\n\r\nHistory can be found here:\r\n\r\nhttps://docs.google.com/spreadsheets/d/1mWN-ebG_G-2EnFb3O0uePuSDn2CEUF3hXWKoN4c8Hrs/edit?pli=1#gid=0\r\n\r\nI use both fundamental and technical analysis in my research. I believe that fundamentals provide the basis for entering an investment and technical analysis assists in determining the best entry and exit point.", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/007/756/551/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/007/756/551/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/007/756/551/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/007/756/551/extra_large_pic.png"}, "nick": "Negative Returns", "deactivated": null, "memberSince": 2013, "isRss": false, "contributorSince": 2014, "followersCount": 25}, "relationships": {"user": {"data": {"id": "7756551", "type": "user"}}, "userBioTags": {"data": [{"id": "280893", "type": "userBioTag"}, {"id": "280903", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/negative-returns", "profileUrl": "/author/negative-returns", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "2607", "type": "tag", "attributes": {"slug": "ati", "name": "ATI", "company": "ATI Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "15", "type": "sector"}}}, "links": {"self": "/symbol/ATI"}}, {"id": "166235", "type": "tag", "attributes": {"slug": "negative-returns", "name": "Negative Returns", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/negative-returns"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17913", "type": "tag", "attributes": {"slug": "industrial-goods", "name": "Industrial Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/industrial-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17927", "type": "tag", "attributes": {"slug": "metal-fabrication", "name": "Metal Fabrication", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/metal-fabrication"}}, {"id": "139979", "type": "sentiment", "attributes": {"articleId": 2468505, "type": "bullish", "createdAt": "2014-09-03T14:31:56.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "2468505", "type": "article"}}, "tag": {"data": {"id": "2607", "type": "tag"}}}}]}