{"data": {"id": "4165038", "type": "fullArticle", "attributes": {"publishOn": "2018-04-24T01:35:12-04:00", "isLockedPro": false, "commentCount": 5, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"kenra-investors": {"id": 567626, "slug": "kenra-investors", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "earnings": {"id": 10, "slug": "earnings", "kind": "breadcrumb", "path": "/earnings/earnings-analysis", "title": "Earnings Analysis", "sasource": "theme_breadcrumb"}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro: Key Takeaways From Q1", "summary": ["Hasbro reported a very bad quarter mainly as a result of the short-term disruption generated by the Toys \"R\" Us bankruptcy.", "The weakness was anticipated and apparently fully discounted in the stock price.", "The management shared a positive view of Hasbro's short-term prospects, indicating a return to profitable growth already in 2018."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2022-06-10T22:05:19-04:00", "isModerated": false, "closestTradingDate": "2018-04-24", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 3, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><span><a href=\"https://static.seekingalpha.com/uploads/2017/10/26/44583886-15090306759486237_origin.png\" rel=\"lightbox\" data-width=\"2272\" data-height=\"1704\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2017/10/26/44583886-15090306759486237.png\" data-width=\"640\" data-height=\"480\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></a></span></p> <p>Shares of Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) seem to have recovered pretty fast from the pre-market correction triggered by the revenue and earnings miss, as the market understood the main problems that generated the weakness are short-term issues. The stock is up more than 3% as I am writing this, which suggests the market is starting to buy the management’s optimism.</p> <h3><strong>Financial Highlights </strong></h3> <p>Seeking Alpha <a href=\"https://seekingalpha.com/news/3347431-hasbro-misses-0_24-misses-on-revenue\">reported</a>:</p> <blockquote> <p> </p> <p>Hasbro (NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\">HAS</a>): Q1 EPS of $0.10 misses by $0.24.</p> <p>Revenue of $716.3M (-15.7% Y/Y) misses by $103.1M.</p> </blockquote> <p>The large revenue an EPS miss hasn’t scared investors much, and it’s understandable why considering the sharp correction posted in the past weeks and the uncertain effect of the Toys “R” Us bankruptcy. The management’s positive expectations helped for sure, but we can say that the market had already discounted large part of the weakness at the recent prices.</p> <p>The performance was weak at every major segment, with the U.S. and Canada segment down 19% to $364.3 million compared to $451.6 million in 2017, the international segment down 19% and only the Entertainment and Licensing business reporting a positive growth (+21%), although the segment is too small to make any difference.</p> <p>As a result of the lower sales, $52.3 million of expenses related to Toys \"R\" Us and higher warehousing and freight expenses, adjusted operating profit was $28.9 million in North America compared to an operating profit of $64.8 million in 2017. In the international segment, the company actually reported an operating loss of $56.1 million, which falls to $44.9 million if we include $11.2 million of expense associated with Toys \"R\" Us. In the Entertainment and licensing business, operating profit increased 23% to $13.9 million, or 21.7% of net revenues, compared to $11.3 million, or 21.5% of net revenues, in the corresponding quarter of 2017.</p> <p>Despite an increase<span class=\"paywall-full-content invisible\"> in debt to a bit above $1.7 billion, Hasbro’s balance sheet remains very solid with cash and cash equivalents of $1.6 billion that leave almost no net debt and a net debt/EBITDA ratio of 1.9 that looks acceptable even without considering the abnormally low earnings generated by the short-term disruption of Toys “R” Us.</span></p> <p class=\"paywall-full-content invisible\">What scared me a bit, at first sight, was the 24% increase in inventories despite the 16% decline in revenue, which indicates a huge level of unsold goods that should flow into the market in the near future. Although one-quarter of the increase was a result of currency effects, three-quarters were not. The management gave us an explanation about why inventories skyrocketed, explaining that a large part of that increase was a result of their deliberate decision not to put some goods into the market because they didn't want their new and highly appealing products to compete with liquidating inventory at retailers. In any case, it shouldn’t be a big problem when we consider that the level of inventories is still below 10% of sales, while retail inventories were actually down according to the management.</p> <p class=\"paywall-full-content invisible\">It’s obvious that we can’t say the performance in Q1 was good, but the short-term disruption in the North American industry wouldn’t have allowed to post different results. What seems to be more important is the underlying trend, which will be more visible once the higher inventories flowing into the market and the higher promotional activity will start to soften.</p> <p class=\"paywall-full-content invisible\"><strong> </strong></p> <h3 class=\"paywall-full-content invisible\"> <strong> </strong><strong>Recent Weakness and Toys “R” Us bankruptcy </strong> </h3> <p class=\"paywall-full-content invisible\">The management gave us some updates on the effects of the Toys “R” Us bankruptcy, which has created short-term disruption in the business in the United States and in the U.K., with the majority of the weakness expected to affect the business in the first half of the year, while the negative effects should soften in the third and fourth quarters. In the management’s own words:</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2018/4/23/44583886-15245119871973252_origin.png\" rel=\"lightbox\" data-width=\"702\" data-height=\"178\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\"><img src=\"https://static.seekingalpha.com/uploads/2018/4/23/44583886-15245119871973252.png\" width=\"640\" height=\"162\" data-width=\"640\" data-height=\"162\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\" loading=\"lazy\"></a></span><em>Source: <a href=\"https://seekingalpha.com/article/4164880-hasbros-ceo-brian-goldner-on-q1-2018-results-earnings-call-transcript\">Q1 earnings call</a></em></p> <p class=\"paywall-full-content invisible\">The management has been warning investors about the negative effects of the Toys “R” Us bankruptcy for a few quarters and, therefore, the story was already largely discounted by the stock price. As a result of these short-term headwinds, revenue in the United States and Canada declined 19%. Anyway, according to the management, the impact of lost revenues from Toys\"R\"Us and the efforts to work through retail inventory is evident across both U.S. and Canada and International segment results.</p> <p class=\"paywall-full-content invisible\">While I understand the negative impact of short-term headwinds like the bankruptcy of the third biggest retail partner, I think there might be some sources of weakness not mentioned by the management. The company reported that international segment revenues declined 17%, including a favorable $19.5 million impact from foreign exchange. Latin America and Asia Pacific grew revenues but were more than offset by a 28% decline in Europe. While the Toys “R” Us bankruptcy surely had an impact on the revenue generated in the United Kingdom, the majority of the weakness seems to be a result of carryforward retail inventory they are working to clear through, or they are a result of other sources of weakness not mentioned by the management. It’s clear that the Toys “R” Us bankruptcy is not a big factor in Europe, and it’s strange to see a 28% decline despite the favorable currency impact, much more than the decline reported in the more troubled North American segment. It's necessary to keep monitoring the developments in Europe and on the inventory side.</p> <h3 class=\"paywall-full-content invisible\"><strong>Expectations And Growth Prospects </strong></h3> <p class=\"paywall-full-content invisible\">Something worth mentioning is that the management maintains very positive expectations about the company’s growth prospects, despite the short-term challenges. The management confirmed the medium-term guidance shared in February. 2018 is still seen as a transition year but the management believes that developed economies can grow low-to-mid single digits for the next few years, while the international segment is expected to reach double-digit growth rates on a currency-neutral basis. Moreover, operating margin is expected to be around 15.6% this year and is forecast to improve over the next 2 to 3 years. The main drivers of margin expansion seem to be the expansion of the higher-margin Franchise Brands, Hasbro Gaming and Entertainment and Licensing businesses as well as profit improvement in the emerging markets and cost efficiencies.</p> <p class=\"paywall-full-content invisible\">Operating cash flow is expected in the range of $600 million to $700 million, which translates into a 10% YoY decline using the midpoint of the guidance range but implies only a slight decline if we take into account a $59.1 million bad debt charge related to Toys \"R\" Us.</p> <p class=\"paywall-full-content invisible\">I think what excited the market the most is the management’s announcement that they expect the business to return to profitable growth as soon as next year when the effects of those short-term disruptive factors will end. The management expects the lost revenues from the Toys “R” Us bankruptcy to shift to other retail players in a relatively short period, and the company can also exploit a series of catalysts to generate revenue growth in the near future, such as 6 new Marvel movies this year, together with two new Star Wars productions within two years that should capitalize on the recent success of The Last Jedi and give more strength to the franchise, plus Frozen 2 coming next year.</p> <h3 class=\"paywall-full-content invisible\"><strong>Key Takeaways</strong></h3> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">It’s great to see the management so positive about the company’s future prospects. It’s clear that management teams are always positive about the businesses they manage, but it’s good to see that a return to profitable growth is expected already next year, and that profitability in 2018 is expected to be in line with 2017 despite the negative effects of the short-term disruption. The management doesn’t like to provide a precise revenue guidance, but the 15.6% operating margin expected by the management will be a target to monitor for sure. If the company was able to report flattish sales this year, we could estimate EPS of $4.85 for 2018, assuming the 15.6% operating margin, $86 million in interest expenses and a tax rate of 16.5%. This would translate into a current P/E ratio of 17.5, which is a reasonable multiple for a company with Hasbro’s competitive strengths and the prospects of mid-to-high single digit EPS growth for the next several years. I am not extremely bullish on HAS because I think the margin of safety at these levels is not huge and I am a bit worried about the sharp decline in Europe despite the overall better conditions of this market compared to North America, but I still consider the stock a decent addition to a diversified long-term portfolio given the strong competitive strength, excellent financials, and the potential to see a reversal in the near future.</p>", "twitContent": "$HAS - Hasbro: Key Takeaways From Q1. https://seekingalpha.com/article/4165038-hasbro-key-takeaways-from-q1?source=tweet ", "innerMarketing": "<p><em>Thanks for taking the time to read the article. If you liked it, click on the follow button at the top of the page. You will get my articles as soon as they are published. I am available to further discuss the topics of this article in the comments section.</em></p><p><em>Kenra Investors uses a unique combination of deep fundamental research and alternative datasets to generate alpha in the stock market. If you want to access Kenra Investors&rsquo; best long and short ideas in the consumer and tech sectors, please consider joining </em><a href=\"https://seekingalpha.com/account/research/login_and_subscribe?slug=kenra-investors\"><em>Consumer Alpha</em></a><em>. A 2-week free trial is currently available.</em></p>", "marketingBullet": null, "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "101431", "type": "author"}}, "sentiments": {"data": []}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "567626", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "10", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4165038-hasbro-key-takeaways-from-q1", "canonical": "https://seekingalpha.com/article/4165038-hasbro-key-takeaways-from-q1", "uriImage": "https://static.seekingalpha.com/uploads/2017/10/26/44583886-15090306759486237_origin.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2017/10/26/44583886-15090306759486237_origin.png"}}}, "included": [{"id": "1155", "type": "authorResearch", "attributes": {"createdAt": "2017-05-22T13:54:09-04:00", "title": "Ultimate Alpha", "rating": "5.0", "reviewCount": 1, "shortPitch": "High-quality research on long and short ideas in consumer industries.", "categories": [], "serviceAssistantIds": [], "inAppPurchasesAllowedInIos": false, "inAppPurchasesAllowedInAndroid": false, "activeSubscriptionsCount": 1, "androidIapPlan": "none", "iosIapPlan": "none", "description": "Consumer Alpha is an exclusive service for investors who want to have access to well-researched and actionable insights on consumer-related stocks, with an exclusive focus on the most compelling opportunities we can find in our daily research activity. Whatever your investment style, you will find actionable research that can help your investment decisions. This service identifies significant mispricings and exploitable opportunities in consumer-related industries, which include: Sportswear, Fashion and Luxury, Media & Entertainment, eCommerce and Consumer Tech. You will have exclusive access to our favorite long and short ideas, including opportunities outside the United States and high-quality picks among small and mid-cap stocks.", "landingPageColor": null, "adUnits": ["direct_access", "trading_alert", "active_chat", "model_portfolio", "exclusive_idea", "real_time"], "tempData": {}, "price": 59.0, "wildcardText": "", "slug": "ultimate-alpha", "annualPriceWithDiscount": 472.0, "monthlyPlanEnabled": false, "status": "pitch_approved", "showHeadlines": false}, "relationships": {"author": {"data": {"id": "101431", "type": "author"}}}}, {"id": "101431", "type": "author", "attributes": {"company": null, "slug": "kenra-investors", "userId": 44583886, "tagId": 567626, "bio": "<p>Top-ranked financial expert according to Tipranks, consistently ranking in the top 10% globally. With over 10 years of L/S equity experience across sell-side and hedge funds, I leverage deep expertise in business, finance, and investing to identify high-potential opportunities and deliver meaningful outperformance. My approach combines fundamentals, technicals, accounting, data and macro analysis to generate superior returns. I am open to collaborations and opportunities in equity research and/or portfolio management globally. </p><p>For any purpose, you can message me here on Seeking Alpha or send an email to kenrainv@gmail.com</p><p></p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/044/583/886/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/044/583/886/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/044/583/886/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/044/583/886/extra_large_pic.png"}, "nick": "Kenra Investors", "deactivated": null, "memberSince": 2015, "isRss": false, "contributorSince": 2016, "followersCount": 5396}, "relationships": {"user": {"data": {"id": "44583886", "type": "user"}}, "userBioTags": {"data": [{"id": "912699", "type": "userBioTag"}, {"id": "912700", "type": "userBioTag"}, {"id": "912702", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1155", "type": "authorResearch"}}}, "links": {"self": "/author/kenra-investors", "profileUrl": "/author/kenra-investors", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "567626", "type": "tag", "attributes": {"slug": "kenra-investors", "name": "Kenra Investors", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/kenra-investors"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "10", "type": "tag", "attributes": {"slug": "earnings", "name": "Earnings", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/earnings"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}]}