{"data": {"id": "3956234", "type": "fullArticle", "attributes": {"publishOn": "2016-03-07T01:06:30-05:00", "isLockedPro": false, "commentCount": 1, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"young-money-man": {"id": 150213, "slug": "young-money-man", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "expert-insight": {"id": 97661, "slug": "expert-insight", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro's Magic: The Gathering Franchise Is Poised For Immense Growth Long Term", "summary": ["'Magic: The Gathering' propels the toys and games segment, along with 'Monopoly'.", "The release of the 'Eternal Masters' set suggests the company's decision to cater to a greater demographic audience.", "The digital plan outlined for 2017 will attack the market at every demographic, capitalizing on the story line and eventual franchise movie.", "There are still risks with the satisfaction of the majority long-term customer base."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2016-03-19T15:33:41-04:00", "isModerated": false, "closestTradingDate": "2016-03-07", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><img src=\"https://static.seekingalpha.com/uploads/2016/3/8/saupload_en_eu6h6a9zJX_1_thumb2.png\" align=\"right\" hspace=\"0\" vspace=\"0\" data-width=\"300\" data-height=\"419\" data-twitter-card-image-dims=\"1\" fetchpriority=\"high\">Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) is in the business of creating toys and games that cater to an audience that craves a story-driven experience for young people through adults, according to CEO Brian Golder. This is a distinct difference between the company and its closest rival, Mattel (<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a>). One of Hasbro's best stories that is a game is <em>Magic: The Gathering</em>. In the past, it has propelled the games segment of the company, and in the future has some massive potential to imitate the success of <em>Transformers</em> (company-owned) and <em>Star Wars</em> (licensed from Disney (DIS)) toys and merchandise with an <a href=\"https://seekingalpha.com/article/3600446-foxs-magic-gathering-movie-franchise-will-enable-hasbro-to-sell-trading-cards-for-years\">upcoming <em>Magic: The Gathering</em> movie</a>.</p> <p><em>Source: </em><a href=\"https://magic.wizards.com/en/articles/archive/news/announcing-eternal-masters-2016-02-15\" rel=\"nofollow\"><em>Magic</em></a></p> <p>Yet, there is a belief that technology is outpacing traditional toys in youth, and that soldiers, dolls, and cars are largely being replaced by parents supplying their children with tablets and smartphones. Even so, a traditional trading card game continues to grow in sales and popularity in 2016. How Hasbro continues to cater to the growing <em>Magic: The Gathering</em> audience in varying age groups and locales will have an impact on the future of this valuable asset.</p> <p>The reality is that <em>Magic: The Gathering</em> is growing and comprises a powerful segment of Hasbro's line of toys and games. Last year's 4Q saw <em>Battle for Zendikar</em> become the company's most successful release in its more than twenty years in business. Currency differences aside, <em>Magic: The Gathering</em> also propelled an 8% gain in the games category with help from the <em>Monopoly</em> franchise. I expect the latest expansion set, <em>Oath of the Gatewatch</em>, to overtake that position, and the April 2016 release of <em>Shadows over Innistrad</em> to overtake that due to a stellar marketing campaign.</p> <p><em><strong>Eternal Masters</strong></em><strong> and Catering to the Trading Card Community</strong></p> <p>Investors should note that Wizards of the Coast (maker of <em>Magic: The Gathering</em>, and wholly<span class=\"paywall-full-content invisible\"> owned by Hasbro) just made a powerful gesture to its community with </span><a href=\"https://magic.wizards.com/en/articles/archive/news/announcing-eternal-masters-2016-02-15\" rel=\"nofollow\" class=\"paywall-full-content invisible\">news of the release of <em>Eternal Masters</em> this summer</a><span class=\"paywall-full-content invisible\">. The set is designed to bridge the gap between a format of competitive play known as Legacy and the growing cost of cards necessary for playing in that format.</span></p> <p class=\"paywall-full-content invisible\">The new set will reprint cards that have been seen as largely essential to playing the format and, in many cases, can range between $50 and $5,000 each, while at the same time respecting the secondary market by only printing a limited run of this set.</p> <p class=\"paywall-full-content invisible\">There exists a reserved list of cards from the early days of <em>Magic: The Gathering</em> that are far too valuable that Wizards of the Coast has refused to reprint in order to protect the secondary market for those cards. It is a legally binding agreement that actually saved the game from extinction in the mid-'90s. You can read a lengthy discussion of that matter <a href=\"https://www.channelfireball.com/articles/rule-of-law-keeping-the-reserve-list/\" rel=\"nofollow\">here</a>.</p> <p class=\"paywall-full-content invisible\">Even still, the two teaser cards revealed to be part of the <em>Eternal Masters</em> set (<em>Force of Will</em> and <em>Wasteland</em>) will also pump life into other more casual formats, such as EDH (Commander) and Cube. Once a casual unsanctioned format, Wizards is steadily introducing a number of products directly towards this audience. It is not uncommon to find players of this format who do not buy the other products. This continues to illustrate the effort made to reach different audiences with the same game and story. Its player base is much smaller, but has been growing year-after-year.</p> <p class=\"paywall-full-content invisible\">The implications of this new expansion set (<em>Eternal Masters</em>) are incredible and should not be understated. The player base for <em>Magic: The Gathering</em> is a wonderful demographic for Hasbro, as more than 75% of its customers comprise the 18-40 age group. This set directly targets the younger demographic by offering them an opportunity to buy a booster pack or box that might contain a powerful card they could never afford before the release. It also directly targets the older demographic by catering to their need to have these necessary cards reprinted for competitive formats, not limited to gaming stores, but also tournaments attended by thousands.</p> <p class=\"paywall-full-content invisible\"><strong>Hasbro is Learning to Cater to Every Audience at the Digital Level</strong></p> <p class=\"paywall-full-content invisible\">Yes, there were <a href=\"https://blog.mtgprice.com/2014/05/29/magic-online-sucks-and-you-should-care/\" rel=\"nofollow\">some hiccups with <em>Magic: The Gathering Online</em> that propelled a significant distaste in the medium</a>. Rather than ignore the problem, Hasbro has learned from it, and is now in the process of developing a digital plan that will cater to every single digital need customers have with the introduction of a new product known only as <a href=\"https://www.purplepawn.com/2015/11/magic-digital-next-in-development-by-hasbro/\" rel=\"nofollow\">Magic Digital Next</a>, to be released in 2017. The goal is to capture an interested lead and cater to their entertainment needs with one online medium, while continuing to impress the long-term customer base.</p> <p class=\"paywall-full-content invisible\">Hasbro learned a powerful lesson in the storytelling segment of its franchise when it abandoned print books for <em>Magic: The Gathering</em> and switched to ebooks. Eventually, the company abandoned ebooks and diverted that energy to <a href=\"https://magic.wizards.com/en/content/magic-duels\" rel=\"nofollow\"><em>Duels of the Planeswalkers</em></a> a Steam-based game that is played on conventional gaming devices such as the Microsoft's (<a href=\"https://seekingalpha.com/symbol/MSFT\" title=\"Microsoft Corporation\">MSFT</a>) Xbox or Sony's (SNE) PlayStation and even personal computers and capable tablets. The game pairs the highly desirable elements of a conventional RPG with a far less static version of the card game. Again, Hasbro is successfully tapping into an audience which may not otherwise be familiar with its popular trading card game.</p> <p class=\"paywall-full-content invisible\">Rather than continuing to force the print novel and ebook segment, which was insufficient for customers who still craved the story line segment (which is Hasbro's specialty), and was largely unprofitable, Hasbro has a plan that will cater to the customer's desire for a story, while likely bringing in many more new customers that have only casually played <em>Magic: The Gathering</em>, and those who have never played at all.</p> <p class=\"paywall-full-content invisible\">I've already written about the power of the upcoming movie franchise produced by Fox (<a href=\"https://seekingalpha.com/symbol/FOX\" title=\"Fox Corporation\">FOX</a>, <a href=\"https://seekingalpha.com/symbol/FOXA\" title=\"Fox Corporation\">FOXA</a>). Based on the wide range in the demographic and the norm of epic fantasy entertainment (<em>Lord of the Rings</em> and <em>Game of Thrones</em>) <em>Magic: The Gathering</em> has the potential in the long term for sequels and prequels.</p> <p class=\"paywall-full-content invisible\"><strong>Risks in the Secondary Market and the Value of Cards</strong></p> <p class=\"paywall-full-content invisible\">Even with all of the growth prospects in alternative games and a movie franchise, it is important to be aware of the secondary market for cards, which is an industry of speculation and investment in and of itself. Various blogs, forums, and even premium subscription services cater to a demand to speculate on valuable and powerful cards that Wizards of the Coast has produced.</p> <p class=\"paywall-full-content invisible\">Not every single <em>Magic: The Gathering</em> card is valuable on the secondary market - far from it. Still, many cards retain value as their demand outweighs the supply in need for tournaments, casual play, and speculation that they will be desired in the near or far future.</p> <p class=\"paywall-full-content invisible\">Thus, the market of <em>Magic: The Gathering</em> customers is heavily reliant on the prospect of cards retaining or gaining in value. The purchasing of booster boxes in droves is a testament to that, and makes for a game-of-chance effect for those players as they hope to crack open a pack (36 packs are in a box) containing a highly desirable card that they can sell or trade up for. Players will be less likely to take that risk and buy in droves if there is no perception that the cards will maintain or possibly gain in financial value.</p> <p class=\"paywall-full-content invisible\">In addition, a growing number of players have vocalized their mistrust and distaste for what is perceived as price gouging and insider information on the reprinting of valuable cards, allowing prominent vendors to quietly buy or unload a given card before the official release by Wizards. It's important to note that these are allegations, and there is no proof as to who is responsible for leaks of product data, and whether vendors are actually receiving insider information. However small, the <a href=\"https://www.manaleak.com/mtguk/2016/01/did-mtg-traders-have-inside-knowledge-of-the-splinter-twin-ban-and-a-eternal-masters-set/\" rel=\"nofollow\">growing distrust</a> is worth mentioning.</p> <p class=\"paywall-full-content invisible\">Thus, Wizards maintains the task of not only producing captivating story lines and compelling game play, but of delivering cards that are thought to be valuable both from their game play and their rarity. Lately, it has done an exceptional job at this with what are known as \"Expedition Lands.\" These are very limited reprints of successful and valuable cards from past sets with holofoil and full artwork. With no guarantee of receiving one in a booster box, players are scrambling to find these cards (buying more product) that are often <a href=\"https://sales.starcitygames.com/category.php?cat=5312\" rel=\"nofollow\">retailing on the secondary market for several hundred dollars each</a>!</p> <p class=\"paywall-full-content invisible\"><strong>Conclusion</strong></p> <p class=\"paywall-full-content invisible\">Let's not forget, though, that much of the appeal in <em>Magic:</em> <em>The Gathering</em> is the balanced card game that heavily relies on skill, in which cards are carefully and thoughtfully produced. Customers continue to come back to the game because Wizards can reliably deliver a stellar product that appeals to so many - through the story, in the artwork, with powerful cards, and a healthy secondary market. Now it is delivering on an electronic level, and soon with Fox's movie franchise. I believe Hasbro is in for a real treat with this franchise, and it has a lot of room to run in the long term.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">I invite you take a look at the marketing efforts Wizards of the Coast is introducing this year, and how they are planning for a stellar spring and summer release, which is notoriously a slow time for trading card games. Besides <em>Eternal Masters</em>, fans are anxious as Wizards is revealing spoilers of <em>Shadows over Innistrad</em> with a teasing trickle effect, simultaneously utilizing escape rooms and live puzzles on three different continents. The Twitter hashtag <a href=\"https://twitter.com/search?q=%23MTGSOI\" rel=\"nofollow\">#MTGSOI</a> is full of positive reviews from veteran players, and is loaded with speculation and excitement.</p>", "twitContent": "$HAS - Hasbro's Magic: The Gathering Franchise Is Poised For Immense Growth Long Term. https://seekingalpha.com/article/3956234-hasbros-magic-gathering-franchise-is-poised-for-immense-growth-long-term?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "64263", "type": "author"}}, "sentiments": {"data": [{"id": "170386", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "150213", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "97661", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/3956234-hasbros-magic-gathering-franchise-is-poised-for-immense-growth-long-term", "canonical": "https://seekingalpha.com/article/3956234-hasbros-magic-gathering-franchise-is-poised-for-immense-growth-long-term", "uriImage": "https://static.seekingalpha.com/uploads/2016/3/8/saupload_en_eu6h6a9zJX_1_thumb2.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2016/3/8/saupload_en_eu6h6a9zJX_1_thumb2.png"}}}, "included": [{"id": "64263", "type": "author", "attributes": {"company": null, "slug": "young-money-man", "userId": 3821041, "tagId": 150213, "bio": "My Seeking Alpha articles should not be confused as investment advice, but are simply my opinions. I like to look at small pieces to the puzzle that others are ignoring to their benefit or demise. I am attracted the the quirky stories and divisions within a company.  I do not chart or crunch the numbers, leaving that to the experts. I attempt to find the obvious that many lose sight of and keep emotional investing to the curb.<br><br>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/003/821/041/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/003/821/041/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/003/821/041/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/003/821/041/extra_large_pic.png"}, "nick": "Young Money Man", "deactivated": null, "memberSince": 2012, "isRss": false, "contributorSince": 2014, "followersCount": 36}, "relationships": {"user": {"data": {"id": "3821041", "type": "user"}}, "userBioTags": {"data": [{"id": "760566", "type": "userBioTag"}, {"id": "760586", "type": "userBioTag"}, {"id": "760596", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/young-money-man", "profileUrl": "/author/young-money-man", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "150213", "type": "tag", "attributes": {"slug": "young-money-man", "name": "Young Money Man", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/young-money-man"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "97661", "type": "tag", "attributes": {"slug": "expert-insight", "name": "Expert Insight", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/expert-insight"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "170386", "type": "sentiment", "attributes": {"articleId": 3956234, "type": "bullish", "createdAt": "2016-03-07T01:06:30.000-05:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "3956234", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}