{"data": {"id": "3960495", "type": "fullArticle", "attributes": {"publishOn": "2016-03-23T10:18:04-04:00", "isLockedPro": false, "commentCount": 5, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"michael-boyd": {"id": 465545, "slug": "michael-boyd", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "atvi-defunct-12194": {"id": 12194, "slug": "atvi-defunct-12194", "kind": "common", "non_theme": true}, "dis": {"id": 86, "slug": "dis", "kind": "common", "non_theme": true}, "ko": {"id": 791, "slug": "ko", "kind": "common", "non_theme": true}, "mat": {"id": 1748, "slug": "mat", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro: Quality Company With Level-Headed Management", "summary": ["Hasbro has been an excellent long-term investment for shareholders.", "Management has its focus in the right areas and is building out its intellectual property portfolio.", "The company has come a long way in a short time; momentum is in its favor."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2016-03-23T12:06:04-04:00", "isModerated": false, "closestTradingDate": "2016-03-23", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<div> <p>Hasbro's (NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\">HAS</a>) equity has a special place in my heart because it was technically my first stock pick I ever made. That recommendation to buy was not driven by detailed financial analysis or relative valuation on the company; it simply came from a deep love of their products. As a wee lad that became deeply entwined in the Pokemon trading card game obsession that began in the late 90s, I encouraged my parents to buy shares after finding out that Wizards of the Coast was a Hasbro subsidiary, which had been acquired by the company in the summer of 1998. Likely hoping they could at least recoup some of the money they were dumping on those booster packs, my parents relented to my insistence. Fast forward nearly sixteen years and the total return on those shares is now 550% as my parents have continued to hold for all this time, which looks pretty impressive when compared against the S&amp;P 500 over the same timeframe:</p> <p><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2016/3/32642925_14586880615871_rId8.png\" rel=\"lightbox\" data-width=\"921\" data-height=\"334\" data-twitter-card-image-dims=\"1\"><img src=\"https://static.seekingalpha.com/uploads/2016/3/32642925_14586880615871_rId8_thumb.jpg\" data-width=\"640\" data-height=\"232\" data-twitter-card-image-dims=\"1\" fetchpriority=\"high\"></a></span></p> <p>I can only hope that all of my investments turn out so well.</p> <p>When you look at how Hasbro is run, it becomes clear very quickly that management has an excellent understanding of the IP under their control and what customers are demanding. While the company isn't perfect it still is, quite honestly, refreshing to see gaming management that appears in-tune with customers. I've long been critical of Activision Blizzard's (NASDAQ:<a href=\"https://seekingalpha.com/symbol/ATVI\">ATVI</a>) style of running the business (increased focus on marketing spend and not game development, management with very little experience in both game design and actually playing the games themselves) and Hasbro represents, at least in my opinion, how a gaming company should be run. This stewardship is reflected in the company's operating strength, especially over the past five years.</p> <p><strong>Owned Intellectual Properties</strong></p> <p>Hasbro breaks down<span class=\"paywall-full-content invisible\"> its owned IP into a couple of categories, but the two most key to the company's health are Franchise and Challenger brands. Franchise brands are the company's most significant properties and are where Hasbro puts a lot of focus on continuing to build momentum on what are extremely strong brands. Challenger brands are properties that the company believes have the potential to eventually make it to Franchise brand status.</span></p> <p class=\"paywall-full-content invisible\">Current Franchise brands are Magic: The Gathering, Monopoly, Littlest Pet Shop, My Little Pony, Nerf, Play-Doh and Transformers. Challenger brands are Furby, Furreal Friends, Kre-O, Baby Alive and Playskool. 52% of 2015 revenue was driven by Franchise brands and while Hasbro does not break out Challenger revenue data, the number is likely close to 60% of company revenue when grouping the two categories together.</p> <p class=\"paywall-full-content invisible\">Controlled for currency, Hasbro has seen excellent growth in its core franchises; -2% in 2015 (7% in constant currency), 31% in 2014 and 14% in 2013. Given that revenue is only up 8% in total since 2012, the importance of these core franchises has only grown with time, as well as the importance of overseas markets. Asia, especially, remains a key penetration market for the company. Asia has always had a strong fondness of games and the rapidly emerging middle class among high growth Asian countries like China are ripe for Hasbro to profit from.</p> <p class=\"paywall-full-content invisible\">Overall, Hasbro's strength in a tough operating market is largely due, in my opinion, to a solid history of investing back into these franchises via product development:</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2016/3/32642925_14586880615871_rId9.png\" data-width=\"485\" data-height=\"445\" data-twitter-card-image-dims=\"1\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\"><em>*Hasbro,</em><a href=\"https://investor.hasbro.com/events.cfm?disclaimer=yes\" rel=\"nofollow\"><em>2016 Investor Update</em></a></p> <p class=\"paywall-full-content invisible\">Advertising spend has been volatile, but overall has remained flat over the past five years. This comes back to my Activision Blizzard reference earlier; a company that has seen nominal total product development spending actually fall over the past five years, while advertising spend has grown at near double digits annually. The focus here at Hasbro appears to be on developing excellent products with solid properties that tell a story; not just glitzy advertising to push product. In the long run, Hasbro's approach has the better opportunity for success in my opinion.</p> <p class=\"paywall-full-content invisible\"><strong>Disney Licensing</strong></p> <p class=\"paywall-full-content invisible\">Hasbro doesn't just stick to its own intellectual property and it will often strike deals with other content owners to produce products using their properties. 28% of 2015 revenue was driven by these partnerships, making licensing an incredibly important facet to Hasbro's bottom line. Disney (NYSE:<a href=\"https://seekingalpha.com/symbol/DIS\">DIS</a>) is Hasbro's most influential partner and it's a partnership that has grown and developed over the years. This isn't surprising to me, given what appears to be shared ideals between both parties.</p> <p class=\"paywall-full-content invisible\">Hasbro currently markets products that Disney produces through its Marvel (Spiderman, The Avengers, etc.) and Lucas Licensing (Star Wars) subsidiaries. 2016 will be the first year the company will also market Frozen product lines, an important property that nearly everyone has heard of at this point. 2016 will also see the theatrical release of Captain America: Civil War and Rogue One: A Star Wars Story, which will further bolster revenue.</p> <p class=\"paywall-full-content invisible\">It's important to remember that Disney giveth and Disney can also taketh away. Shareholders of Mattel (NASDAQ:<a href=\"https://seekingalpha.com/symbol/MAT\">MAT</a>) learned this painful lesson when Hasbro swept the Frozen licensing deal right from under them. Hasbro needs to continue to foster this relationship and it can't afford mistakes in execution. A loss of some or all of the Disney agreements would be nothing short of disastrous to Hasbro's financial and it would erase years of hard-fought growth.</p> <p class=\"paywall-full-content invisible\"><strong>Expanding Margins</strong></p> <p class=\"paywall-full-content invisible\">While Hasbro has struggled to drive top line growth, margins have shown little weakness. Gross margins have expanded from 56.3% in 2011 to 62.3% today, a stellar increase. Falling commodity prices, lower freight costs and smart moves to shift, consolidate and modernize production has yielded excellent results for Hasbro.</p> <p class=\"paywall-full-content invisible\"><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2016/3/32642925_14586880615871_rId11.png\" rel=\"lightbox\" data-width=\"1037\" data-height=\"423\" data-twitter-card-image-dims=\"1\"><img src=\"https://static.seekingalpha.com/uploads/2016/3/32642925_14586880615871_rId11_thumb.jpg\" data-width=\"640\" data-height=\"261\" data-twitter-card-image-dims=\"1\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Unfortunately, SG&amp;A expenses have grown (36.7% of revenue in 2011, 39.3% in 2015), largely in part to the aforementioned product development costs, various restructuring costs associated with the 2012 Cost Savings Initiative and a large increase in stock-based compensation. Nonetheless, profit margins have grown despite the tailwinds and operating expenses should come down as restructuring costs roll off and gross margins continue to benefit from a favorable input cost environment.</p> <p class=\"paywall-full-content invisible\"><strong>Takeaway</strong></p> <p class=\"paywall-full-content invisible\">I believe the company can generate 16.1% operating margins in 2016, up 60 bps over 2015. This is supported by company guidance for gross margin expansion of 50 bps in 2016 and a flattening of operating expenses. Expanding margins, coupled with a return to revenue strength (5.5% top line growth) driven by the anxiously awaited rollout of Princess and Frozen, should drive significant top line growth.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Hasbro isn't cheap on trailing metrics - 12.3x EV/EBITDA, 22x earnings - but the company is set to see its results meaningfully expand in future years as the quality of its owned and licensed properties have risen. I traditionally value companies according to cash flows, not via income statement earnings, and Hasbro shows some better strength there. The company currently trades at a 4% free cash flow yield, but that is likely to expand to 4.5% in 2016, aided by strength in net income, added depreciation/amortization and continued working capital improvements. That makes the company a better pickup than it looks at face value, certainly better than large cap giants like Coca Cola (NYSE:<a href=\"https://seekingalpha.com/symbol/KO\">KO</a>) that are trading at similar multiples with no growth prospects. Nonetheless, the value isn't inspiring and it is enough to keep me from recommending a buy at current prices. Hasbro is a firm hold.</p> </div>", "twitContent": "$HAS - Hasbro: Quality Company With Level-Headed Management. https://seekingalpha.com/article/3960495-hasbro-quality-company-level-headed-management?source=tweet ", "innerMarketing": null, "marketingBullet": null, "isReit": false, "videoData": null, "marketingBulletVariant": "I am Michael Boyd. I have extensive investment banking and financial advisory experience. I am an independent analyst full time. I lead the investing group <a href=\"/checkout?service_id=mp_1077&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A32642925%7Csection_asset%3Aauthor_bullets%3A-energy-investing-authority\" data-test-id=\"author-custom-template-link\">Energy Investing Authority</a>.", "marketingBio": "Michael Boyd is an energy specialist with a decade of experience in both the investment advisory and investment banking spaces, with stints in portfolio management, residential mortgage-backed securities, derivatives, and internal audit at various firms. Today, he is a full-time investor and \"independent analyst for hire.”\n\nMichael leads the Investing Group <a href=\"/checkout?service_id=mp_1077&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A32642925%7Csection_asset%3Aauthor_root%3A-energy-investing-authority\" data-test-id=\"author-custom-template-link\">Energy Investing Authority</a>. The service focuses on finding total return opportunities within the energy sector, ranging from upstream producers to pipelines to refineries. Features include: model portfolios, real time trade alerts, high quality research, and an active and vibrant chatroom of professional investors. <a href=\"/checkout?service_id=mp_1077&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A32642925%7Csection_asset%3Aauthor_root%3A-energy-investing-authority\" data-test-id=\"author-custom-template-link\">Learn more</a>.", "audioDuration": null}, "relationships": {"author": {"data": {"id": "76785", "type": "author"}}, "sentiments": {"data": [{"id": "171082", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "12194", "type": "tag"}, {"id": "86", "type": "tag"}, {"id": "791", "type": "tag"}, {"id": "1748", "type": "tag"}]}, "otherTags": {"data": [{"id": "465545", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/3960495-hasbro-quality-company-level-headed-management", "canonical": "https://seekingalpha.com/article/3960495-hasbro-quality-company-level-headed-management", "uriImage": "https://static.seekingalpha.com/uploads/2016/3/32642925_14586880615871_rId8.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2016/3/32642925_14586880615871_rId8.png"}}}, "included": [{"id": "1077", "type": "authorResearch", "attributes": {"createdAt": "2016-08-15T11:57:13-04:00", "title": "Energy Investing Authority", "rating": "4.9", "reviewCount": 30, "shortPitch": "Compelling income and growth plays in the energy sector", "categories": ["Energy", "MLPs"], "serviceAssistantIds": [], "inAppPurchasesAllowedInIos": true, "inAppPurchasesAllowedInAndroid": true, "activeSubscriptionsCount": 247, "androidIapPlan": "semi_annual", "iosIapPlan": "annual", "description": "Growth & income opportunities in energy sector abound: join EIA to harness the continuing untapped momentum of the energy sector.\r\n\r\nOur cutting-edge research and actionable ideas go beyond traditional analysis to give you an edge. From asset tours, management interviews, and attending dynamic conferences: we give you unparalleled insight and provide you with most comprehensive energy market analysis.", "landingPageColor": "light-blue", "adUnits": ["active_chat", "model_portfolio", "exclusive_idea", "monthly_news", "industry_tracker", "real_time"], "tempData": {}, "price": 99.99, "wildcardText": "", "slug": "energy-investing-authority", "annualPriceWithDiscount": 799.0, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": true}, "relationships": {"author": {"data": {"id": "76785", "type": "author"}}}}, {"id": "76785", "type": "author", "attributes": {"company": null, "slug": "michael-boyd", "userId": 32642925, "tagId": 465545, "bio": "<p>Michael Boyd is an energy specialist with a decade of experience in both the investment advisory and investment banking spaces, with stints in portfolio management, residential mortgage-backed securities, derivatives, and internal audit at various firms. Today, he is a full-time investor and \"independent analyst for hire.”</p><p> Michael leads the Investing Group <a href=\"https://seekingalpha.com/checkout?service_id=mp_1077\">Energy Investing Authority</a>. The service focuses on finding total return opportunities within the energy sector, ranging from upstream producers to pipelines to refineries. Features include: model portfolios, real time trade alerts, high quality research, and an active and vibrant chatroom of professional investors. <a href=\"https://seekingalpha.com/checkout?service_id=mp_1077\">Learn More</a>.</p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/032/642/925/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/032/642/925/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/032/642/925/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/032/642/925/extra_large_pic.png"}, "nick": "Michael Boyd", "deactivated": null, "memberSince": 2014, "isRss": false, "contributorSince": 2014, "followersCount": 19377}, "relationships": {"user": {"data": {"id": "32642925", "type": "user"}}, "userBioTags": {"data": [{"id": "986124", "type": "userBioTag"}, {"id": "986125", "type": "userBioTag"}, {"id": "986126", "type": "userBioTag"}, {"id": "986127", "type": "userBioTag"}, {"id": "986128", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1077", "type": "authorResearch"}}}, "links": {"self": "/author/michael-boyd", "profileUrl": "/author/michael-boyd", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "12194", "type": "tag", "attributes": {"slug": "atvi-defunct-12194", "name": "ATVI", "company": "Activision Blizzard, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": true, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/ATVI-DEFUNCT-12194"}}, {"id": "86", "type": "tag", "attributes": {"slug": "dis", "name": "DIS", "company": "The Walt Disney Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/DIS"}}, {"id": "791", "type": "tag", "attributes": {"slug": "ko", "name": "KO", "company": "The Coca-Cola Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/KO"}}, {"id": "1748", "type": "tag", "attributes": {"slug": "mat", "name": "MAT", "company": "Mattel, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MAT"}}, {"id": "465545", "type": "tag", "attributes": {"slug": "michael-boyd", "name": "Michael Boyd", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/michael-boyd"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "171082", "type": "sentiment", "attributes": {"articleId": 3960495, "type": "bullish", "createdAt": "2016-03-23T10:18:04.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "3960495", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}