{"data": {"id": "3964139", "type": "fullArticle", "attributes": {"publishOn": "2016-04-08T18:59:47-04:00", "isLockedPro": false, "commentCount": 5, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"lutz-muller": {"id": 102761, "slug": "lutz-muller", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "mat": {"id": 1748, "slug": "mat", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-submit": {"id": 9082, "slug": "sa-submit", "kind": "general"}, "expert-insight": {"id": 97661, "slug": "expert-insight", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro And Mattel: Retail Buyers' Views From The Toy Fair", "summary": ["The buyers thought Mattel's toy fair offering was innovative and exciting.", "They also believe that Hasbro is solid but basically focused on continuation.", "Of the two, Mattel clearly won."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2016-04-08T18:59:47-04:00", "isModerated": false, "closestTradingDate": "2016-04-11", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": false, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\">  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article.</span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<div> <p>Three national buyers for major retailers were kind enough to share their Toy Fair notes with me. While there were obvious differences between the three, these notes portrayed a reasonably consistent picture of what the major retailers think as they are proceeding to shelf allocation and purchase orders.</p> <p>Basically, as far as the national buyers are concerned, Toy Fair this year came down to a drag-out-knock-down fight between Mattel (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a></span>) and Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) following Mattel's turnaround and Hasbro's eloping with Disney Princess. The buyers were also aware that consumer interest had of late shifted markedly from Hasbro to Mattel and this is, of course, borne out by the extent consumers talk about the two companies on social media:</p> <p><em></em><span><a href=\"https://static.seekingalpha.com/uploads/2016/3/7/435974-1457366172343664_origin.png\" rel=\"lightbox\" data-width=\"1000\" data-height=\"231\" data-twitter-card-image-dims=\"1\"><img src=\"https://static.seekingalpha.com/uploads/2016/3/7/435974-1457366172343664.png\" hspace=\"6\" vspace=\"6\" data-width=\"640\" data-height=\"148\" data-twitter-card-image-dims=\"0\" fetchpriority=\"high\"></a></span></p> <p><em>Source: Tickertags</em></p> <p><strong>MATTEL:</strong></p> <p>Mattel's main thrust in 2016 will be focused on three major themes if their Toy Fair offering is anything to go by -- Barbie and the DC Super Hero Girls in the Doll space, Action Figures for the Batman vs Superman movie, and tech-driven toys.</p> <p>As for <strong>Barbie,</strong> the latest major change is the extended Fashionista line, which now includes three new body styles -- curvy, petite and tall -- as well as seven skin tones.</p> <p>The buyers are little conflicted about this because they cannot make up their minds to what extent this change reflects a genuine consumer preference and not just a cave-in to consumer group protests. They also think that the consumer -- the tween girl -- will not be particularly interested in the various body shapes and in fact could be offended if given the \"curvy\" Barbie. The upside is that these new SKUs will liven up the now pretty one-dimensional Barbie shelf and could also attract new consumers whose preferences were not so far adequately addressed -- e.g. the Latina and black tween. There is, in the buyers' opinion, really not much downside since the original Barbie will still<span class=\"paywall-full-content invisible\"> be there on the shelf and readily available to anybody not wanting to venture too far from the known and familiar.</span></p> <p class=\"paywall-full-content invisible\">In addition, Mattel presented a number of new Barbie SKUs extending the \"You can be anything\" theme -- the Presidential and the Vice Presidential Barbie plus dentist, chef, doctor and pilot. The buyers cannot get too excited over this addition, but again think that there is some upside to it given that these dolls are new and a little different from the current line.</p> <p class=\"paywall-full-content invisible\">However, the buyers were much more positive about the new Barbie <strong>Dreamhouse.</strong></p> <p class=\"paywall-full-content invisible\">It is a significant step up from the current one, which has already proven to be extremely successful in two ways. One is that the current Dreamhouse, at $159.99 at TRU, is selling very well by itself. The second is that you need to buy a fair amount of other Barbie stuff to properly populate the place -- and the average is 17 SKUs in addition to the Dreamhouse itself. The new version is much more sophisticated in that it is Wi-Fi enabled and has a voice recognition feature that allows you to ask the house to perform a variety of tasks. The technology is provided by Toy Talk, the same people who gave us Hello Barbie and the Smart Toy Bear. At $300, the thing is pricey but the buyers think that the entire package is so novel and interesting that it will fly even at this price. And of course, the same principle of having to buy a ton of other Barbie stuff to make this house livable also applies to this wired Dreamhouse.</p> <p class=\"paywall-full-content invisible\">The <strong>DC Superhero Girls</strong> are, in the opinion expressed by all the buyers I spoke to, in a league of their own. The 12\" figures depict Wonder Woman, Super Girl, Bumblebee, Batgirl, Harley Quinn and Poison Ivy, and are designed to portray a more muscular girl than the ordinary fashion doll. Their outfits are also more action-oriented and hence these dolls are not just another version of the traditional superhero doll such as Wonder Woman. The entire presentation is such that the toy is believable as a female action figure rather than a fashion doll.</p> <p class=\"paywall-full-content invisible\">The range has been released in March, first as an exclusive for Target [where after a few days following the release it captured a very strong first place in the Doll category] and then for general distribution in Summer. While the buyers were not too happy about being excluded for the first three or so months, they are extremely positive about the way Mattel has executed the concept and they think that the DC Superhero Girls will in fact cross over into the action figure territory in the same way Lego Friends and Nerf Rebelle crossed over into the Girls aisles.</p> <p class=\"paywall-full-content invisible\">As far as Mattel's action figure program is concerned, opinions were less positive. These action figures are all based on the forthcoming Dawn of Justice movie, scheduled for release on March 25. At least some have been out for a while and the retailers are obviously fully aware that the range at least so far is woefully behind Star Wars and the Avengers. While this may change following the release of the movie, they doubt it. Other than that, the buyers thought that the line was well done and they were in fact very positive about the fact that Mattel, after having moved from the original DC Universe 6\" figures to 3.75\" figures for Multiverse, now have reversed themselves and are presenting the Dawn of Justice series in the 6\" format.</p> <p class=\"paywall-full-content invisible\">There were no Max Steel products on display, which suggests that the movie, still officially scheduled for August 26, may again be delayed or possibly be canned altogether.</p> <p class=\"paywall-full-content invisible\">As for Mattel's invasion of the high-tech space, there are three products that stand out: Barbie Star Light Adventure Hoverboard -- Barbie on a drone -- the ThingMaker 3D printer, and the Fisher-Price Code-A-Pillar. All three are very impressive because they show the type of lateral thinking the buyers have not come to expect from a company that has never had the reputation of being very innovative. The first is particularly striking -- Barbie flits through the air on her drone hovercraft, which you control remotely. The second allows you to build your own toys in your home and the third teaches the logic of computer commands using a robot bug to carry out the child's instructions. The Barbie on a drone is exceptionally well priced at $59.99; the ThingMaker at $299, and the Code-A-Pillar at $50 plus $15 for each of the three expansion packs.</p> <p class=\"paywall-full-content invisible\">In summary, the buyers thought that the Mattel offering this year was infinitely superior to what they had been seeing over the past decade, and they believe that the new management's speeches about changes in corporate culture appear to be translated into real action.</p> <p class=\"paywall-full-content invisible\"><strong>HASBRO:</strong></p> <p class=\"paywall-full-content invisible\">Hasbro's offering was much more predictable than Mattel's and characterized by continuation rather than innovation.</p> <p class=\"paywall-full-content invisible\">Hasbro's main focus at this year's Toy Fair was on one side action figures powered by movies -- <strong>Captain America, XMen, Dr Strange and of course Star Wars</strong> -- both Force Awakens as well as Rebels -- and on the other side fashion dolls from the Princess/Frozen series as well as Moana and Alice.</p> <p class=\"paywall-full-content invisible\">One very interesting and novel aspect of the action figure ranges displayed is the number of female figures for Star Wars, Captain America and XMen, which suggests that Hasbro is attempting to blunt Mattel's drive into the new Female Action Figure category with its DC Super Hero Girls entry. Other than that, the toys featured were predictable and well executed but not very different from the versions that accompanied their previous movies. There were no toys shown for the forthcoming Star Trek and Rogue movie, but these will undoubtedly become available before the two movies break on July 22 and December 15, respectively.</p> <p class=\"paywall-full-content invisible\">On the doll side, there were of course the new <strong>Disney Princess</strong> dolls. They included the whole lot -- Ariel, Aurora, Belle, Cinderellla, Jasmine, Merida, Mulan, Pocahontas, Rapunzel, Snow White and Tiana -- as part of the Royal Shimmer collection. They are not too different from the former Mattel versions except that Hasbro tried to get the dolls much more closely to the movie images rather than portraying them as Barbie adaptations as Mattel did. Most of these dolls are in fact already on the shelves and that is why the buyers are a little skeptical -- so far, Mattel's Disney Princess dolls continue to be on the same shelves and vastly outsell the Hasbro versions.</p> <p class=\"paywall-full-content invisible\">The same applies to the three <strong>Frozen</strong> dolls shown at Toy Fair -- Elsa, Anna and Kristoff -- which much more resemble the movie originals shown in Frozen and Frozen Fever. Again here, all three are already on the shelves and are outsold by Mattel's old version.</p> <p class=\"paywall-full-content invisible\"><strong>Elena of Avalor</strong> will be Disney's first all-Latina princess and Hasbro is expected to release about six SKUs in time to coincide with the release of the Disney Jr series sometime later this year. This one could be good and the buyers are very positive about it. It is a complete toy package direct at the Hispanic consumer and represents a first in terms of toy marketing. It could be a game changer among the rapidly growing Latina population, who are thought to represent about 20% of the tweens in the U.S. this year.</p> <p class=\"paywall-full-content invisible\">Disney's<strong> Descendants</strong>, launched by Hasbro already in the middle of last year, continues to expand its offering. Originally 10 characters, this is now being expanded by four more -- CJ [Capt Hook], Ally [Alice], Jordan [Aladdin] and Freddy [Princess and Frog]. The new episode of Descendants, scheduled for release this Fall, will incorporate a neon lights ball and Hasbro will then launch a new doll range that lights up.</p> <p class=\"paywall-full-content invisible\">The<strong> Moana</strong> movie will be released in November and Hasbro has so far only two SKUs available -- the Moana doll and the figurine of the god Maui. There will be additional SKUs added before the movie breaks, and the entire toy range is expected to be launched at the end of the third quarter.</p> <p class=\"paywall-full-content invisible\">In the Preschool space is the <strong>Trolls</strong> movie, scheduled for release in November. This movie is greatly anticipated and the buyers believe that the toy range developed by Hasbro will do exceptionally well. There is a very considerable number of solid figures as well as plush and both ranges will be shipped at the end of the third quarter.</p> <p class=\"paywall-full-content invisible\">In summary, Mattel surprised with innovation and Hasbro focused on continuation of tested concepts. Both are expected to do very well this year.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\"><em>(This article was first published by the Toy World Magazine UK on April 1, 2016)</em></p> </div>", "twitContent": "$MAT $HAS - Hasbro And Mattel: Retail Buyers' Views From The Toy Fair. https://seekingalpha.com/article/3964139-hasbro-and-mattel-retail-buyers-views-from-toy-fair?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "48741", "type": "author"}}, "sentiments": {"data": [{"id": "171803", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "1748", "type": "tag"}, {"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "102761", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "9082", "type": "tag"}, {"id": "97661", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/3964139-hasbro-and-mattel-retail-buyers-views-from-toy-fair", "canonical": "https://seekingalpha.com/article/3964139-hasbro-and-mattel-retail-buyers-views-from-toy-fair", "uriImage": "https://static.seekingalpha.com/uploads/2016/3/7/435974-1457366172343664_origin.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2016/3/7/435974-1457366172343664_origin.png"}}}, "included": [{"id": "48741", "type": "author", "attributes": {"company": null, "slug": "lutz-muller", "userId": 435974, "tagId": 102761, "bio": "Lutz is an acknowledged expert on the toy space. His clients include one of the top three U.S. banks and one of the top three non-public toy companies worldwide. Between 1984 and 2002, Lutz was the CEO at five different manufacturing companies catering to U.S. and international mass retailers. He's lived on five continents and speaks six languages.<br><br><p><br></p><p>He started his business intelligence consulting practice in 2003 and he derives his information from three primary sources. The first is his proprietary retailer panel, which includes Wal-Mart, Target, J C Penney, Kohl's, Gamestop, Dollar General, Barnes + Noble and Learning Express. This panel provides him with sell-through data, shelf space changes, inventory levels and other pertinent metrics governing the major companies and products active in the two industry categories. The second is national buyers at 30 leading retailers in 17 large country markets. These provide color on trends and issues that have a bearing on the major manufacturers and products in the two industry categories. The last is mainly Chinese third-party manufacturers who provide insights into supply and inventory issues affecting the major companies or products in the two industry categories.<br><br></p><p>Lutz consults with banks and hedge funds, and hence does not trade in any stocks associated with companies active in the spaces he focuses on. Lutz also is a monthly contributor to Seeking Alpha. He also publishes a monthly Toy Newsletter, which can be found on his website, www.klosterstrading.com.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/000/435/974/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/000/435/974/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/000/435/974/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/000/435/974/extra_large_pic.png"}, "nick": "Lutz Muller", "deactivated": null, "memberSince": 2009, "isRss": true, "contributorSince": 2013, "followersCount": 905}, "relationships": {"user": {"data": {"id": "435974", "type": "user"}}, "userBioTags": {"data": [{"id": "110303", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/lutz-muller", "profileUrl": "/author/lutz-muller", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "1748", "type": "tag", "attributes": {"slug": "mat", "name": "MAT", "company": "Mattel, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/MAT"}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/HAS"}}, {"id": "102761", "type": "tag", "attributes": {"slug": "lutz-muller", "name": "Lutz Muller", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/lutz-muller"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "9082", "type": "tag", "attributes": {"slug": "sa-submit", "name": "SA Submit", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-submit"}}, {"id": "97661", "type": "tag", "attributes": {"slug": "expert-insight", "name": "Expert Insight", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/expert-insight"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "171803", "type": "sentiment", "attributes": {"articleId": 3964139, "type": "bullish", "createdAt": "2016-04-08T18:59:47.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "3964139", "type": "article"}}, "tag": {"data": {"id": "1748", "type": "tag"}}}}]}