{"data": {"id": "3975896", "type": "fullArticle", "attributes": {"publishOn": "2016-05-18T03:35:38-04:00", "isLockedPro": false, "commentCount": 1, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"yash-bhatia": {"id": 154843, "slug": "yash-bhatia", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "tonr": {"id": 139221, "slug": "tonr", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "mat": {"id": 1748, "slug": "mat", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Reality Shaking Up The Doll Industry; Will Hasbro Or Mattel Adapt?", "summary": ["Taking a licensing deal with Disney from Mattel has allowed the once-smaller Hasbro to catch up in valuation, while delivering better financials.", "Mattel still has a better foothold in the girl toy segment, while Hasbro is more popular with toys for boys.", "Dolls that are realistic-looking, diverse and empowering to girls is a segment growing in popularity.", "The question is: Will these giants move into the space to try and solidify their position or tap into the others?"], "structuredInsights": null, "isPaywalled": false, "lastModified": "2016-05-18T04:42:41-04:00", "isModerated": false, "closestTradingDate": "2016-05-18", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Retail sales have been strained, and brick-and-mortar retailers have certainly felt the pain associated with the brisk pace of growth for e-commerce. There are some pockets of strength in the retail business, though, including toys. For example, Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) hit an all-time high in April, after topping Wall Street expectations for the first quarter. Well, it wasn't just a beat, it was more of a crush of analyst estimates. 16 percent year-over-year revenue growth to $831.18 million in Q1 easily sailed past the consensus expectations of $777.11 million. Net profit of $48.8 million, up 83 percent from the year prior quarter, equated to $0.38 per share, far exceeding predictions of $0.24 per share.</p> <p>A clear driver was lucrative licensing deals - namely for the movies \"<em>Frozen</em>\" and \"<em>Star Wars</em>\" - with Disney (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>). Hasbro, which historically has been known as a boys' toy company, won the rights to Disney's <em>Frozen</em> and \"<em>Princess</em>\" brands from rival Mattel (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a></span>) late in 2014, with the rights going into effect at the start of 2016. Hasbro has been making <em>Star Wars </em>toys for decades, but fans clamoring for new products with the first new installment of <em>Star Wars</em> since 2005 set the franchise back on fire.</p> <p>Although Mattel was confident that the strength of its portfolio would weather the storm of losing the Disney deal, it's tough to ignore the magnitude of having the pact with the Mickey Mouse owner. The <em>Frozen</em> movie came out in 2013 and was the top toy brand of 2014, selling $531 million worth of dolls and dresses, while remaining strong today. The <em>Princess</em> brand is a $5.5 billion enterprise for Disney, crystallizing the value of being associated with it.</p> <p><strong>Mattel and Hasbro Since Disney Deal</strong></p> <p><img src=\"https://static.seekingalpha.com/uploads/2016/5/27468423_14635135765629_rId5.png\" data-width=\"520\" data-height=\"318\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" fetchpriority=\"high\"></p> <p>Shares of Mattel initially took a hit on the news in 2014. However, riding its<span class=\"paywall-full-content invisible\"> portfolio, which includes </span><em class=\"paywall-full-content invisible\">Hot Wheels</em><span class=\"paywall-full-content invisible\">, </span><em class=\"paywall-full-content invisible\">Matchbox</em><span class=\"paywall-full-content invisible\">, </span><i class=\"paywall-full-content invisible\">Fisher-Price</i><span class=\"paywall-full-content invisible\">, </span><em class=\"paywall-full-content invisible\">Barbie</em><span class=\"paywall-full-content invisible\">, </span><em class=\"paywall-full-content invisible\">American Girl</em><span class=\"paywall-full-content invisible\">, </span><em class=\"paywall-full-content invisible\">Monster High</em><span class=\"paywall-full-content invisible\">, </span><em class=\"paywall-full-content invisible\">Ever After High</em><span class=\"paywall-full-content invisible\">, the stock has recovered to basically breakeven from the time of the announcement 1-1/2 years ago. On a more positive note for MAT, after hitting $18.67 in October, the shares are back up over $30 each, although they've fallen 10 percent since missing on earnings estimates with a larger loss than expected (-$0.13 per share versus -$0.08 per share) during the first quarter. Sales of </span><em class=\"paywall-full-content invisible\">Barbie</em><span class=\"paywall-full-content invisible\"> were flat, and </span><em class=\"paywall-full-content invisible\">American Girl</em> <em class=\"paywall-full-content invisible\">Brands</em><span class=\"paywall-full-content invisible\"> fell 11 percent year over year on a constant currency basis.</span></p> <p class=\"paywall-full-content invisible\">A look at the chart for HAS shows the difference across the same period.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2016/5/27468423_14635135765629_rId6.png\" data-width=\"520\" data-height=\"318\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"false\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Maybe part of the reason that Mattel is fighting for growth is because Hasbro is taking what could be the former's ground for expansion. In April's quarterly earnings call, Hasbro CEO Brian Goldner noted that information from The NPD Group, a global industry information company, showed that his company was gaining share in almost every major market. NPD estimates that U.S. toy sales grew by 6.7 percent in 2015 to <a href=\"https://www.npd.com/wps/portal/npd/us/news/press-releases/2016/stellar-performance-for-us-toy-industry-growing-nearly-7-percent-in-2015/\" rel=\"nofollow\">$19.4 billion</a>, including 8.4 percent dollar growth in the doll category. NPD cited content as a key driver, albeit from a movie, television show, app or YouTube following.</p> <p class=\"paywall-full-content invisible\"><strong>The Force is with Hasbro, but it's not Everything</strong></p> <p class=\"paywall-full-content invisible\">The popular <em>Princess</em> meeting <em>The </em><em>Force</em> provided a tailwind for sales in Hasbro's boy and girl toy categories. The girl category surged 41 percent year over year to $165.4 million in Q1. Sales of toys for boys were up 24 percent to $336.9 million. This goes to show what a franchise licensing deal can deliver, but it's also important to remember that Hasbro is not a \"two-trick\" pony. The company has many franchise brands, including <em>GI Joe</em>, <em>Transformers</em> and <em>Nerf</em>, the top brand during the first quarter for Hasbro.</p> <p class=\"paywall-full-content invisible\">There has been speculation that Hasbro and Mattel will merge to fuel future growth. Because the toy industry is so large, yet highly fragmented, there is the possibility that forging a $10 billion industry behemoth could possibly placate antitrust regulators. If they did combine, they would still command only about a 20-25% market share. Still, whether it's just rumor or fact, Goldner was closed-lipped about it in February, saying that Hasbro will make <a href=\"https://www.wsj.com/articles/star-wars-boosts-hasbro-sales-1454935536\" rel=\"nofollow\">small acquisitions</a> to meet its goals.</p> <p class=\"paywall-full-content invisible\"><strong>Where Do These Companies Go Next?</strong></p> <p class=\"paywall-full-content invisible\">Mattel is not down and out by any stretch of the imagination. Indeed, sales are stagnant in its doll lines, but <em>Barbie</em>, <em>American Girl</em> and <em>Monster High</em> still command the attention of girls worldwide and remain some of the most sought-after dolls for Christmas. Merging, even if it could overcome monopoly regulations, makes sense from some angles (strengthening foothold in the boys' space for Mattel and the girls' space for Hasbro, reduce competition amongst each other for licensing deals, for example), but no sense in others (including potentially aggravating current license partners and possibly cannibalizing some sales).</p> <p class=\"paywall-full-content invisible\">Smaller deals - and ones that meet a growing consumer demand - make more sense.</p> <p class=\"paywall-full-content invisible\">One factor to consider in the doll space is research on the effect of dolls on children. <a href=\"https://oregonstate.edu/ua/ncs/archives/2014/mar/playing-barbie-dolls-could-limit-girls%E2%80%99-career-choices-study-shows\" rel=\"nofollow\">A study</a> by Oregon State University looked into this matter, discovering that the way dolls are shaped and dressed communicates different messages to boys and girls. Noting the complexity of childhood development, Aurora M. Sherman, an associate professor in the School of Psychological Science at OSU, commented that playing with one toy isn't likely to alter a child's career aspirations, but \"toys such as dolls or action figures can influence a child's ideas about their future.\"</p> <p class=\"paywall-full-content invisible\">In that vein, companies are getting more creative and realistic in their designs as they try to figure out exactly what's best for development and what girls want. Privately held <a href=\"https://www.goldieblox.com/\" rel=\"nofollow\">GoldieBlox</a>, whose dolls include \"<em>Goldie</em>,\" \"<em>Ruby Rails</em>,\" \"<em>Val</em>\" and others, is an award-winning toy maker with the goal of getting girls interested in building. For example, <em>Goldie</em> is an engineer who prefers her purple overalls to dresses. The company strives to keep girls' interest in careers where women are largely outnumbered by men by changing the bias that things like construction sets are \"boys' toys,\" by creating characters that are role models for girls.</p> <p class=\"paywall-full-content invisible\">Also private, <a href=\"https://lammily.com/about/\" rel=\"nofollow\">Lammily</a> is going against the perfect look of <em>Barbie</em>, creating dolls with realistic body proportions. In its efforts, Lammily looked to data from the Centers for Disease Control and Prevention to define the average shape of a 19-year old girl. Creator <a href=\"https://www.wsj.com/articles/the-dolls-beyond-barbie-1447873588\" rel=\"nofollow\">Nickolay Lamm says</a> that the company's realistic dolls are not meant to look like Miss Universe, but rather \"a person walking down the street.\" Lammily goes so far as to offer a set of reusable sticker accessories that can be used on its dolls to give them stretch marks, cellulite, moles, etc.</p> <p class=\"paywall-full-content invisible\">Looking to learn more about the new dynamic in doll making, I reached out to Joanne Melton, CEO of <a href=\"https://oneworlddolls.com/\" rel=\"nofollow\">Tonner-One World Holdings</a> (OWOO), a designer and maker of multi-cultural fashion dolls founded by former Mattel doll designer Stacey McBride-Irby and entrepreneur Trent Daniel.</p> <p class=\"paywall-full-content invisible\">\"We are seeing a sea change in the way designers make dolls that is reality-based with the function of providing a positive impact on the girls - and boys - that represent the future of our world,\" commented Melton in a phone conversation. \"There is a clear focus on individuality, diversity and empowerment to let children know that they can identify with and be whoever they want to be. The vast majority of people don't look like <em>Barbie</em>; kids want dolls that are culturally correct and look like them, their family and their friends. The market lacks this type of dolls, which we think match the way consumers think today and represent a significant market opportunity for us and others in our space.\"</p> <p class=\"paywall-full-content invisible\">The company, which recently changed its name based upon a planned merger with the NY doll enterprise Tonner Doll Company, currently sells three lines of dolls across retail Wal-Mart (<a href=\"https://seekingalpha.com/symbol/WMT\" title=\"Walmart Inc.\">WMT</a>) locations and online at the company's website, Walmart.com, and at Amazon.com (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>) and DOLLGENIE.COM, to name a few. Melton said that to date, the company has sold more than 100,000 dolls. She added that expectations are for that number to increase greatly in the near term, thanks to a licensing deal with Twentieth Century Fox Consumer Products to create a line of dolls based on the critically acclaimed television show \"<em>Empire</em>.\" A <a href=\"https://deadline.com/2016/04/empire-ratings-halt-fall-criminal-minds-beyond-borders-arrow-heartbeat-fox-1201745919/\" rel=\"nofollow\">top-rated show</a> across all the major networks, the April 20 episode drew nearly 10 million viewers, according to Deadline.com.</p> <p class=\"paywall-full-content invisible\">\"I don't know of another company our size that has struck a licensing deal with a hit series,\" Melton commented. \"It's a game changer for us that speaks to the quality of our dolls, and we see it as a huge industry step forward for a media giant to look to a small company for their needs.\"</p> <p class=\"paywall-full-content invisible\">Bratz doll owner, MGA Entertainment also emphasizes the importance of dolls that empower. What the company coined <em>Project Mc2 </em>is meant to inspire girls to explore science, and the doll line also has a live action Netflix (<a href=\"https://seekingalpha.com/symbol/NFLX\" title=\"Netflix, Inc.\">NFLX</a>) Original Series based on it. MGA is looking to capitalize on the paradigm shift in education towards S.T.E.A.M. - an acronym for Science, Technology, Engineering, Art and Math - that puts emphasis on the learning process as much as standardized test scores.</p> <p class=\"paywall-full-content invisible\">Isaac Larian, chief executive at MGA, brings the business model home in <a href=\"https://whatsyourtech.ca/2015/11/08/new-doll-aims-to-teach-young-girls-to-love-math-science/\" rel=\"nofollow\">saying</a>, \"My goal with the Project Mc2 franchise is to encourage girls everywhere to be interested and pursue S.T.E.A.M-based careers... It is a dream come true for MGA to bring this entertainment franchise to life in order to empower young girls to learn, play and explore the world around them on all of the platforms where they are engaged; from retail, to TV and online.\" Larian says he wants to live to see the day when the CEO of Apple, Intel or Amazon is a woman.</p> <p class=\"paywall-full-content invisible\"><strong>Alive and Well</strong></p> <p class=\"paywall-full-content invisible\">Undeniably lifted by <em>Star Wars</em>, the toy business is alive and well. What started here as broad research of the toy industry to evaluate Hasbro and Mattel morphed into a drilled-down look into the doll business and the direction of the toy segment as a catalyst for future sales for these companies. On the surface, Hasbro clearly looks better positioned than Mattel in the current state. However, the appears to be a new trend emerging in toys and dolls that focus on authenticity while promoting creativity - something that small companies seem far better at achieving than the two giants. Likely it's because these smaller firms are more \"boots on the ground\" and connected to the community, cultures and consumers which they are trying to serve.</p> <p class=\"paywall-full-content invisible\">Perhaps Mattel and Hasbro view these emerging market segments as dimes and they're not going to stop their battle with each other for a dollar to stop and pick up a dime. That's okay, the upstarts will scoop up every dime possible, so that one day one of the majors may see them as a dollar that they wish to pick up. After this exercise, it is my opinion that they will need it in the future to continue to diversify and capture as much market share as possible.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Editor's Note: This article covers one or more microcap stocks. Please be aware of the risks associated with these stocks.</p>", "twitContent": "$HAS $MAT - Reality Shaking Up The Doll Industry; Will Hasbro Or Mattel Adapt?. https://seekingalpha.com/article/3975896-reality-shaking-up-doll-industry-will-hasbro-mattel-adapt?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "66113", "type": "author"}}, "sentiments": {"data": [{"id": "173478", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}, {"id": "1748", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "139221", "type": "tag"}]}, "otherTags": {"data": [{"id": "154843", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/3975896-reality-shaking-up-doll-industry-will-hasbro-mattel-adapt", "canonical": "https://seekingalpha.com/article/3975896-reality-shaking-up-doll-industry-will-hasbro-mattel-adapt", "uriImage": "https://static.seekingalpha.com/uploads/2016/5/27468423_14635135765629_rId5.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2016/5/27468423_14635135765629_rId5.png"}}}, "included": [{"id": "66113", "type": "author", "attributes": {"company": null, "slug": "yash-bhatia", "userId": 27468423, "tagId": 154843, "bio": "To deliver you real-time access to breaking stories relating to the pharmaceutical and biotechnology sectors that could have an impact on stock prices;", "image": {"small": "https://static3.seekingalpha.com/images/users_profile/027/468/423/small_pic.png", "medium": "https://static3.seekingalpha.com/images/users_profile/027/468/423/medium_pic.png", "big": "https://static3.seekingalpha.com/images/users_profile/027/468/423/big_pic.png", "extra_large": "https://static3.seekingalpha.com/images/users_profile/027/468/423/extra_large_pic.png"}, "nick": "Yash Bhatia", "deactivated": null, "memberSince": 2014, "isRss": false, "contributorSince": 2014, "followersCount": 88}, "relationships": {"user": {"data": {"id": "27468423", "type": "user"}}, "userBioTags": {"data": [{"id": "898445", "type": "userBioTag"}, {"id": "898446", "type": "userBioTag"}, {"id": "898447", "type": "userBioTag"}, {"id": "898448", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/yash-bhatia", "profileUrl": "/author/yash-bhatia", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "1748", "type": "tag", "attributes": {"slug": "mat", "name": "MAT", "company": "Mattel, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/MAT"}}, {"id": "139221", "type": "tag", "attributes": {"slug": "tonr", "name": "TONR", "company": "Tonner-One World Holdings, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "OTCMKTS", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/TONR"}}, {"id": "154843", "type": "tag", "attributes": {"slug": "yash-bhatia", "name": "Yash Bhatia", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/yash-bhatia"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "173478", "type": "sentiment", "attributes": {"articleId": 3975896, "type": "bullish", "createdAt": "2016-05-18T03:35:38.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "3975896", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}