{"data": {"id": "3980626", "type": "fullArticle", "attributes": {"publishOn": "2016-06-08T04:27:55-04:00", "isLockedPro": false, "commentCount": 10, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"young-money-man": {"id": 150213, "slug": "young-money-man", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "expert-insight": {"id": 97661, "slug": "expert-insight", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro's Magic: The Gathering Continues To Plant Seeds For Long-Term Customer Acquisition", "summary": ["Eternal Masters is set for release June 10 with a limited print run.", "Product offerings are changing dramatically to customer demand and geared toward locking in new customers.", "This is all in preparation for a tight-lipped movie franchise geared at expanding the brand."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2016-06-09T22:02:51-04:00", "isModerated": false, "closestTradingDate": "2016-06-08", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>On Friday June 10th, Wizards of the Coast, the subsidy that wholly owned by Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) will release its newest premium, limited print run set of <em>Magic: The Gathering</em> known as <em>Eternal Masters</em>. It is a continuation of other limited print sets that have reprinted prominent cards from the game's storied past. This one is already being celebrated by fans of the game as a wonderful edition to the summer's offerings as dozens of key cards from the games past are being reprinted.</p> <p>Admittedly these cards - several of which reach $100 or more in the secondary market - will be limited so their effect on the overall secondary market will be soft. Nevertheless, new players will have a chance to buy a booster pack from their favorite gaming store and have a realistic chance at obtaining competitive cards from the game's historic beginning.</p> <p>Long-time customers are anxious for this release with few complaints. This is just another great example of Wizard's catering to their audience for being so loyal. <a href=\"https://twitter.com/search?q=mtgema&amp;src=typd\" rel=\"nofollow\">Check out the Twitter action</a> as this set releases this Friday.</p> <p><em>Edlritch Moon</em> is the next full expansion set release to complete the <em>Shadows Over Innistrad</em> block. This is the first expansion set to feature only two sets to the storyline block which has traditionally been three. The gothic horror and Cthulhu-like storyline of this set may take this set over the edge for the casually interested customer. Remember the strength of this brand is in telling a story. That is Hasbro's direction.</p> <p>As a result of not offering a chance at an exceedingly rare premium card known as \"Expeditions\" in booster packs, sales are not expected to reach the heights of <em>Battle for Zendikar</em> and <em>Oath of the Gatewatch</em>, which were purchased in higher number than any other<span class=\"paywall-full-content invisible\"> set in the game's historic 23 years or releases. According to the first quarter conference call pre-release attendance at local gaming stores is up more than 20%. The two expansion block has created a sense of urgency at attending grand openings for collectors and players.</span></p> <p class=\"paywall-full-content invisible\"><strong>A New Way of Doing Things</strong></p> <p class=\"paywall-full-content invisible\"><a href=\"https://magic.wizards.com/en/articles/archive/news/announcement-day-2016-05-16\" rel=\"nofollow\">Wizards of the Coast made a huge announcment on May 16</a> that they will now begin making two massive publicity announcements per year. The news came out of nowhere and unveiled new storylines the company will be pursuing and great product changes that will likely benefit their customer base and overall perception of the game to new players.</p> <p class=\"paywall-full-content invisible\">Mark my words: they will take advantage of this new platform to talk about developments and the eventual release of the <em>Magic: The Gathering</em> movie franchise in conjunction with Fox.</p> <p class=\"paywall-full-content invisible\">The biggest announcement for investors should be the company's willingness to change their previous products which clearly were not reaching new customers as the company expected and replacing them with products that are perceived as offering more value to their customers. The goal, <a href=\"https://seekingalpha.com/article/3956234-hasbros-magic-gathering-franchise-is-poised-for-immense-growth-long-term\">as mentioned in my previous article</a> is to attract consumers at every level of experience. This is just greater proof that they are finally acting on it.</p> <p class=\"paywall-full-content invisible\"><strong>Intro Decks Replaced with Planeswalker Decks</strong></p> <p class=\"paywall-full-content invisible\">The first such change will end the Intro Deck. Intro Decks were supposed to be a pre-constructed deck aimed at a new player who could purchase the product, open it and be ready to play. Wizards' market research must have directed them to the countless talking heads in this community and the secondary market; which is quite powerful in this hobby. Both have long berated Intro Decks as wholly flawed in both value and design. Rarely have they provided the tools necessary for a new customer to become a long-term customer. <a href=\"https://www.youtube.com/watch?v=2ou8RXpZw9o\" rel=\"nofollow\">Tolarian Community College succiently and professionally breaks down the expected return value of an Intro Deck and refutes their usefulness</a>.</p> <p class=\"paywall-full-content invisible\">The replacement will be a new Planeswalker Deck that focuses on a Planeswalker and their exclusive card that will only be available in the new deck. These will be complimented with several other cards that will only be available in that product. Those cards will correspond with the story and mechanics of the Planeswalker character.</p> <p class=\"paywall-full-content invisible\">Planeswalker cards have often been game-changing in casual settings since their introduction and retain a decent secondary-market value. Their prominence might also be encouraging a customer to become attached to a particular character and their personality in preparation for marketing a <em>Magic: The Gathering</em> movie franchise, which should see the Planeswalkers as main characters.</p> <p class=\"paywall-full-content invisible\">Consider now that Wizards is finally offering a reason for their customers - who are already seasoned players - to buy these decks. Before there was never any exclusivity of cards included. All of them were obtainable from another product offering, eliciting little demand for this product. Creating exclusive cards not obtainable outside of the Planeswalker Deck will encourage many collectors and players to purchase the deck.</p> <p class=\"paywall-full-content invisible\">Expected sales on these should see a dramatic uptick not only for curiosity at the new product but as a better expected value from veteran players.</p> <p class=\"paywall-full-content invisible\"><strong>Fatpacks Amended to Bundles</strong></p> <p class=\"paywall-full-content invisible\">The second replacement will not be too different from the previously known Fatpacks. They are being replaced by Bundles. These will contain one more booster pack than normal (for ten total), a \"spindown\" life counter, a player's guide, 80 basic lands, rules reference card, and the fine quality box to store it all in. Very little has changed in this product and rightly so. Fat Packs have long been a favorite amongst players. An extra booster pack might be negligible.</p> <p class=\"paywall-full-content invisible\"><strong>More Emphasis on Multiplayer Products</strong></p> <p class=\"paywall-full-content invisible\">The last major product announcement was the availability of a new four-color <em>Commander</em> product and a reprint of the <em>Planeschase</em> set as a limited print collector's edition. Both are multiplayer versions of <em>Magic: The Gathering</em> that are viewed as more casual forms of the game with neither being as competitive nor as popular as the main game. Both will be released later this year.</p> <p class=\"paywall-full-content invisible\">Still Wizards can be applauded for taking what was once a fringe method of playing the iconic game and supporting it, catering to it, and hopefully improving it.</p> <p class=\"paywall-full-content invisible\"><strong>Prepping for a New Influx of Customers Thanks to a <em>Magic: The Gathering</em> movie franchise</strong></p> <p class=\"paywall-full-content invisible\">Mark Rosewater, head of research and development at <em>Magic: The Gathering</em> admits his vision is to create a smooth entry into the game for new customers and to cater to every level of player. I wrote about this in my last article. Wizards is investing much more into catering to all levels of awareness in this game, except maybe the wholly unaware. Though I do believe that is next, especially with the movie option.</p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/article/3600446-foxs-magic-gathering-movie-franchise-will-enable-hasbro-to-sell-trading-cards-for-years\">With the release of a <em>Magic: The Gathering</em> movie franchise</a>, the brand will have easy appeal and notice amongst the general population. Although Wizards is historically tight-lipped about their future business plans, it is my expectation that these amendments to their usual products are a direct effort to prepare for that brand new market who will be exposed to <em>Magic: The Gathering</em> at the movie theaters and through the subsequent publicity. <a href=\"https://magic.wizards.com/en/articles/archive/making-magic/say-when-2014-12-08\" rel=\"nofollow\">Rosewater offers little information that we don't already know</a>, except that a team from R&amp;D, including himself are being used for consultation. Nevertheless, his tone and language talk about a movie that <em>is</em> happening.</p> <p class=\"paywall-full-content invisible\"><strong>Final Notes</strong></p> <p class=\"paywall-full-content invisible\">During the first quarter of 2016, games revenues were down 2% at Hasbro, due in large part to foreign exchange. In the last few years, <em>Magic: The Gathering</em> was largely the anchor to Hasbro's successful games division which was outpacing a flat toys division. In the games division, <em>Duel Masters</em> is making impressive headway. Sustained growth is difficult in the trading card game business as so many fail in subsequent years. This game is worth keeping an eye on.</p> <p class=\"paywall-full-content invisible\">Today, <em>Star Wars</em> licensing has fueled a heavily successful toys division with strong output that looks to maintain momentum as subsequent films are released. As a result first quarter revenues at Hasbro rose 16%, or 20% foreign exchange withstanding.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Keep an eye on the actions of the new president of Wizards of the Coast, Chris Cocks; an acquisition from Microsoft. His experience in the LeapFrog, X-Box and other digital ventures will be a valuable addition to the efforts to streamlining and perfecting <em>Magic: The Gatherings'</em> digital offerings. Although they are improving, they do have a long way to go.</p>", "twitContent": "$HAS - Hasbro's Magic: The Gathering Continues To Plant Seeds For Long-Term Customer Acquisition. https://seekingalpha.com/article/3980626-hasbros-magic-gathering-continues-to-plant-seeds-for-long-term-customer-acquisition?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "64263", "type": "author"}}, "sentiments": {"data": []}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "150213", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "97661", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/3980626-hasbros-magic-gathering-continues-to-plant-seeds-for-long-term-customer-acquisition", "canonical": "https://seekingalpha.com/article/3980626-hasbros-magic-gathering-continues-to-plant-seeds-for-long-term-customer-acquisition", "uriImage": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png", "schemaImage": null}}, "included": [{"id": "64263", "type": "author", "attributes": {"company": null, "slug": "young-money-man", "userId": 3821041, "tagId": 150213, "bio": "My Seeking Alpha articles should not be confused as investment advice, but are simply my opinions. I like to look at small pieces to the puzzle that others are ignoring to their benefit or demise. I am attracted the the quirky stories and divisions within a company.  I do not chart or crunch the numbers, leaving that to the experts. I attempt to find the obvious that many lose sight of and keep emotional investing to the curb.<br><br>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/003/821/041/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/003/821/041/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/003/821/041/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/003/821/041/extra_large_pic.png"}, "nick": "Young Money Man", "deactivated": null, "memberSince": 2012, "isRss": false, "contributorSince": 2014, "followersCount": 36}, "relationships": {"user": {"data": {"id": "3821041", "type": "user"}}, "userBioTags": {"data": [{"id": "760566", "type": "userBioTag"}, {"id": "760586", "type": "userBioTag"}, {"id": "760596", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/young-money-man", "profileUrl": "/author/young-money-man", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "150213", "type": "tag", "attributes": {"slug": "young-money-man", "name": "Young Money Man", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/young-money-man"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "97661", "type": "tag", "attributes": {"slug": "expert-insight", "name": "Expert Insight", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/expert-insight"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}]}