{"data": {"id": "3991939", "type": "fullArticle", "attributes": {"publishOn": "2016-07-27T06:57:15-04:00", "isLockedPro": false, "commentCount": 6, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"grassroots-trading": {"id": 568029, "slug": "grassroots-trading", "kind": "common", "non_theme": true}, "investing-ideas": {"id": 10727, "slug": "investing-ideas", "kind": "general", "path": "/stock-ideas", "title": "Stock Ideas", "sasource": "theme_breadcrumb"}, "long-ideas": {"id": 1936, "slug": "long-ideas", "kind": "breadcrumb", "path": "/stock-ideas/long-ideas", "title": "Long Ideas", "sasource": "theme_breadcrumb"}, "growth": {"id": 115472, "slug": "growth", "kind": "common", "non_theme": true}, "changing-market": {"id": 142771, "slug": "changing-market", "kind": "common", "non_theme": true}, "expanding-production": {"id": 142801, "slug": "expanding-production", "kind": "common", "non_theme": true}, "dis": {"id": 86, "slug": "dis", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "premium-base-payment": {"id": 162415, "slug": "premium-base-payment", "kind": "general"}, "alpha-rich-investment-style": {"id": 114682, "slug": "alpha-rich-investment-style", "kind": "general"}, "alpha-rich-opportunity": {"id": 114692, "slug": "alpha-rich-opportunity", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro's Remarkable Branding Predicament", "summary": ["Branding moments that create nostalgia, even for a company with a rich history like Hasbro, is never a guarantee for prolonged success.", "The Hasbro brand is currently thriving today, but not in the way that the company is entirely comfortable with.", "Hasbro’s acquisition of Boulder Animation certainly provides them with an edge but should investors be concerned over the quality of the content they produce?"], "structuredInsights": null, "isPaywalled": false, "lastModified": "2016-07-27T08:00:07-04:00", "isModerated": false, "closestTradingDate": "2016-07-27", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 0, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long DIS, WMT.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Investors anticipating a positive reaction in Hasbro's (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) share price <a href=\"https://seekingalpha.com/article/3989289-hasbros-ceo-brian-goldner-on-q2-2016-results-earnings-call-transcript\">following Q2 results</a>, were reasonably dismayed as shares traded down 7% that Monday morning. Overall, it was a good report: The company reported earnings per share of 41 cents for the second quarter of the year, up from the 33 cents reported during Q2 2015 and beating out analysts' estimates of 39 cents per share for the quarter.</p> <p>Hasbro also reported that sales of girl toys were up 35% in Q2 2016, thanks to Walt Disney Co's (<a href=\"https://seekingalpha.com/symbol/DIS\" title=\"The Walt Disney Company\">DIS</a>) Frozen and Princess brands, as well as Baby Alive. However, boy toy sales only increased by 4% during the quarter, but this didn't seem to be the catalyst for the market's negative reaction. As of this writing, Hasbro's stock price has since rebounded by 3% and seems to be holding steady as investors digest the most probable direction the price will move over the next year.</p> <p>There doesn't seem to be a coincidence that Hasbro's brand blueprint is mentioned by CEO Goldner in the first two paragraphs of his opening remarks on that earnings conference call. In summary, and in his own words: \"The Hasbro team is building brands across toy and games, digital gaming, storytelling, entertainment and consumer products. These efforts support our mission of creating the world's best play experiences, and are delivering growth in our business.\" Therefore, the stock price direction is linked with the capacity of Hasbro to fulfill these mission critical branding initiatives.</p> <p>Consider for a moment the possibility that a company's brand is never stagnant. It's a fluid, psychological dynamic that flows more like a meandering river from which the source is ideally controlled by the company. At any given moment, for any company, we have the tendency to focus on what's happening right now in that moment. Kmart's brand, for instance, varied immensely<span class=\"paywall-full-content invisible\"> from its triumphant Blue Light Special promotional age and flowed and catastrophically dried to its sloppy, dusty shelved decline. How many of us can remember hearing \"Attention Kmart shoppers\" delivered over the loudspeakers? These are the branding moments that create nostalgia, which is never a guarantee for prolonged success.</span></p> <p class=\"paywall-full-content invisible\">For Hasbro, long gone are the days of 1952's Mr. Potato Head. This is a new era, and as <a href=\"https://corporate.hasbro.com/en-us/about-hasbro\" rel=\"nofollow\">Hasbro's Corporate history</a> reads, throughout their 90-year history, they have constantly evolved. That success, thanks to this imperceptible evolution when we regard the Hasbro brand in the moment, as mentioned earlier, is currently thriving today, but not in the way that the company is entirely comfortable with.</p> <p class=\"paywall-full-content invisible\">Survival and growth go hand in hand and they have their current, collectively perceived, rich history of brand making to thank for that. Hasbro proudly boasts that Mr. Potato Head was the first toy ever to be advertised on television. That is a pretty big deal considering that the mediums, specifically via television and paper publications, used to pitch their brand was also going through some major changes.</p> <p class=\"paywall-full-content invisible\">By the eighties, Hasbro was considered \"The Modern Toy Company.\" This was a decade of tremendous growth for Hasbro with new, and now iconic introductions, including MY LITTLE PONY and TRANSFORMERS. Hasbro had also become the biggest toy company with the purchase of Milton Bradley and PLAYSKOOL. By 1983, they also started to expand on their brand and image by giving back with the creation of The Hasbro Charitable Trust and the Hasbro Children's Foundation.</p> <p class=\"paywall-full-content invisible\">According to Hasbro's corporate website: \"Since its formation, more than $100 million in financial support has been provided to organizations worldwide. The company has also donated more than 25 million toys and games since this time.\" The point, without having to illustrate their entire history, is that the Hasbro brand successfully evolves.</p> <p class=\"paywall-full-content invisible\">So, let's fast forward to the current quarter and consider again what CEO Goldner noted in his opening remarks in order, as investors and potential investors, to link this fluid dynamic of branding from the past, to the present, so that we could potentially envision Hasbro's brand in the future. He states, \"…through the execution of our brand blueprint, the Hasbro team is building brands across toy and games, digital gaming, storytelling, entertainment and consumer products.\"</p> <p class=\"paywall-full-content invisible\">The company's recent acquisition of an Ireland-based animation company is therefore nothing new or out of the ordinary in regard to the execution of this evolving branding strategy. As recently as 2013, Hasbro purchased a 70 percent stake in mobile gaming firm Backflip Studios for $112 million. The opening lines of one article which covered that story and was published by PCmag.com, read: \"Toy maker Hasbro…\" Not, \"World-class storyteller Hasbro.\"</p> <p class=\"paywall-full-content invisible\"><strong>Toy maker Hasbro</strong></p> <p class=\"paywall-full-content invisible\">Brand is perception and perception is the brand. Currently, the Hasbro mobile gaming selection includes Nerf Rebelle's Never Forget Featuring Pink Crush, challenging users to make the longest light sequence - whatever that means. There's also Monopoly Empire, an online quiz. And for the nostalgic user there's Operation, a Silly Skill Game. These are not exactly memorable or addicting must-haves like King's Candy Crush Saga. That is why it was brilliant, and no surprise, considering Hasbro's long history of forging the right connections and relationships, <a href=\"https://www.businesswire.com/news/home/20160628006647/en/Hope-Cochran-Mary-Beth-West-Join-Hasbro\" rel=\"nofollow\">announced</a> last month that Hope Cochran, former CFO of King Digital had been appointed to their board of directors.</p> <p class=\"paywall-full-content invisible\">On September 25, 2014, Hasbro made <a href=\"https://www.bloomberg.com/news/articles/2014-09-24/hasbro-swipes-disney-s-frozen-princess-licenses-from-mattel\" rel=\"nofollow\">headlines</a> when Disney gave the rights for the toy maker to manufacture dolls for the legendary Disney Princess franchise. As part of this relationship, Disney is able to offer their products for sale through a number of familiar retail giants like Wal-Mart (<a href=\"https://seekingalpha.com/symbol/WMT\" title=\"Walmart Inc.\">WMT</a>), Target (<a href=\"https://seekingalpha.com/symbol/TGT\" title=\"Target Corporation\">TGT</a>) and Amazon (<a href=\"https://seekingalpha.com/symbol/AMZN\" title=\"Amazon.com, Inc.\">AMZN</a>), further contributing to the branding power of the toy maker while simultaneously diluting their strategy to evolve with the changing times.</p> <p class=\"paywall-full-content invisible\">For Hasbro, their challenge appears to be about the creation of proprietary product recognition, something that Disney does so well. This is their identity crises - the toy maker struggling to transform. It is what prompts headlines to still question which one is the better toy company, Hasbro or Mattel (<a href=\"https://seekingalpha.com/symbol/MAT\" title=\"Mattel, Inc.\">MAT</a>)? The two competitors were reportedly in merger talks earlier this year and a merger between the two would mean a bigger toy company with added brands, not exactly the world's best play experience company in a new world where play occurs over mediums that Hasbro is scrambling to acquire.</p> <p class=\"paywall-full-content invisible\"><strong>Enter Ireland's Boulder Media Animation Studio.</strong></p> <p class=\"paywall-full-content invisible\">For the curious, the Irish connection for Hasbro is significant. Hasbro Ireland was established in the South East of Ireland in 1977. At this location, the company manufactures games and puzzles for the European market. The facility, as noted by Hasbro, \"is strategically located 10 minutes from one of the largest LOLO container ports in Europe. We can deliver overnight to the UK mainland and 2-3 days to the rest of Europe.\" As for the Boulder Media Animation Studio, location might be opportunity or just coincidence.</p> <p class=\"paywall-full-content invisible\">Regarding opportunity, animation is no joke. It's big, and from a toy company's perspective, it means the opportunity to transform their brand into the world's most well-known animation company. It is ambitious, to say the least, and Wall Street is beginning to take notice.</p> <p class=\"paywall-full-content invisible\"><strong>The Dream: The Toy Company That Once Was</strong></p> <p class=\"paywall-full-content invisible\">In 2015, almost a year before the purchase of the animation studio, Hasbro Allspark Pictures, <a href=\"https://variety.com/2015/film/news/monopoly-movie-lionsgate-hasbro-1201532349/\" rel=\"nofollow\">announced</a> that it was working with Lions Gate (LGF) to make a Monopoly movie. Hasbro's Allspark Pictures, an homage to Transformers, is currently in post-production on a live-action version of \"Jem and the Holograms\" and \"Ouija 2\" as a sequel to last year's low-budget horror film. 2014's Ouija raked in $103 million in worldwide sales with only a $5 million budget.</p> <p class=\"paywall-full-content invisible\">Now, the Boulder Media acquisition signifies the potential, not necessarily the likelihood, of producing the next SpongeBob Square Pants (a <a href=\"https://www.viacom.com\" rel=\"nofollow\">Viacom Media Network's</a> Nickelodeon production), the highest rated series to ever air on Nickelodeon, and the most distributed property of MTV Networks (another Viacom brand). This media franchise has generated billions of dollars in merchandising revenue. At this level, one can appreciate the magnitude of Hasbro's own brand image aspirations.</p> <p class=\"paywall-full-content invisible\"><strong>Hasbro vs. Disney Animation</strong></p> <p class=\"paywall-full-content invisible\">Hasbro's acquisition of Boulder Animation certainly provides them with an edge but should investors be concerned over the quality of the content they produce? When you compare Disney Animation vs. Boulder, from a purely aesthetic viewpoint, the former appears to prevail. Consider the quality of snow created in the worldwide movie sensation Frozen, for example. Audiences generally take such realism in animation for granted which is what Disney wants - allow the dream to consume and become the new reality.</p> <p class=\"paywall-full-content invisible\">By collaborating with the University of California and Walt Disney Animation Studies, they've perfected animated snow through what's called the Material Point Method. The MPM (<a href=\"https://www.disneyanimation.com/technology/publications\" rel=\"nofollow\">Material Point Method</a>) algorithm can be summed up in a 10-point overview that reads likes a manual of the Higgs boson Standard Model of particle physics. The takeaway here is that it is just one illustration of a very high tech standard of Disney's superb execution of their mission to be one of the world's leading producers and providers of entertainment. And, as a matter worth considering, it took decades of research and development to achieve.</p> <p class=\"paywall-full-content invisible\">Part of <a href=\"https://www.bouldermedia.tv\" rel=\"nofollow\">Boulder Animation's</a> process to create animated art is generated by a highly sophisticated software called Toon Boom used for series like the Primetime Emmy Award winning Bob's Burgers for the Fox Broadcasting Company. This software has the capacity to create illusions of depth as well as combining 3D imported models with 2D animation for hybrid productions. As a result, Boulder has produced fairly well-known animated series for Time Warner's (TWX) Cartoon Network like The Amazing World of Gumball and Fosters Home for Imaginary Friends.</p> <p class=\"paywall-full-content invisible\">As for Fosters, the graphics have the feel of a next generation cartoon, like the early Bugs Bunny episodes but slightly better in terms of quality but nowhere near the hyper-realism of a Frozen snowball. While the quality of the animation seems important, it doesn't necessarily represent a must-have in the formula for an animated production's success. Again, investors can easily point to the prime example of the multibillion-dollar success, but less sophisticated production, SpongeBob SquarePants, the animated series.</p> <p class=\"paywall-full-content invisible\"><strong>Going Back Full Circle - It's All About Storytelling</strong></p> <p class=\"paywall-full-content invisible\">As Hasbro's CEO alluded to in his opening remarks on this most recent conference call, without a good story, the best technology in the world is useless. Creating a good story - a great story - is Hasbro's challenge. And, until they have one, they will remain branded to the world as the toy company.</p> <p class=\"paywall-full-content invisible\">For investors, being the world's greatest toy company is just fine. Concerning the foreseeable future, Hasbro has been doing a magnificent job maintaining and acquiring partnerships with media giants to produce and deliver non-proprietary products. These companies, like Disney, are aware of Hasbro's desire to expand deeper into multi-media productions with their own products.</p> <p class=\"paywall-full-content invisible\">It is somewhat ironic for investors to be pleased that Hasbro is not quite the competitive threat to their partners - just yet. That is, should they eventually alter their brand beyond the toy maker, which would include instant, global recognition as a world class story teller, then these current partnerships might become jeopardized. It is a theoretical catch-22 for Hasbro, one in which they have, as previously noted, been balancing very well.</p> <p class=\"paywall-full-content invisible\">When the takeover of Dreamworks (DWA) by Hasbro <a href=\"https://dealbook.nytimes.com/2014/11/14/hasbro-said-to-end-talks-to-take-over-dreamworks-animation/?_r=0\" rel=\"nofollow\">reportedly ended</a> on November 17, 2014, there were concerns, particularly out of Piper Jeffrey, about how its partner Disney could hinder, or become threatened, by that relationship. The takeover failed and the toy maker went back to doing what it does best. This year, Comcast (<a href=\"https://seekingalpha.com/symbol/CMCSA\" title=\"Comcast Corporation\">CMCSA</a>) snatched Dreamworks in a $3.8 billion deal offering DWA a 50% premium to its stock price. Today, as testament to its agility, Hasbro is a partner with Dreamworks and Comcast to <a href=\"https://www.licensing.biz/news/read/dreamworks-animation-reveals-new-licensees-for-trolls-film/043396\" rel=\"nofollow\">produce products</a> for the movie Trolls.</p> <p class=\"paywall-full-content invisible\">Investors seeking an opening position in Hasbro should consider an alternative investment within, for instance, one of the associated or partner companies listed in this article. In my opinion, while Hasbro's current valuation fairly reflects its growth prospects, it assumes the fulfillment of their mission to create the world's best play experiences within an unspecified period of time.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">It is clear, by their expansion into multiple media channels, that they seek to move beyond the toy company model and image. Until they make that transition, until their brand and logo is just as discernible as mouse ears, I will observe Hasbro's great story from the sidelines.</p>", "twitContent": "$HAS - Hasbro's Remarkable Branding Predicament. https://seekingalpha.com/article/3991939-hasbros-remarkable-branding-predicament?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "101580", "type": "author"}}, "sentiments": {"data": [{"id": "176382", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": [{"id": "86", "type": "tag"}]}, "otherTags": {"data": [{"id": "568029", "type": "tag"}, {"id": "1936", "type": "tag"}, {"id": "115472", "type": "tag"}, {"id": "142771", "type": "tag"}, {"id": "142801", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "162415", "type": "tag"}, {"id": "10727", "type": "tag"}, {"id": "114682", "type": "tag"}, {"id": "114692", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/3991939-hasbros-remarkable-branding-predicament", "canonical": "https://seekingalpha.com/article/3991939-hasbros-remarkable-branding-predicament", "uriImage": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png", "schemaImage": null}}, "included": [{"id": "101580", "type": "author", "attributes": {"company": null, "slug": "grassroots-trading", "userId": 47303334, "tagId": 568029, "bio": "<p>The mission of Grassroots Trading rests on the following principles: providing objective, unbiased, and balanced research, backed by solid data and completely void of emotional influences or preference for companies; focusing on small- to mid-cap companies, offering the Seeking Alpha investor compelling points of view on these often overlooked investment opportunities; and periodically identifying potential opportunities in large- and mega-cap companies, expanding the scope to provide encompassing coverage of the dynamic equity markets.</p>", "image": {"small": "https://static2.seekingalpha.com/images/users_profile/047/303/334/small_pic.png", "medium": "https://static2.seekingalpha.com/images/users_profile/047/303/334/medium_pic.png", "big": "https://static2.seekingalpha.com/images/users_profile/047/303/334/big_pic.png", "extra_large": "https://static2.seekingalpha.com/images/users_profile/047/303/334/extra_large_pic.png"}, "nick": "Grassroots Trading", "deactivated": null, "memberSince": 2016, "isRss": false, "contributorSince": 2016, "followersCount": 983}, "relationships": {"user": {"data": {"id": "47303334", "type": "user"}}, "userBioTags": {"data": [{"id": "885563", "type": "userBioTag"}, {"id": "885564", "type": "userBioTag"}, {"id": "885565", "type": "userBioTag"}, {"id": "885566", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/grassroots-trading", "profileUrl": "/author/grassroots-trading", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "86", "type": "tag", "attributes": {"slug": "dis", "name": "DIS", "company": "The Walt Disney Company", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NYSE", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {}, "links": {"self": "/symbol/DIS"}}, {"id": "568029", "type": "tag", "attributes": {"slug": "grassroots-trading", "name": "Grassroots Trading", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/grassroots-trading"}}, {"id": "1936", "type": "tag", "attributes": {"slug": "long-ideas", "name": "Long Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=long-ideas"}}, {"id": "115472", "type": "tag", "attributes": {"slug": "growth", "name": "Growth", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=growth"}}, {"id": "142771", "type": "tag", "attributes": {"slug": "changing-market", "name": "Changing Market", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=changing-market"}}, {"id": "142801", "type": "tag", "attributes": {"slug": "expanding-production", "name": "Expanding Production", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=expanding-production"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "162415", "type": "tag", "attributes": {"slug": "premium-base-payment", "name": "", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/premium-base-payment"}}, {"id": "10727", "type": "tag", "attributes": {"slug": "investing-ideas", "name": "Investing Ideas", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-ideas"}}, {"id": "114682", "type": "tag", "attributes": {"slug": "alpha-rich-investment-style", "name": "Alpha-Rich Investment Style", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/alpha-rich-investment-style"}}, {"id": "114692", "type": "tag", "attributes": {"slug": "alpha-rich-opportunity", "name": "Alpha-Rich Opportunity", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/alpha-rich-opportunity"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "176382", "type": "sentiment", "attributes": {"articleId": 3991939, "type": "bullish", "createdAt": "2016-07-27T06:57:15.000-04:00", "typeId": 1}, "relationships": {"article": {"data": {"id": "3991939", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}