{"data": {"id": "4409832", "type": "fullArticle", "attributes": {"publishOn": "2021-02-27T05:22:57-05:00", "isLockedPro": false, "commentCount": 4, "gettyImageUrl": null, "videoPreviewUrl": null, "videoDuration": null, "themes": {"patrick-doyle": {"id": 578431, "slug": "patrick-doyle", "kind": "common", "non_theme": true}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Switching To Neutral On Hasbro", "summary": ["I think this is a wonderful business, and I think the dividend remains intact in spite of a huge uptick in interest expense.", "That said, the shares are arguably a bit optimistically priced, and that's never a good sign in my estimation.", "For those who don't currently own shares, I think a short, deep out of the money put makes the most sense here."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2021-02-27T05:22:57-05:00", "isModerated": false, "closestTradingDate": "2021-03-01", "beforeOpeningHours": true, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 3, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I am/we are long HAS.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span><br /><br />I&#39;ll be selling 10 of the puts described in this article.</p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p>Since I wrote my bullish <a href=\"https://seekingalpha.com/article/4355656-hasbro-inc-is-buy\">piece</a> on Habro Inc. (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) several months ago, the shares are up about 30.5% against a gain of about 24.5% for the S&amp;P 500. Several factors have caused me to look at the company again. Hasbro just published its 10-K, and that’s always an exciting read. I also built a new Dungeons and Dragons character, and whenever I do that, I inevitably think of the company that is making buckets of money on this and so many other great assets. In case the curiosity is too much for you, I’ll tell you that my new character is a dragonborn ranger. I’ve never played a dragonborn before, and I promise to keep you posted on our progress.</p> <p>In this article I want to review my investment thesis and decide whether it’s reasonable to continue to hold the shares. I’ll make this determination by looking at the financial results and the stock as a thing quite distinct from the underlying business. I’ll also suggest a risk to the bullish thesis here. Finally, I’ll update you on the short puts that just expired, dear readers. My primary motivation for doing so is, of course, to brag. There’s another (far less important to me) motivation than ego gratification to write about this, though, and that is to demonstrate the risk reducing, return enhancing power of these things.</p> <p>I imagine you’re a busy crowd, dear readers. You’ve got dungeons to explore, Beholders to negotiate with, and spells to memorize, so I’ll come right to the point. I think this is a wonderful business, and in some ways the shares are cheaper now than they were when I last looked at the name. That said, I think the assumptions embedded in the current price are a bit unrealistic, and so I’m switching to neutral on this name. I’ll neither sell nor add<span class=\"paywall-full-content invisible\"> to my position here. That said, I will be initiating another short put trade because the last one was so successful. If you don’t currently own shares, I think this is the best way forward for you at the moment.</span></p> <h2 class=\"paywall-full-content invisible\"><strong>Financial Snapshot</strong></h2> <p class=\"paywall-full-content invisible\">In my previous missive on this name, I went into some depth about why the dividend is very well covered in this case. People who are interested, and are in a particularly masochistic frame of mind are encouraged to review my earlier work dealing with that subject specifically. Suffice to say that I consider the dividend very well covered. The fact that the shares are priced at a forward dividend yield of ~3% is an enormous bonus in my estimation.</p> <p class=\"paywall-full-content invisible\">In this financial update, I want to focus on answering the question “why did net earnings decline by 56% from 2019 in spite of a 15.8% uptick in revenue?” There are several causes for the decline in GAAP earnings. For example, there was a $218 million acquisition cost that hit the financials in 2020, up from $0. There was also a $301 million uptick in program cost amortization, which was driven largely by the eOne business, which experiences higher program cost amortization as a percentage of net sales. Royalty expenses also increased by $155 million, which is a very good sign obviously. Finally, amortization of intangible assets increased by ~$98 million, largely driven by the Power Rangers property rights. Finally, Selling, Distribution and Administration expenses increased $215 million, driven by the eOne business and by higher freight expenses related to Covid.</p> <p class=\"paywall-full-content invisible\">Much of these expenses are GAAP, obviously, and these have a limited impact on the company’s ability to pay dividends, at least in the short term. In spite of the fact that net interest expense has ballooned by $121 million, I think the dividend remains well covered. For that reason, I’d be happy to continue to own the shares at the right price.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2021/2/26/saupload_XK9Hmv45Fdjd5mjkwdKSE_TkX36ZmoB6bUAar1DrBDdcyYdjIdtP1dzd-qRwv575cyjFmUOta2reCb3BceUFXT89aey1sVix7k12tiAeOQaPF-T3Q8AjuJ1VWTc9p-fE-oylLUBW.png\" width=\"624\" height=\"175\" data-width=\"755\" data-height=\"212\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkdin=\"false\" fetchpriority=\"high\"></p> <p class=\"paywall-full-content invisible\">Source: Company filings</p> <h2 class=\"paywall-full-content invisible\"><strong>The Stock</strong></h2> <p class=\"paywall-full-content invisible\">I’ve written it before, and I’ll write it again, dear readers. A great company like this one can be a good or a bad investment depending entirely on the price paid. I know that’s a relatively easy concept to grasp in the abstract, but I’m didactic enough to want to make the point explicit by using Hasbro itself as an example. So to pick a random, and highly convenient date totally at random, if an investor bought shares of Hasbro Inc. in mid-October of 2019 at a price of ~$122, they’d be sitting on a loss of ~23% as of now. Had they waited five months and bought at $45, they’d be sitting on a gain of ~109%. It’s not like the narrative changed very much from one period to the next. The differential in results was entirely a function of the price paid. For that reason, I want to be rather hardnosed when it comes to buying stock. I’ll only do it if the shares are reasonably priced. By “reasonably”, I mean “cheaply.”</p> <p class=\"paywall-full-content invisible\">My regular reader victims know that I judge whether shares are cheap or not in a few ways, ranging from the simple to the more complex. On the simple side, I look at the ratio of price to some measure of economic value, like earnings, free cash flow and the like. Ideally, I want to see the company trading at a discount to both the overall market and its own history. In my previous missive on this name, I went on about how the shares were inexpensive because they were trading near the low end of their historical range, at a price to free cash flow just over 17 times. On that basis, the shares are about 10% cheaper now, and they were only cheaper than they are now at the height (depths?) of 2020’s large Covid inspired selloff.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\" data-id=\"null\" data-name=\"null\"><img src=\"https://static.seekingalpha.com/uploads/2021/2/26/saupload_8b3fc3a9eeb279595169bbc2dcbbd51b.png\" class=\"sa-ycharts-img\" alt=\"Chart\" width=\"635\" height=\"366\" data-width=\"635\" data-height=\"419\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\" loading=\"lazy\">Data by YCharts</figure></p> <p class=\"paywall-full-content invisible\">In addition, I want to try to understand the assumptions that are currently embedded in price. In order to do this, I turn to the work described by Professor Stephen Penman in his book \"Accounting for Value.\" In this book, Penman walks investors through how they can use the magic of highschool algebra to isolate the \"g\" (growth) variable in a standard finance formula. This enables us to work out what the market must be assuming about the future for a given company. Applying this methodology to Hasbro at the moment suggests that the market is forecasting a long term (i.e. perpetual) growth rate of ~6.3%. I consider this to be a somewhat optimistic forecast, given the history of more staid 3% growth, and for that reason, I consider the shares to be modestly overpriced at the moment. For that reason, I want to neither sell nor add to my position here.</p> <h2 class=\"paywall-full-content invisible\"><strong>(Slight) Risk to the Bullish Case</strong></h2> <p class=\"paywall-full-content invisible\">I’m not alone in worrying that movies set in the Dungeons &amp; Dragons and Magic The Gathering worlds are financially very risky propositions. Everyone I play these games with are old enough to remember the last time someone tried to produce a Dungeons &amp; Dragons <a href=\"https://www.youtube.com/watch?v=mOCGeOtjIHQ\" rel=\"nofollow\">movie</a>, and the results were as muted as the performances were, uh, \"aggressive.” As a side note, I met Jeremy Irons in the 1990s when he was still an actor. Anyway, the nature of these properties is such that this is a very challenging IP to <a href=\"https://www.youtube.com/watch?v=pgnZFdtoyHM\" rel=\"nofollow\">produce</a>. Because the company will need to appeal to relatively hardcore gamers like myself, while also appealing to a wider audience. Many decades of experience trying to introduce “normal” friends, family, and girlfriends to this game indicate to me that bringing along non-fans will be a challenge. At the same time, the company runs the risk of alienating super fans by taking a “subversive” approach to any story is a source of immeasurable cringe to many of us super-fans. I, like so many of my peers, want our expectations to remain very much sustained, upheld and definitely not “subverted.”</p> <h2 class=\"paywall-full-content invisible\"><strong>Options Update</strong></h2> <p class=\"paywall-full-content invisible\">In my previous missive on this name, I recommended selling the January 2021 puts with a strike of $50 for $3.10. These expired worthless last month, which enhances the return on these shares by ~4.4%. To remind investors, had I been exercised on these, I would have bought them at a price ~33% below the then current price, which is the definition of lower risk. Since this didn’t happen, I simply pocketed the premium, which is the definition of higher return. I hope you’re starting to see why I consider short puts to be a win-win strategy, dear reader.</p> <p class=\"paywall-full-content invisible\">Given that I like to try to repeat success when I can, I’m recommending a very similar trade again. Specifically, I think selling the July puts with a strike of $70 makes the most sense at the moment. These are priced at $1.30-$1.95, so if the investor simply takes the bid on these, and is subsequently exercised, they’ll be buying at a net price ~27% below the current market price. This price would drive the dividend yield to about 4%. If the shares remain above that price, obviously the investor simply pockets the premium as I just did on the puts that expired.</p> <p class=\"paywall-full-content invisible\">Now that you're hopefully excited about the prospects of a win-win trade, dear readers, it's time for me to spoil the mood as I so often do by writing about risk. The fact of the matter is that every investment comes with risk, and short puts are no exception. We do our best to navigate the world by exchanging one pair of risk-reward trade-offs for another. For example, holding cash presents the risk of erosion of purchasing power via inflation and the reward of preserving capital at times of extreme volatility. The risks of share ownership should be obvious to readers on this forum.</p> <p class=\"paywall-full-content invisible\">I think the risks of put options are very similar to those associated with a long stock position. If the shares drop in price, the stockholder loses money, and the short put writer may be obliged to buy the stock. Thus, both long stock and short put investors typically want to see higher stock prices.</p> <p class=\"paywall-full-content invisible\">Puts are distinct from stocks in that some put writers don't want to actually buy the stock - they simply want to collect premia. Such investors care more about maximizing their income and will, therefore, be less discriminating about which stock they sell puts on. These people don't want to own the underlying security. I like my sleep far too much to play short puts in this way. I'm only willing to sell puts on companies I'm willing to buy at prices I'm willing to pay. For that reason, being exercised isn't the hardship for me that it might be for many other put writers. My advice is that if you are considering this strategy yourself, you would be wise to only ever write puts on companies you'd be happy to own.</p> <p class=\"paywall-full-content invisible\">In my view, put writers take on risk, but they take on less risk (sometimes significantly less risk) than stock buyers in a critical way. Short put writers generate income simply for taking on the obligation to buy a business that they like at a price that they find attractive. This circumstance is objectively better than simply taking the prevailing market price. This is why I consider the risks of selling puts on a given day to be far lower than the risks associated with simply buying the stock on that day.</p> <p class=\"paywall-full-content invisible\">I'll conclude this rather long discussion of risks by looking again as the specifics of the trade I'm recommending this morning. I'll be selling the puts described above that have one of two outcomes. Either the shares remain above $70 over the next five months, at which point I will have generated ~1.85% in five months, which I consider to be acceptable. If the shares fall in price, I will buy the shares at a net price ~27% below the current, fairly priced level. Both outcomes are very acceptable in my view, so I consider this trade to be the definition of \"risk reducing.\" That's an ironic way to end a discussion of risk, but it's the truth.</p> <h2 class=\"paywall-full-content invisible\"><strong>Conclusion</strong></h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">I think Hasbro is an excellent business, and I’m happy to continue to own the shares given my original cost base. Some part of me hopes for yet another market correction so I can acquire more at $70. That said, I don’t think it’s worth buying more at the moment, so I’m switching to neutral on this excellent business. I admit that the shares may drop in price from here, but I am comfortable sitting on the well covered dividend. My only fear where this company is concerned is that they produce a movie that is as abominable as the one made two decades ago. If you don’t own shares, I wouldn’t recommend buying at current prices, but I think you could do worse than selling the puts described above.</p>", "twitContent": "$HAS - Switching To Neutral On Hasbro. https://seekingalpha.com/article/4409832-switching-to-neutral-hasbro?source=tweet ", "innerMarketing": null, "marketingBullet": "", "isReit": false, "videoData": null, "marketingBulletVariant": null, "marketingBio": null, "audioDuration": null}, "relationships": {"author": {"data": {"id": "104099", "type": "author"}}, "sentiments": {"data": [{"id": "315104", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "578431", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4409832-switching-to-neutral-hasbro", "canonical": "https://seekingalpha.com/article/4409832-switching-to-neutral-hasbro", "uriImage": "https://static.seekingalpha.com/uploads/2021/2/26/saupload_XK9Hmv45Fdjd5mjkwdKSE_TkX36ZmoB6bUAar1DrBDdcyYdjIdtP1dzd-qRwv575cyjFmUOta2reCb3BceUFXT89aey1sVix7k12tiAeOQaPF-T3Q8AjuJ1VWTc9p-fE-oylLUBW.png", "schemaImage": {"@type": "ImageObject", "url": "https://static.seekingalpha.com/uploads/2021/2/26/saupload_XK9Hmv45Fdjd5mjkwdKSE_TkX36ZmoB6bUAar1DrBDdcyYdjIdtP1dzd-qRwv575cyjFmUOta2reCb3BceUFXT89aey1sVix7k12tiAeOQaPF-T3Q8AjuJ1VWTc9p-fE-oylLUBW.png"}}}, "included": [{"id": "104099", "type": "author", "attributes": {"company": null, "slug": "patrick-doyle", "userId": 48515253, "tagId": 578431, "bio": "<p>I'm a quant investment newsletter writer who marries fundamental analysis with the latest research in momentum. Over the past few years, I’ve developed a piece of software that helps me track the level of optimism and pessimism embedded in stock price. I seek to challenge the assumptions embedded in price by profitably exploiting the disconnect between what the market thinks and what is a likely outcome. I invest in those companies that have a greater than average chance of giving us all a surprise in the next few months. </p><p><br></p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/048/515/253/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/048/515/253/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/048/515/253/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/048/515/253/extra_large_pic.png"}, "nick": "Patrick Doyle", "deactivated": null, "memberSince": 2017, "isRss": false, "contributorSince": 2018, "followersCount": 7175}, "relationships": {"user": {"data": {"id": "48515253", "type": "user"}}, "userBioTags": {"data": [{"id": "927945", "type": "userBioTag"}, {"id": "927946", "type": "userBioTag"}, {"id": "927947", "type": "userBioTag"}, {"id": "927948", "type": "userBioTag"}]}, "authorResearch": {"data": null}}, "links": {"self": "/author/patrick-doyle", "profileUrl": "/author/patrick-doyle", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "578431", "type": "tag", "attributes": {"slug": "patrick-doyle", "name": "Patrick Doyle", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/patrick-doyle"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "315104", "type": "sentiment", "attributes": {"articleId": 4409832, "type": "neutral", "createdAt": "2021-02-27T05:22:57.000-05:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4409832", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}