{"data": {"id": "4435199", "type": "fullArticle", "attributes": {"publishOn": "2021-06-16T15:33:54-04:00", "isLockedPro": false, "commentCount": 23, "gettyImageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg", "videoPreviewUrl": null, "videoDuration": null, "themes": {"nicholas-ward": {"id": 97701, "slug": "nicholas-ward", "kind": "common", "non_theme": true}, "dividends": {"id": 22, "slug": "dividends", "kind": "breadcrumb", "path": "/dividends", "title": "Dividends Analysis", "sasource": "theme_breadcrumb"}, "dividend-ideas": {"id": 156, "slug": "dividend-ideas", "kind": "breadcrumb", "path": "/dividends/dividend-ideas", "title": "Dividend Ideas", "sasource": "theme_breadcrumb"}, "has": {"id": 4040, "slug": "has", "kind": "common", "non_theme": true}, "consumer-goods": {"id": 17829, "slug": "consumer-goods", "kind": "common", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "non_theme": true}, "sa-exclusive": {"id": 17335, "slug": "sa-exclusive", "kind": "general"}, "investing-income": {"id": 16549, "slug": "investing-income", "kind": "general"}, "us": {"id": 326, "slug": "us", "kind": "common", "non_theme": true}, "toys-games": {"id": 17860, "slug": "toys-games", "kind": "common", "non_theme": true}, "consumer-discretionary": {"id": 25, "slug": "consumer-discretionary", "kind": "sector", "path": "/stock-ideas/consumer-goods", "title": "Consumer ", "sasource": "theme_breadcrumb"}}, "title": "Hasbro: Starting To Look Attractive With Double-Digit Growth Ahead", "summary": ["Forgive me while I geek out on Magic the Gathering products.", "Hasbro's Q1 results are solid and I expect the company to outperform expectation in 2021 on the back of strong Wizards of the Coast results.", "Using 2022 expectations, I think that HAS shares are fairly valued.", "This company has generated strong outperformance over the long-term and moving forward, I wouldn't be surprised to see that trend continue."], "structuredInsights": null, "isPaywalled": false, "lastModified": "2021-06-16T15:34:07-04:00", "isModerated": false, "closestTradingDate": "2021-06-16", "beforeOpeningHours": false, "isEarningsSlides": false, "isExclusive": true, "isTranscript": false, "excludedByTag": false, "transcriptPath": null, "likesCount": 6, "disabledStatus": "allowed", "disabledMessage": null, "status": "published", "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b> <span>I/we have no positions in any stocks mentioned, but may initiate a long position in HAS over the next 72 hours.</span> <span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>", "articleActionableItem": null, "inEmbargo": false, "isNoindex": false, "isNoarchive": true, "content": "<p><figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-w750\" alt=\"Magic the Gathering Oath of the Gatewatch Trading Card Game\" data-id=\"512885688\" data-type=\"getty-image\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-w240 240w\" width=\"4288px\" height=\"2848px\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"></picture><figcaption>CTRPhotos/iStock Editorial via Getty Images</figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>I just signed up for my first paper Magic the Gathering event in over a year and I can't express how excited this makes me.</p> <p>Obviously having to forgo playing a trading card game was<span class=\"paywall-full-content invisible\"> the least of my concerns when it came to keeping myself, my family, and my community safe throughout a global pandemic; however, I will say that it feels great to be able to start to get back to normal life again.</span></p> <p class=\"paywall-full-content invisible\">I've spent weeks watching the Modern Horizons 2 set spoilers and frankly, this looks like Magic's best set in years (in my humble opinion, at least). And that's saying a lot for a division of Hasbro (<span class=\"ticker-hover-wrapper\">NASDAQ:<a href=\"https://seekingalpha.com/symbol/HAS\" title=\"Hasbro, Inc.\">HAS</a></span>) that has been driving double-digit growth for the company.</p> <p class=\"paywall-full-content invisible\">I can't wait to add Rishadan Dockhand, Tide Shaper, and Svyelun of Sea and Sky to my Merfolk deck and play a little mono-blue ponza. Titania, Protector of Argoth is a godsend to the modern Lands archetype after the Field of the Dead ban. Ragavan, Nimble Pilferer is arguably the best red 1-drop creature of all-time. Esper Sentinel slots nicely into both Humans and Taxes builds. There are plenty of singles that commander players are going to want to own. Oh, and enemy fetch-lands reprints? Don't mind if I do.</p> <p class=\"paywall-full-content invisible\">I could nerd-out and let this list go on and on, but I'll save all the non-TCG players out there from my excitement. Needless to say, I'll be spending a lot of money on this product. I imagine many other MTG players will as well. And while I'm sure that much of the prior paragraph has read like gibberish to many investors out there (however, I will note that people looking to diversify their holdings into alternative assets/collectables may want to take a look at Alpha/Beta/Reserved list-type of Magic cards because frankly, over the last several decades, there are few asset classes that have performed better from a capital appreciation standpoint), the point is, the Modern Horizons 2 set is going to be a major growth vehicle for Hasbro in Q2.</p> <p class=\"paywall-full-content invisible\">And therefore, the moment that I pre-ordered my MH2 pre-release kit, I knew that I wanted to celebrate this milestone with an article on Wizards of the Coast's parent company, Hasbro, to see whether or not I should be spending as much money on HAS stock as I plan to do on the company's cardboard products in the near future.</p> <h2 class=\"paywall-full-content invisible\">A Sustainably Growing Dividend</h2> <p class=\"paywall-full-content invisible\">Hasbro is a name that I track fairly regularly because of my love for Magic the Gathering. And thankfully, not only does HAS make some of my favorite consumer discretionary products, but it's a great dividend growth company as well.</p> <p class=\"paywall-full-content invisible\">This company is on a 17-year annual dividend growth streak. This rising dividend was supported with strong bottom-line growth and I suspect HAS will be a dividend aristocrat in the not-too-distant future.</p> <p class=\"paywall-full-content invisible\">Over the years, HAS has impressed me with its ability to evolve and adapt with the changing times. This is what signifies a blue-chip company, in my opinion.</p> <p class=\"paywall-full-content invisible\">In the year 2000, HAS generated an operating loss of more than $100m, which was a wake-up call of sorts for the company. HAS sold off ancillary brands and began to focus on its core products/brands, which is a strategy that has served the company well since. Since the company's restructuring process in 2001, we've seen HAS's EPS compound at a double-digit clip.</p> <p class=\"paywall-full-content invisible\">Even during the Great Recession, HAS shares performed well, generating EPS growth of 42% in 2007, -1% in 2008, and 24% in 2009.</p> <p class=\"paywall-full-content invisible\">From 2001-2017, HAS produced an EPS growth CAGR of approximately 17.4%. It's difficult to find a stock in the market with better bottom-line results over that period of time. However, things changed in 2018 in a major way.</p> <p class=\"paywall-full-content invisible\">In 2018, we saw Toys'R'Us go bankrupt, which was yet another wake up call for the toy industry as a whole. HAS, specifically, was heavily exposed to that specific retail outlet and saw its sales fall 12% during the year when Toys'R'Us shuttered its doors globally. The company's bottom-line suffered even more with earnings falling 29% as the company attempted to liquidate inventories across the world.</p> <p class=\"paywall-full-content invisible\">Thankfully, management's conservative stance with regard to the dividend payout ratio meant that even during a year where the company faced unprecedented issues, the dividend was not only maintained, but continued to grow.</p> <p class=\"paywall-full-content invisible\">And since 2018, HAS has taken steps, yet again, to fortify its business, really focusing on its brand strength (once again), and a more diversified and even direct-to-consumer distribution. The focus on its major brands appears to have strengthened them and the company's recent Q1 results showed this strength.</p> <h2 class=\"paywall-full-content invisible\">Q1 Results</h2> <p class=\"paywall-full-content invisible\">During Q1, the company's y/y top-line growth was tepid, at just 1%; however, HAS's operating profit increased by 15% with adjusted EBITDA growing by 24%.</p> <p class=\"paywall-full-content invisible\">The company generated operating cash flows of $378m during Q1, which helped the company to bolster its cash position to $1.43b while paying off roughly $300m in debt. As you can see below, during the last year, Hasbro's cash is up and its debt is down. This is a somewhat unique trend for a company coming out of the pandemic period.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2021/6/11/saupload_QEsVlG-wlUY_Dct5XqXLuqSUgaIXFH7x9kQTxKAdRV2N-4ulNC5D_bQ6Nww-R3WZ7If_msjsFN-OiqhxFYWa2q5puEAJsMUuhtLfkPnlaeic-6TZx7dKpqqDECLLSXySSbYbXfLp.png\" width=\"624\" height=\"352\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Source: <a href=\"https://seekingalpha.com/article/4421598-hasbro-inc-2021-q1-results-earnings-call-presentation\">HAS Q1 ER Presentation</a></p> <p class=\"paywall-full-content invisible\">This growth came during a period where the company's entertainment segment posted -32% growth (due primarily to issues in the TV/Film business). The entertainment space has proven to be one of the slower recovering industries thus far coming out of the pandemic and I think solid upside remains here. However, it's also important to note that HAS has taken steps to divest entertainment-related assets/brands and it appears that the company is once again doubling down on what works, which has proven to be its consumer products.</p> <p class=\"paywall-full-content invisible\">As you can see below, the company's product segments all posted positive growth during Q1, led by the strong double-digit growth of its franchise brands.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2021/6/11/saupload_fU410xoRgs8Q1LBqcTt9Z1CxWfmTcdIo7yfbK6jlDZnsZuv1St3Qdo6CFOa8nLlyYiXq3VY1TwjIPh_wXb4tfG73FTbiZOe4qt554dOtYOhmgiyliJ1ePMj9NkmKJ5jC-tWp0h5_.png\" width=\"624\" height=\"356\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Source: <a href=\"https://seekingalpha.com/article/4421598-hasbro-inc-2021-q1-results-earnings-call-presentation\">HAS Q1 ER Presentation</a></p> <p class=\"paywall-full-content invisible\">Also, you'll see that this consumer strength was fairly widespread, with growth coming from all of the company's major geographic regions.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2021/6/11/saupload_gQ6ILV1_FhB-yC9SsGbKE41M2Pssd9HVxdrYMyBTHcD1C1Ry8ZWoOlRa-KA0Cq0MhqVQVKfx12yUXAVjA45eD2P6XNg2CKOhCBB6iz62yIdKxw_6ONyVUBkSWRVDP4_5rhcz_dt7.png\" width=\"624\" height=\"363\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Source: <a href=\"https://seekingalpha.com/article/4421598-hasbro-inc-2021-q1-results-earnings-call-presentation\">HAS Q1 ER Presentation</a></p> <p class=\"paywall-full-content invisible\">The Wizards of the Coast segment that I referred to in the opening continues to be a leading segment of the company. WotC posted strong double-digit top and bottom-line growth during Q1. I fully expect that trend to remain intact throughout the rest of the year with the Modern Horizons set released in Q2, followed by a Dungeons and Dragons Magic the Gathering set being released in Q3 which is likely to bring even more players into the MtG fold. Plus, Wizards continues to release special sets, such as Secret Lairs, which allow it to unlock more value from its IP, selling cards directly to consumers (without forcing them to crack packs) for the first time. The Secret Lair program is fairly new, but the margins of these products have to be unreal (in April, WotC's Secret Lair sales offered anywhere from 3-6 cards for ~$30, which is a hefty price to pay for a piece of rectangular cardboard) and so long as there is demand for the products, I suspect these supplemental sets will continue to bolster cash flows for many quarters to come.</p> <p class=\"paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2021/6/11/saupload_d50U4MjPzJ-8I1QbTKy0TbkrPas3TOcaiBLK91ACxzcZGJFCLwTg-3g0pdVbeVpfNH4jWJ-JytVn2HEuSM67I7ktSMT22mv7qSXMVa5Qh5ypJ6zxbwcWHctcg0AwdPsmefrQGTf6.png\" width=\"624\" height=\"353\" loading=\"lazy\"></p> <p class=\"paywall-full-content invisible\">Source: <a href=\"https://seekingalpha.com/article/4421598-hasbro-inc-2021-q1-results-earnings-call-presentation\">HAS Q1 ER Presentation</a></p> <h2 class=\"paywall-full-content invisible\">Valuation</h2> <p class=\"paywall-full-content invisible\">And, as you can see on the F.A.S.T. Graph below, the strong results being generated by this company has outperformed the S&amp;P 500 by a fairly wide margin over the long-term.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2021/6/11/saupload_rqm9Lnu-rJ0jhAbt_10YNqy1lFuSWxdtO4-h5INmaN0BQ7eZ7ULVWa5Cpd2tBLHzGd_yhFVxlLv6-MeufsWAyRuYBKeCrwFXKvwstFyyTLcnjHz3-7Y5MAn1a1cDb2lHCbqh1ov-.png\" rel=\"lightbox\" data-width=\"1600\" data-height=\"978\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2021/6/11/saupload_rqm9Lnu-rJ0jhAbt_10YNqy1lFuSWxdtO4-h5INmaN0BQ7eZ7ULVWa5Cpd2tBLHzGd_yhFVxlLv6-MeufsWAyRuYBKeCrwFXKvwstFyyTLcnjHz3-7Y5MAn1a1cDb2lHCbqh1ov-_thumb1.png\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Source: F.A.S.T. Graphs</p> <p class=\"paywall-full-content invisible\">Looking back over a ~20-year time frame, we see that a $1,000 investment into HAS, with dividend being re-invested at the end of every quarter, will have turned into a roughly $14,700 position, generating a 14% annualized rate of return over that period of time, beating the S&amp;P 500's 8.6% ROR.</p> <p class=\"paywall-full-content invisible\">That same $1,000 investment into the SPY with dividend re-invested would have only grown to roughly $5,300, showing that this toy company certainly has what it takes to not only generate significant wealth over the long-term, but alpha too.</p> <p class=\"paywall-full-content invisible\">The alpha that HAS has generated over the years (and the underlying growth that has allowed such outperformance to occur) has helped shares maintain a high premium, in terms of its valuation. On this chart, you'll see that you have to go back nearly a decade to find a period of time when HAS traded below its long-term average multiple of ~18x earnings for a prolonged period of time.</p> <p class=\"paywall-full-content invisible\">I generally prefer to initiate positions in companies at double-digit margins of safety, which is why, even though I spend entirely too much money on Wizards of the Coast products every year, I don't own shares.</p> <p class=\"paywall-full-content invisible\">But, due to my bullish outlook on forward-looking growth here, combined with the little dip that HAS has experienced in recent weeks, HAS shares are beginning to look interesting from a valuation standpoint.</p> <p class=\"paywall-full-content invisible\"><span><a href=\"https://static.seekingalpha.com/uploads/2021/6/11/saupload_yTH34kzRHpaGGIh10GlTZuVCgudKU4Fu5NMpIGLBjaoYNppNx1BXZo9wNzvw47kdaghpdafuhTBOYmjcuCtx-qaLnluxjEz6r49iMY_qPL4vZNpptCIqAD3M7LrPgD7JVFT4STJD.png\" rel=\"lightbox\" data-width=\"1600\" data-height=\"1033\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkdin=\"true\"><img src=\"https://static.seekingalpha.com/uploads/2021/6/11/saupload_yTH34kzRHpaGGIh10GlTZuVCgudKU4Fu5NMpIGLBjaoYNppNx1BXZo9wNzvw47kdaghpdafuhTBOYmjcuCtx-qaLnluxjEz6r49iMY_qPL4vZNpptCIqAD3M7LrPgD7JVFT4STJD_thumb1.png\" loading=\"lazy\"></a></span></p> <p class=\"paywall-full-content invisible\">Source: F.A.S.T. Graphs</p> <p class=\"paywall-full-content invisible\">At first glance at the F.A.S.T. Graph above, it appears that HAS shares are still overvalued, right?</p> <p class=\"paywall-full-content invisible\">After all, the black line (current price) is still above the blue line (long-term average premium).</p> <p class=\"paywall-full-content invisible\">However, I'm not all that interested in the stock's relative premium on a trailing basis. Instead, I'm looking into the future and we see that right now, the current analyst consensus EPS growth estimate for HAS in 2021 is 21%, which is expected to be followed by 13% bottom-line growth in 2022, 12% in 2023, and 23% in 2024 (however, it's very important to note that right now, that 2024 estimate is comprised of just 1 opinion; the rest of the Street hasn't quite gotten around to projecting earnings out that far).</p> <p class=\"paywall-full-content invisible\">And personally, I wouldn't be surprised to see HAS outperform these strong 2021 expectations. With that in mind, I think EPS of $4.50+ for the full year is very likely, with results as high as $4.75-$5.00 being a real possibility. I think 2022 EPS results could easily surpass the $5.25/share threshold. And, with that in mind, on a forward-looking basis, whether you're using my bullish outlook or the consensus outlook, we see that HAS shares aren't quite so expensive on a forward basis.</p> <p class=\"paywall-full-content invisible\">Using analyst consensus estimates, we see that HAS shares are currently trading for 21.4x 2021 expectations and roughly 18.4x 2022 expectations.</p> <p class=\"paywall-full-content invisible\">Using my more bullish outlook, HAS shares are trading with a 19.5x 2021 multiple and an 18.1x 2022 multiple.</p> <p class=\"paywall-full-content invisible\">I don't mind using estimates 18 months out when evaluating shares of a fairly reliable blue-chip like this. Therefore, I think fair value here lies in the ~$95 area (which is ~18x forward, which is in line with the long-term trailing average but below HAS's 5 and 10-year trailing P/E averages of ~21.1x and ~18.6x).</p> <p class=\"paywall-full-content invisible\">However, like I said before, when buying shares, I tend to look for a wide margin of safety. Therefore, when looking at my fair value estimate and applying a discounted multiple, I arrived at an ~$85 price target.</p> <p class=\"paywall-full-content invisible\">$85 represents a ~16x multiple on my 2022 EPS expectations and a 3.2% dividend yield. With those metrics applied to the stock, I believe strong long-term returns are likely.</p> <p class=\"paywall-full-content invisible\">However, I will also say that I believe that long-term investors paying 18.4x earnings for shares of HAS will likely do just fine. Really, it just comes down to risk appetite and what sort of discount individuals feel comfortable with relative to fair value to protect themselves from unforeseen weakness.</p> <p class=\"paywall-full-content invisible\">And frankly, if the broad market rally continues and pushes the names on the rest of my watch list higher and higher (and therefore, further and further away from my price targets), I will likely relent on my margin of safety requirements for a blue-chip name like HAS, assuming it continues to hover in the $95 area, and potentially begin to build a position (because, like Warren Buffett says, it's far better to pay a fair price for a wonderful company than a wonderful price for a fair company).</p> <h2 class=\"paywall-full-content invisible\">Conclusion</h2> <p class=\"paywall-full-content invisible\">At the $95 level, would HAS shares be as cheap as they were during much of 2020? Certainly not. But the pandemic sell-off is in the past and although I know it can be difficult to forget about past opportunities and allow those thoughts to prohibit you from making investments in the present (I certain suffer from this from time to time) I think investors need to compare valuations to the long-term averages instead of the uniquely low prices that we saw a little more than a year ago.</p> <p class=\"paywall-full-content invisible\">I have to admit that I let fear get the best of me here during the worst of the COVID-19 recession.</p> <p class=\"paywall-full-content invisible\">I was watching HAS shares closely as the market plummeted. Historically speaking, this is a company that trades with a ~3% yield attached. I was amazed to see a 4%, and then a 5%, and ultimately, a nearly 6.5% yield attached to HAS shares during the worst of the sell-off. And yet, I didn't buy shares.</p> <p class=\"paywall-full-content invisible\">Thankfully, I didn't let fear get the best of me when it came to many of the other stocks in my portfolio and on my watch list.</p> <p class=\"paywall-full-content invisible\">Obviously, Hasbro wasn't the only high-quality dividend growth name experiencing historically unique weakness during March of 2020, so I had plenty of options when it came to buying discounted blue-chips.</p> <p class=\"paywall-full-content invisible\">During March of 2020, I made 21 purchases. You can see the list of companies that I bought <a href=\"https://seekingalpha.com/article/4336615-nicholas-wards-dividend-growth-portfolio-review-march-2020\">here</a>. I've made money (either realized or unrealized) on every single one of those purchases, so I'm obviously pleased with the results. I may not ever see a better time to buy stocks in my entire life - honestly, it's pretty easy to bat 1.000% when you're buying shares towards the bottom of a record-breaking sell-off.</p> <p class=\"paywall-full-content invisible\">However, with the benefit of hindsight, I wish that I had bought shares of HAS as well (if for no other reason, I could attempt to justify my Magic purchases to my wife by saying that I'm supporting the company's dividend).</p> <p class=\"paywall-full-content invisible\">Yet, I was worried about this company, more so than many of the other blue chips that I followed, because a lot of their products require groups to maximize the fun and I wasn't sure when social gatherings were going to occur. But, harkening back to the adapting/evolving that I discussed earlier in this piece, I should have trusted management to come out of the pandemic stronger than ever and frankly, that's what it appears Hasbro has managed to do.</p> <p class=\"paywall-full-content invisible\">Therefore, I don't plan to make this mistake again. The next time I see HAS trading at a discount to my FV target, I will be building a position.</p> <p class=\"paywall-full-content invisible\">Looking ahead, I really like the company's product pipeline. With specific regard to Wizards of the Coast, I think 2021 is going to be a banner year. Modern Horizons 2 is probably the greatest Magic the Gathering set that I've seen in years, if not decades. It's super nostalgic, with a lot of flavors that players new and old will enjoy. And, because of the strength of the product, Wizards continues to raise its prices. Yet, the market doesn't complain and I don't think this is a trend that is going to end anytime soon either as Hasbro capitalizes on the continued demand for collectables.</p> <p class=\"paywall-full-content invisible\">All in all, I think HAS is a company that dividend growth investors should add to their watch lists and consider accumulating, especially if shares continue to experience weakness (HAS is down roughly 3% over the last month or so). For what it's worth, I'll be contributing my fair share to Q2 sales/earnings and I know I won't be alone.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\"><em>This article was previously published for subscribers to The Dividend Kings.</em></p>", "twitContent": "$HAS - Hasbro: Starting To Look Attractive With Double-Digit Growth Ahead. https://seekingalpha.com/article/4435199-hasbro-starting-to-look-attractive?source=tweet ", "innerMarketing": "<h2>Come Join Safe High Yield </h2><p>Safe High Yield offers one actively managed portfolio, a weekly portfolio review, and real-time trade alerts/stock analysis of the companies included in the portfolio.  </p><p>The portfolio yields roughly 6% right now and has never experienced a dividend cut.  </p><p>We're sticking with the K.I.S.S. (keep it simple, Stupid) mantra for this service, which allows us to offer it to subscribers at the lowest possible cost.  </p><p><a href=\"https://seekingalpha.com/checkout?service_id=mp_1368\">Click here</a> to come join us and begin your free 2-week trial!  <img src=\"https://static.seekingalpha.com/cdn/s3/marketing/16088264482965939041/image.png\" width=\"650px\"></p>", "marketingBullet": "Looking for a helping hand in the market? Members of Safe High Yield get exclusive ideas and guidance to navigate any climate.  <a href='/checkout?service_id=mp_1368&source=mp_marketing_text_top' sasource='mp_marketing_text_top'>Learn More »</a>", "isReit": false, "videoData": null, "marketingBulletVariant": "I'm Nicholas Ward, a financial analyst covering dividend growth stocks. I am a contributor to the investing group <a href=\"/checkout?service_id=mp_1319&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_bullets%3A5939041%7Csection_asset%3Aauthor_bullets%3A-the-dividend-kings\" data-test-id=\"author-custom-template-link\">The Dividend Kings</a> where we teach members how to invest more wisely in dividend stocks.", "marketingBio": "Nicholas Ward is a Senior Investment Analyst with Wide Moat Research and the former editor-in-chief and portfolio manager at The Intelligent Dividend Investor, The Dividend Growth Club, and The Income Minded Millennial.  \n                                                                                                                                                                                                                               Nicholas is a contributor to the investing group <a href=\"/checkout?service_id=mp_1319&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A5939041%7Csection_asset%3Aauthor_root%3A-the-dividend-kings\" data-test-id=\"author-custom-template-link\">The Dividend Kings</a> where he shares analysis on dividend growth stocks. The Dividend Kings is a group of analysts, led by Dividend Sensei, that teach members how to invest more wisely in dividend stocks. The focus is on helping investors safeguard and grow their money in all market conditions through the highest-quality dividend investments. Features include: 13 model portfolios, buy ideas, company research reports, and a thriving chat community for readers looking to learn how to invest more intelligently in dividend stocks. <a href=\"/checkout?service_id=mp_1319&source=content_type%3Areact%7Curl_first_level%3Asa-source-first-level-url%7Csection%3Aauthor_root%3A5939041%7Csection_asset%3Aauthor_root%3A-the-dividend-kings\" data-test-id=\"author-custom-template-link\">Learn more</a>.", "audioDuration": null}, "relationships": {"author": {"data": {"id": "44781", "type": "author"}}, "sentiments": {"data": [{"id": "329684", "type": "sentiment"}]}, "primaryTickers": {"data": [{"id": "4040", "type": "tag"}]}, "secondaryTickers": {"data": []}, "otherTags": {"data": [{"id": "97701", "type": "tag"}, {"id": "156", "type": "tag"}, {"id": "17829", "type": "tag"}, {"id": "17335", "type": "tag"}, {"id": "16549", "type": "tag"}, {"id": "326", "type": "tag"}, {"id": "17860", "type": "tag"}]}, "coAuthors": {"data": []}, "presentations": {"data": []}, "updates": {"data": []}, "corrections": {"data": []}}, "links": {"self": "/article/4435199-hasbro-starting-to-look-attractive", "canonical": "https://seekingalpha.com/article/4435199-hasbro-starting-to-look-attractive", "uriImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-w1536", "schemaImage": ["https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-w1280", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-crop-16-9", "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/512885688/image_512885688.jpg?io=getty-c-crop-4-3"]}}, "included": [{"id": "1026", "type": "authorResearch", "attributes": {"createdAt": "2016-02-05T06:54:50-05:00", "title": "iREIT®+HOYA Capital", "rating": "4.8", "reviewCount": 456, "shortPitch": "Enrich Your Retirement with Safe and Reliable REIT Income", "categories": ["Income", "REITs"], "serviceAssistantIds": [17838342, 51680711, 50064784, 15127382, 2670, 10007051, 27886573, 49839830, 13800852, 50785209, 49836612, 4847251, 5764111, 57332724, 56579885, 31557165, 11947801, 60682554, 330973, 58613619, 54869375, 59404817], "inAppPurchasesAllowedInIos": true, "inAppPurchasesAllowedInAndroid": true, "activeSubscriptionsCount": 135535, "androidIapPlan": "semi_annual", "iosIapPlan": "annual", "description": "iREIT®+HOYA Capital helps members build a sustainable real estate portfolio for steady income generation. In addition to REITs, the service focuses on real income-producing asset classes: ETFs, closed-end funds, preferreds, homebuilders, and dividend champions across various investing vehicles. Members gain access to an extensive suite of Investment Research Trackers and Dividend Tools including data on more than 200 REITs, targeting dividend yields of up to 10%.", "landingPageColor": "light-green", "adUnits": ["direct_access", "trading_alert", "active_chat", "model_portfolio", "exclusive_idea", "wildcard"], "tempData": {}, "price": 81.0, "wildcardText": "CEO Interviews", "slug": "ireit-hoya-capital", "annualPriceWithDiscount": 519.2, "monthlyPlanEnabled": false, "status": "active", "showHeadlines": true}, "relationships": {"author": {"data": {"id": "98286", "type": "author"}}}}, {"id": "44781", "type": "author", "attributes": {"company": null, "slug": "nicholas-ward", "userId": 5939041, "tagId": 97701, "bio": "<p>Nicholas Ward is a Senior Investment Analyst with Wide Moat Research and the former editor-in-chief and portfolio manager at The Intelligent Dividend Investor, The Dividend Growth Club, and The Income Minded Millennial. </p><p> Nicholas is a contributor to the investing group <a href=\"https://seekingalpha.com/checkout?service_id=mp_1319\">The Dividend Kings</a> where he shares analysis on dividend growth stocks. The Dividend Kings is a group of analysts, led by Dividend Sensei, that teach members how to invest more wisely in dividend stocks. The focus is on helping investors safeguard and grow their money in all market conditions through the highest-quality dividend investments. Features include: 13 model portfolios, buy ideas, company research reports, and a thriving chat community for readers looking to learn how to invest more intelligently in dividend stocks. <a href=\"https://seekingalpha.com/checkout?service_id=mp_1319\">Learn More</a>.</p>", "image": {"small": "https://static1.seekingalpha.com/images/users_profile/005/939/041/small_pic.png", "medium": "https://static1.seekingalpha.com/images/users_profile/005/939/041/medium_pic.png", "big": "https://static1.seekingalpha.com/images/users_profile/005/939/041/big_pic.png", "extra_large": "https://static1.seekingalpha.com/images/users_profile/005/939/041/extra_large_pic.png"}, "nick": "Nicholas Ward", "deactivated": null, "memberSince": 2012, "isRss": false, "contributorSince": 2013, "followersCount": 33656}, "relationships": {"user": {"data": {"id": "5939041", "type": "user"}}, "userBioTags": {"data": [{"id": "141833", "type": "userBioTag"}, {"id": "141843", "type": "userBioTag"}, {"id": "141853", "type": "userBioTag"}, {"id": "141863", "type": "userBioTag"}]}, "authorResearch": {"data": {"id": "1026", "type": "authorResearch"}}}, "links": {"self": "/author/nicholas-ward", "profileUrl": "/author/nicholas-ward", "site": null, "linkedinUrl": null, "twitterUrl": null}}, {"id": "4040", "type": "tag", "attributes": {"slug": "has", "name": "HAS", "company": "Hasbro, Inc.", "tagKind": "Tags::Ticker", "equityType": "stocks", "exchange": "NASDAQ", "fundTypeId": 0, "isDefunct": false, "currency": "USD", "isBdc": false, "isReit": false, "isEtf": false}, "relationships": {"sector": {"data": {"id": "25", "type": "sector"}}}, "links": {"self": "/symbol/HAS"}}, {"id": "97701", "type": "tag", "attributes": {"slug": "nicholas-ward", "name": "Nicholas Ward", "company": null, "tagKind": "Tags::AuthorTag"}, "links": {"self": "/author/nicholas-ward"}}, {"id": "156", "type": "tag", "attributes": {"slug": "dividend-ideas", "name": "Dividend Ideas", "company": null, "tagKind": "Tags::Theme"}, "links": {"self": "/articles?filters=dividend-ideas"}}, {"id": "17829", "type": "tag", "attributes": {"slug": "consumer-goods", "name": "Consumer Goods", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/consumer-goods"}}, {"id": "17335", "type": "tag", "attributes": {"slug": "sa-exclusive", "name": "SA Exclusive", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/sa-exclusive"}}, {"id": "16549", "type": "tag", "attributes": {"slug": "investing-income", "name": "Dividends & Income", "company": null, "tagKind": "Tags::Dashboard"}, "links": {"self": "/tag/investing-income"}}, {"id": "326", "type": "tag", "attributes": {"slug": "us", "name": "United States", "company": null, "tagKind": "Tags::Country"}, "links": {"self": "/articles?filters=us"}}, {"id": "17860", "type": "tag", "attributes": {"slug": "toys-games", "name": "Toys & Games", "company": null, "tagKind": "Tag"}, "links": {"self": "/tag/toys-games"}}, {"id": "329684", "type": "sentiment", "attributes": {"articleId": 4435199, "type": "neutral", "createdAt": "2021-06-16T15:33:54.000-04:00", "typeId": 2}, "relationships": {"article": {"data": {"id": "4435199", "type": "article"}}, "tag": {"data": {"id": "4040", "type": "tag"}}}}]}